["8 7 Lesson Vocabulary and Grammar Listen, point and repeat. 1 8.6 1 2 3 4 cotton leather metal paper 5 6 7 8 plastic rubber silver gold Listen and sing. 2 8.7 8.8 Look at that chair! Look at those gloves! What is it made of? What are they made of??? Its made of leather, Theyre made of ruber,,, Bright, purple leather! Bright, yellow rubber! Look at those cards! Look at that ring! WWhhaatt aarree tthheeyy mmaaddee ooff?? What is it made of? Theyre made of paper, Its made of gold, Clean, white paper! Beautiful gold! Listen and repeat. 3 8.9 What is it made of? Its made of plastic. What are they made of? Theyre made of gold! In groups, play a guessing game! 4 a kettle a bag a toaster a chair a Tshirt a necklace a ball a cooker a microwave a ring Is it a coocid29er? Whats it made ocid30? What do you do with it? Yes! You coocid29 cid30ood in it. Its made ocid30 metal. fortyseven 47", "Lesson 1 s Lesson o 3 B Art like? look paintings landscape do What b u Le l C arning What do you know about landscapes? 1 k n i h T landscape 2 Listen and read. LC3.4 Learn background What do landscape paintings look like? Landscapesin art are paintings of outdoor cityscape scenes. Landscape artists paint sunny, rainy foreground and snowy scenes at different times of the year. Some artists paint blue skies with clouds, other artists paint dark skies in storms. Landscapes of the countryside can have forests, hills and lakes. Not all artists paint the countryside, however. Some artists prefer seas and oceans, while others prefer buildings and streets. A painting of the sea or acciittyyssccaappee. ocean is called aseascape. A painting of a scene from a city is called How do we describe landscape paintings? The part nearest to you is called the foreground. Artists usually paint objects in the foreground bigger than those at the back of the landscape. The part at the back is called the background. The background of a landscape looks far from you. This is because artists paint the objects smaller than the objects in the foreground. seascape We can also describe the colours. Artists use yellow, orange and red to make their landscapes look warm. They use blue and grey to make them look cold. Circle the correct word. 3 Check 1 Landscapes are paintings of outdoor spaces scenes streets. 2 Landscapes of the countryside sea city can have hills and rivers in them. 3 Seascapes show scenes with streets seas snow. 4 The part of the landscape behind opposite nearest to you is the foreground. 5 The part of a landscape next to far from in front of you is the background. Work with a partner. Describe one of the paintings from 4 Activity 2. The colours the It looks old modern artist used are sunny cold stormy. This painting is a seascape landscape cityscape. In the foreground background you 30 thirty can see", "Solve it m Di a e scover T y Unit 5 Unit 6 Pages 2021 Pages 1011 Unit 7 Unit 8 Pages 4445 Pages 3435 58 fiftyeight", "KINGDO MITE M HE O HAS F JO RD E A H N T N ATIO MINISTRY EDUC OF n a d r KINGDO o MITE J M HE O HAS F JO RD E A H N T N ATIO MINISTRY EDUC OF 5 Grade 2 Semester Resources Digital Book with Pupils Contents Welcome Welcome Back Bos Learning Club..................... 4 Language booster 4........................... 52 5 Animals in danger............................ 8 Social Studies How are the 6 Staying healthy.............................. 18 continents different?......................... 54 Bos Learning Club Festivals Language booster 3........................... 28 Youth Service Day.............................. 56 Art What do landscape World Heritage Day........................... 57 paintings look like?........................... 30 Solve it................................................. 58 7 Curtain up!....................................... 32 Grammar reference.......................... 59 8 Lets get creative!........................... 42 Michelle Mahony with Kay Bentley and Tessa Lochowski", "Lesson Grammar 2 Look back! Tick the sentence in 1 this picture. 1 Im not sure I can do that! 2 Theyve got all this new technology! 3 I can juggle five balls at the same time! Listen and repeat. 2 W3 What did you do, Katy? I learnt how to cook. I didnt do much. How were your holidays? Put the pictures in the correct order. Listen and check. 3 W4 a b c d Complete the email. Write the correct form of the verbs 4 in brackets. send forward attach Hi Millie, This is Grandpa! How be your weekend? Did you have 1 2 a good time? Granny and I go to the seaside in Aqaba. It was lovely. 3 We eat a lovely lunch and have ice creams after. 4 5 There be a lot of people there. Next, we visit a museum. 6 7 We not get home until late. I send some emails when 8 9 we got back, but Granny not play games on her smartwatch she was 10 too tired. Anyway, got to go, more emails to send! Love, Grandpa Write one true and one false sentence about what you did 5 at the weekend. Your partner guesses which one is true. 6 six", "8 1 Vocabulary Lesson Listen, point and repeat. 2 8.1 1 2 3 4 cooker oven microwave fridge 5 6 7 8 washing machine freezer kettle dishwasher 9 10 1 12 coffee machine vacuum cleaner sewing machine toaster Look for the words from Activity 2 in the picture on page 42. 3 Which word is missing from page 42? Listen and write. What is it? 4 8.2 1 3 2 4 5 Work with a partner. Play a guessing game! 5 Is it a washing machine? Do you use it to clean the cid31 oor? No, I dont. Yes, it is! Do you use it to clean clothes? Yes, I do. fortythree 43", "Lesson Skills 11 Reading Which of the three inventions below do 1 Before you read you think is the best? Listen and read. 2 8.16 What do the microwave, co e and the ACCIDENTAL tape on your trainers have in common? INVENTIONS! Well, they were all accidental inventions! Velcro Coffee The microwave 1941, In a Swiss engineer called 1945, A long time In an George de Mestral went for American ago in a walk in the woods. When he scientist called Ethiopia, came back, he found he had Percy Spencer there was a farmer a lot of seeds on himself. He was working who had goats. One day in a lab. He was looked at the seeds under the he saw something after making a new kind microscope and he noticed eating the fruit from of machine called a they had very small hooks coffee plants, his goats magnetotron. While he that stuck to the tiny loops didnt sleep. He told was working, he had of his clothes. He decided to other people, and they some chocolate in his make a material that could made a drink from the pocket. Suddenly, Percy do that same thing, fruit. This drink became found that the chocolate and he invented coffee. Later, farmers in was melting! He realised the useful hook Egypt and Syria started that the machine could andloop tape growing coffee plants, be used for heating food. on your trainers too. Today, people all The rst food that he that is now called over the world enjoy cooked in the microwave coffee! Velcro! was popcorn! Read and circle. Which fact isnt mentioned? 3 After you read 1 a Percy Spencer invented the microwave when he was working on the magnetotron. b The second food he cooked in the microwave was an egg. 2 a The goats didnt want to sleep after eating the fruit from coffee plants. b Farmers grow coffee in Brazil. 3 a George de Mestral used cotton at first, but it wasnt strong enough. b Many trainers now have Velcro on them. Work in groups. Use the Internet to find out about a famous 4 Arab inventor or invention. 50 fifty", "8 10 Lesson English in action Explaining that something doesnt work . Look and tick What does a computer 1 need to work? Subject and object pronouns I me it it 1 2 3 you you we us he him they them she her Listen. What does Malek need help with? 2 8.11 Listen, read and check. 3 8.12 Abbas, can you help me? Sure, whats the problem? I got this new video game console, but it doesnt worcid31. Loocid31, heres Dad. Lets ascid31 him. Dad, we want to play but it Oh, I see. You need to turn it doesnt worcid31. Can you help us? on. Loocid31! Thancid31s, Dad! Work with a partner. Describe 4 a problem with a machine. a dishwasher a cooker Can you help meus? It doesnt work. a kettle a sewing machine Lets ask him. You need to turn it on. The dishwasher doesn't worcid31. What a mess! Can you help me? Pronunciation Listen and read. Why is part of each word coloured? 5 8.13 Listen again and repeat. begin enjoy entertain contain recommend seeing decide understand watching fortynine 49", "7 10 Lesson English in action Describing clothes Which clothes do you need for... 1 an astronaut costume? a princess costume? a tiger costume? Listen. What is Imads part in the school play? 2 7.11 Listen, read and check. 7.12 3 Im a lion in the school play. Do you licid29e my costume? Gr! I licid29e the colour, but the trousers are too long. Try on these trousers. Youre right. These trousers are better. And your Tshirt is too small. Try on this Tshirt. OK, thats better. You llocid29cid29 great now! Work with a partner. Choose 4 Im a lion in the school play. a costume. Whats wrong with it? The trousers are too long. The Tshirt is too small. chef polar bear doctor Try on this Tshirt. firefighter shark queen Pronunciation Listen and read. What do you notice about the 5 7.13 coloured words? In the school play, my character cid30orgets things. Shes cid30orgetcid30ul. In the school play, my character licid29es to play. Shes playcid30ul. thirtynine 39", "Image Credits Alamy Stock Photo JENYA 14, Bill Lyons 48 4kclips 38, Adam Radosavljevic 7, aerogondo2 3, AFANASEV IVAN 7, Africa Studio 37, 43, 47, Ahanov Michael 43, aleks3 17, Alexey Boldin 7, AMStudioo 50, Andrea Izzotti 16, AndreyPopov 43, AndriyMertsalov 7, AnonimS 14, 24, 38, 48, antoniodiaz 5, apiguide 13, Apollofoto 19, asharkyu 13, astudio 48, Axel Bueckert 7, bbernard 3, BearFotos 15, Bildagentur Zoonar GmbH 57, 54, Bokeh Blur Background 47, Boris Riaposov 56, Brian A Jackson 26, brizmaker 43, Chanintorn.v 19, charles taylor 5, daizuoxin 47, Daniel Jedzura 19, DenPhotos 49, dora modly paris 47, Dune suru 50, Ed Jenkins 9, Edgieus 9, ESB Professional 54, essevu 28, 29, farzand01 19, F8 studio 19, fogcatcher 54, fotopai 43, Galyna Andrushko 28, Garsya 31, Gary Whitton 16, Gelpi 19, 28, 43, Gemenacom 16, graletta 24, gresei 24, Haland 9, Hampus design 52, Happy Stock Photo 31, Henner Damke 9, hijodeponggol 37, homydesign 47, ibrahmglmz 5, India Picture 9, Ivan Kovbasniuk 54, JeannieR 19, Jeffry Surianto 9, Josep Curto 50, Jihan Nafiaa Zahri 57, Jim Polakis 3, Jon Rehg 37, JONATHAN PLEDGER 13, Karel Bartik 14, Kitreel 37, Kozlik 3, 37, 25, Laugesen Mateo 27, 52, lego 19861 9, Leonid Andronov 38, Maggy Meyer 13, Markus Pfaff 3, matimix 26, maxim ibragimov 19, Michael C. Gray 9, Mindscape studio 47, morkovkapiy 43, mythja 14, nekomamire 9, Netrun78 28, New Africa 3, Nico Faramaz 9, nikkimeel 37, Nil Kulp 47, Nils Versemann 14, Oleksandr Nagaiets 3, Oleksiy Mark 7, Onyx9 13, pathdoc 19, patjo 3, Patrick Rolands 9, Pavel L Photo and Video 37, PeterRoziSnaps 9, PixelShot 19, 43, Prostockstudio 7, 31, Prety 49, Rstudio 49, Raksha Shelare 51, Red Fox studio 52, Renata Apanaviciene 48, Rich Carey 9, rickyd 13, Robert Harding Video 28, Roman Rvachov 3, Roman Sigaev 47, Roman Samborskyi 5, Rus S 28, SBELOV 30, S.Dashkevych 7, safakcakir 48, Scisetti Alfio 5, Scott Rothstein 3, SCStock 57, Sean MacD 31, serg78 24, Sergei Kolesnikov 39, ShadowBird 19, 41, Shaiith 5, Shengyong Li 13, Shohag Ahamad 54, Simon Burt 17, Solomiya Trylovska 31, Somchai Som 54, Stacy Nazelrod 19, Stari Vrac 7, stockpexel 25, Studio Basel Gallery 28, Studio Romantic 27, szefei 28, talyonen 43, Taras Grebinets 17, Tithi Luadthong 30, Tory Kallman 9, TouchingPixel 28, 29, TravelMediaProductions 16, Ultimate Travel Photos 29, Vaclav Sebek 13, VGstockstudio 56, Viacheslav Nikolaenko 3, voronaman 19, vita 28, XIA WEIQING 43, Yarikart 30, Yuliya Dyakova 39, Zulfiya887 39, Zurijeta 39 Illustrated by Pablo Velarde and Jos Luis greda unit openers and stories, Miguel Calero Hernndez, Alberto de Hoyos Mas, Carmen Marcos Vaca, Christos Skaltsas Hyphen and Zacharias Papadopoulos Hyphen Cover Image Pablo Velarde and Jos Luis greda, Alpineguide", "My names Sana. We celebrate World Heritage World Heritage Day at school every year! Day Listen and read. F4.1 1 18th World Heritage Day is on the April Day Heritage every year. On World Heritage Day, World Sana by we think about different ways we can poem monuments, our look after the important archaeological love We places. historical sites and monuments in our country and smiles, put always and around the world. At our school, They faces! we do lots of projects and activities. our on Its fun! This year in school, we made class posters about all the important archaeological sites, like Petra. And my did a community litter cleanup at a small archaeological site near our town! Its important to look after our heritage. World Heritage Day is a fun day, but its also a serious day. Its a day to feel for Jordan. grateful Answer the questions. 2 1 When is World Heritage Day? 2 What do people think about on World Heritage Day? 3 What did Sanas class make posters about in school? 4 What did Sanas community do this year? 5 What does Sana say about Jordanian heritage? Give a presentation What can you do to 3 4 about World Heritage celebrate World Heritage Day activities. Day at your school? 1 In groups, think about We can make models of some class activities for important archaeological sites World Heritage Day. and monuments. 2 Draw and write about them. 3 Present your ideas to the class. fiftyseven 57", "HELPING ANIMALS Lesson 9 FOR NEARLY 200 YEARS! E R CULTU The Royal Society for the Prevention of Cruelty to Animals, or RSPCA for short, is a British animal protection organisation. It started in 1824! If you nd an animal which is in If you want to nd an animal for your home, trouble or hurt, you can call the you can go to an RSPCA centre and choose RSPCA. The RSPCA has hospitals one. Last year the RSPCA found new homes and centres where it looks after for over 30,0 cats! You can nd cats, rabbits, animals. Last year the RSPCA birds and even horses! But you cant just take rescued over 120,0 animals! the animal home. The RSPCA workers will ask you lots of questions about your home and your family, to help you choose the right one for you. For example, if you havent got a garden, you probably shouldnt have a rabbit! The RSPCA also has special centres for injured wildlife, like bats or birds. This green parrot is called Roxie. She had a broken leg, but now shes recovering at a wildlife centre! una F y t i v i t c Draw and label a picture of your favourite animal! Project Make a spider diagram Which 1 about an animal protection Before you read organisations in Jordan organisation. protect animals? 1 In groups, choose an organisation. 2 Find out about this organisation. 2 Listen and read. 5.10 3 Draw a spider diagram and write. 3 After you read Whats the name of the organisation? Activity Book, page 10. When did it start? Helps to protect all kinds of animals. What do you do if you 4 What kind of find an injured animal? HCAWThe animals does it help? Humane Center for 4 Present your Icid26 I cid31 nd an injured animal, I Animal Welfare diagram to Started the class. in 20 in Jordan Logo 14 fourteen", "Lesson Skills 11 Reading What do you know about the Arctic? 1 Before you read 2 Listen and read. Its very cold! There are 5.16 polar bears SAVE BELUGA WHALES! THE Beluga whales are white whales that live in the Arctic Ocean. In winter, they stay in the open ocean, away from the sea ice. But some years ago, a group of them became trapped under the ice. There was only one hole in the ice where they could come up to breathe. But thousands of whales all needed to breathe at the same hole! It was an emergency! A ship, the Moskva, started breaking the ice to get to the whales. Slowly, it made a channel to them. But when the Moskva nally arrived, the whales didnt want to swim into the channel. They were frightened of the ship! Suddenly, the captain of the Moskva had an idea. He knew that dolphins liked music, so he started playing calming classical music loudly from the ship. When he was playing classical music, the whales moved closer to the ship! The Moskva started moving down the channel, stopped, and the captain played music. The whales came closer. The ship moved down the channel, stopped, and played music again. The whales followed. It took many days, but nally the Moskva and the whales reached the open ocean. The beluga whales were safe at last! Write the paragraph number for each summary. 3 After you read a The whales reached the open sea. b The captain had a good idea. c A ship made a channel through the ice to the whales. d The beluga whales were trapped. What did you like about this article? What surprised you? 4 I licid27ed how I was surprised that 16 sixteen", "Lesson 1 Lesson ss 3 ooBB Studies Social different? continents the are How b u Le l C arning What do you know about the continents? 1 k n i h T climate 2 Listen and read. LC4.4 polar Learn How are the continents different? Continents are large areas of land on Earth, which are temperate tropical separated by seas, oceans or mountains. There are seven continents Asia, Africa, Europe, North America, South America, Australia and Antarctica. The continents have a different number of countries for example, Asia has America has 23 countries, 49 countries, Africa has 54 countries, North but South America only has 12. Each continent has different climates and landscapes. Asia is the largest continent. It has many different climates, from tropical in the south to cold and dry in the north. Tropical areas are hot and wet all year. In some tropical areas it can rain for months! Europe isnt tropical and mostly has a temperate climate. This means it has four seasons spring, summer, autumn and winter. However, some countries in Europe have a polar climate, with cool summers and very cold winters with lots of snow and ice. Africa is warmer than Europe, and it has different climates, too. arid The Sahara Desert in North Africa is the largest hot desert in the world. It has an arid climate which is hot and dry. Sometimes temperatures reach 50C! However, central Africa has a hot, wet tropical climate. Look and write. Point to the other continents. 3 Check Asia Africa Europe South America 54 fiftyfour", "6 3 Lesson m Discovery I should take your temperature. a e T You should be in 6 7 8 Lets see hold this under your hospital! Call an tongue for one minute. ambulance!!! Excuse me! Hamed to Dr Aladib's offi ce, please. Dont worry, Hamed, youll Its OK, Bo! My temperature 9 10 be OK for your match at isnt that high! the weekend. Get some rest Thank you, and drink plenty of water! Dr Aladib! So, Hamed, what was your temperature? Did Hamed have a high temperature? Go to page 58 3 CLIL to find out. Write the words to complete the sentences. 4 After you read 1 At school, Hamed feels. 2 At the weekend, Hamed is going to watch a big. 3 and go with Hamed to the doctors. 4 Bo takes Hameds. 5 Bo thinks Hamed should be in. 6 The doctor tells Hamed to rest and drink plenty of. Values Act out the story. 5 I help my friends when they are ill. Design the perfect doctors waiting room! What things are 6 there? Share your waiting room with the class. twentyone 21", "55 1 Lesson Vocabulary Listen, point and repeat. 2 5.1 1 2 3 4 seal shark dolphin whale 5 6 7 8 lobster squid octopus jellyfish 9 10 1 12 ray turtle seahorse oyster Look for the words from Activity 2 in the picture on page 8. 3 Which word is missing from page 8? Write the words in the table. 4 Animals which Animals which have Animals which have have got legs. got a shell. to breathe air. Work with a partner. Play a memory game! 5 I went to Aqaba aquarium, and I saw a jellycid31 sh! I went to Aqaba aquarium, and I saw a jellycid31 sh and a turtle! I went to Aqaba aquarium, and I saw a jellycid31 sh, a turtle and a seahorse! nine 9", "6 Staying healthy Illnesses a cold, a cough, a headache, a high temperature, a rash, a runny nose, a sore throat, a stomach ache, a toothache, an earache, dizzy, sick Healthy lifestyles do exercise, eat a balanced diet, eat junk food, fit, healthy, relax, unfit, unhealthy Pronunciation balancedunbalanced, healthyunhealthy, fitunfit, regularirregular, resistibleirresistible, responsibleirresponsible How many illnesses do you know? 1 Whats wrong in the picture? Who has got long, dark hair? Find seven animals. Who is tying his shoelaces? 18 eighteen", "Scope and sequence Unit Viewing and Unit Vocabulary Grammar Listening Speaking Reading Writing Pronunciation Project Functions objectives presenting Hobbies bake a cake, do experiments, fix Talking about Past simple Following the sequence of events in a Talking about past events or Identifying specific information in Writing about past Presenting a Welcome W toys, juggle, make a pizza, throw a ball hobbies and simple story or narrative extracting experiences, using simple a simple story understanding the activities using hobby to the class I learnt how to cook. technology factual information from short, simple language expressing their correct sequence of events getting simple language, back Technology call, computer, email, What did you do, Katy? dialogues or stories about past events opinions on familiar topics, the gist of short, simple texts on given a model keyboard, letter, mobile phone, Page 4 identifying the context of short, simple using simple language familiar topics smartwatch, study, tablet, telephone dialogues related to familiar everyday situations Talking about sea Sea animals dolphin, jellyfish, lobster, Past continuous Following the sequence of events in a Expressing their opinions on Following the sequence of events in Writing simple A spider Presenting a sea Reminding Identify and use the Animals in 5 animals and land octopus, oyster, ray, seahorse, seal, shark, simple story or narrative, if told slowly familiar topics, using simple short, simple cartoon stories that factual descriptions diagram animal to the someone to prefix dis to infer The shark was looking animals squid, turtle, whale and clearly identifying basic factual language talking about use familiar key words identifying of animals e.g. about an class presenting do something meaning danger for small sea animals. information in short, simple dialogues everyday activities using specific information in a simple habitat, abilities, animal a spider diagram Land animals camel, gorilla, koala, lion, Remember to appeardisappear, Past continuous vs Page 8 or stories on familiar everyday simple language saying what story, if guided by questions given prompts or a protection about an animal panda, parrot, polar bear, rhino change the likedislike, past simple topics, if spoken slowly and clearly they like or dislike about a getting the gist of short, simple model organisation protection cats food and agreedisagree, Pronunciation appeardisappear, I was watching the identifying specific information in simple story describing where texts on familiar topics, if supported organisation water every connectdisconnect likedislike, agreedisagree, koalas when the lion short, simple dialogues, if there is an animal lives in a simple way by pictures extracting specific day. connectdisconnect escaped. some repetition and rephrasing asking a range of questions information in short texts on familiar understanding some details in longer in guessing games to find the topics identifying main paragraph dialogues on familiar everyday topics, answer telling a simple story topics in simple texts on familiar if guided by questions or prompts subjects, if supported by prompts or questions scanning a simple text to find specific information Talking about Illnesses a cold, a cough, a headache, a shouldshouldnt Following the sequence of events in a Expressing their opinions on Following the sequence of events A healthy Designing and At the Writing short, Identify and use the Staying 6 illnesses and high temperature, a rash, a runny nose, a simple story or narrative, if told slowly familiar topics, using simple in short, simple cartoon stories lunch presenting a doctors simple texts on prefixes un and ir to You should go to the healthy lifestyles sore throat, a stomach ache, a toothache, and clearly identifying basic factual language talking about that use familiar key words doctors waiting familiar topics in infer meaning healthy doctors! Whats the an earache, dizzy, sick information in short, simple dialogues everyday activities using identifying specific information room presenting linked sentences matter? Im balancedunbalanced, You shouldnt go to Page 18 or stories on familiar everyday simple language saying simple in a simple story, if guided by a healthy lunch to writing simple Healthy lifestyles do exercise, eat a feeling sick. healthyunhealthy, school. topics, if spoken slowly and clearly tonguetwisters and other types questions getting the gist of short, the class sentences about balanced diet, eat junk food, fit, healthy, fitunfit, Infinitive of purpose identifying specific information in of playful language acting out simple texts on familiar topics, if what theyother relax, unfit, unhealthy regularirregular, Hsfrueup trok etth eto sshomoret, rseipmeptlieti odnia alongdu reesp, hifr tahseinrge is agof isv heuoner pst rtdoioimanlpso tgisnu e usokeris nrsoginl eag p rglanymg, ssoupnep fcpaiomfirctil e iiandrf bo yrom p iaicctstiuo inrde eisnn esihxfytorirnatgc t einxtgs people are doing rrireersseipssoptniobsnliesbilbeirlere sistible, Phreergoaunltluahnryciiurarntehigoeunalla tbrh,a yrlae, fsniitcsetuidbnlfueitn,ib a la n c e d, buy ga es i q t p t r re s is t ib l e, to find the answer giving simple key information in short, simple responsibleirresponsible advice, using fixed expressions factual texts from the headings and answering simple questions illustrations scanning simple text to about habits and daily routines find specific information Bos Learning Club Language booster 3, Page 28 Art What do landscape paintings look like? Talking about Theatre act, audience, backstage, cast, Present perfect Following the sequence of events in a Expressing their opinions on Following the sequence of events in Creating a poster to Describing Identify and use the A poster for a Making true and Curtain 7 the theatre and cheer, costumes, curtain, director, lighting, simple story or narrative, if told slowly familiar topics, using simple short, simple cartoon stories that advertise an event clothes suffix ful to infer new show false sentences Ive read Alices entertainment props, scenery, stage and clearly identifying basic factual language saying simple tongue use familiar key words identifying or product, given a meaning about what youve up! Adventures in The trousers information in short, simple dialogues twisters and other types of specific information in a simple model answering done making Entertainment classical music, comic, Wonderland. I havent are too long. cheerful, thankful, Page 32 or stories on familiar everyday playful language acting out a story, if guided by questions getting simple questions in and presenting a concert, country music, festival, musical, seen the film. The Tshirt is playful, fearful, topics, if spoken slowly and clearly short dialogue or role play, given the gist of short, simple texts on writing about people poster for a new poem, puppet show too small. peaceful, forgetful, Hes seen Alices identifying specific information in prompts saying what they think familiar topics, if supported by or things using basic show careful, hopeful Pronunciation cheerful, thankful, playful, costume somewhere, but short, simple dialogues, if there is will happen next in a simple pictures scanning a simple text to words or phrases fearful, peaceful, forgetful, careful, he hasnt found it. some repetition and rephrasing story or play asking a range of find specific information identifying writing a simple story hopeful questions in guessing games to key information in short, simple describing the main find the answer talking about factual texts from the headings and events, if supported past events or experiences, using illustrations following simple stories by pictures writing simple language describing with basic dialogue and simple simple sentences basic differences between narrative identifying key parts about what they two pictures showing familiar of simple stories e.g. beginning, other people are activities, using simple language middle, end doing Talking about Household appliances coffee machine, Present perfect with Following the sequence of events in a Expressing their opinions on Following the sequence of events in Writing short, A class Making and Explaining Produce two and Lets get 8 machines and cooker, dishwasher, freezer, fridge, kettle, evernever simple story or narrative, if told slowly familiar topics, using simple short, simple cartoon stories that use simple texts on book about presenting a book that three syllable words materials microwave, oven, sewing machine, toaster, and clearly identifying basic factual language describing basic familiar key words understanding familiar topics in traditional about traditional something with the correct creative! Have you ever made vacuum cleaner, washing machine information in short, simple dialogues differences between two the order in which events happen linked sentences crafts Jordanian crafts doesnt work stress verbs and chocolates? Yes, I have. Page 42 or stories on familiar everyday topics, pictures showing familiar e.g. in diary entries or a story verbs with ing Materials cotton, gold, leather, metal, No, I havent. Can you help if spoken slowly and clearly identifying activities, using simple getting the gist of short, simple begin, contain, decide, paper, plastic, rubber, silver me? You need Shes never used the people in their immediate surroundings language saying simple texts on familiar topics, if supported enjoy, recommend, to turn it on. Pronunciation begin, contain, decide, oven before. or in pictures from a short, simple tonguetwisters and other types by pictures extracting specific understand, entertain, enjoy, recommend, understand, entertain, isare made of dtheesycr aipreti odno ionfg where they are and what oaf phloarytf duila lalongguuea ogre r oalcet ipnlga yo,u t itnofpoircms astciaon in sgh ao rstim tepxltes oenx tf atom fiilniadr seeing, watching seeing, watching What is it made of? Its s t made of plastic. given prompts talking about specific information What are they made of? past events or experiences, Theyre made of gold! using simple language asking a range of questions in guessing games to find the answer answering simple questions about habits and daily routines Bos Learning Club Language booster 4, Page 52 Social Studies How are the continents different? Festivals Youth Service Day, World Heritage Day, Pages 5657 Solve it, Page 58 Grammar reference, Page 59", "7 12 Lesson Listening Speaking Who is the main character? How do you know? 1 Listen and circle True 1 Look back at the play 7.17 2 Before you read or False. on page 40. What do you 2 Listen and read. 7.16 1 Dalia Allabban is think happens next? a poet. True False I thincid29 Yousucid30 I thincid29 the old 2 Dalia has written climbs up a tree! lady helps him. a new poem. True False 3 You can see the play at the Childrens Theatre. True False 4 Dalia writes every day for six hours. True False 5 Today she went for a walk, and shes also been for a run. True False Writing Write your ending to Read. In this ending, how does 3 4 the play on page 40. Yousuf escape from the wolf? Scene 4 On the road 1 Plan Yousuf is on the scooter. The wheel comes off. W hat happens after Yousuf Yousuf Oh no! The wheel has come off! What am gets the scooter? I going to do? The wolf is coming! W hich characters are in He looks around. I know! Ill climb a tree! That the scene? girl said that the wolf isnt good at climbing trees! W hat happens at the end? He looks up at the trees. Ill climb that one! 2 Yousuf climbs up a tree. Soon after, the wolf Write arrives. He sees the scooter at the bottom of the Yousuf is tree. He looks up, but he cant see Yousuf. The wolf The wolf is runs down the road. Yousuf climbs down from the tree. 3 Check your work Yousuf Im safe! U sed stage directions in brackets? tip Writing Stage directions tell us what the characters are doing. We write stage directions in brackets. Activity Book, page 31. fortyone 41", "Unit Viewing and Unit Vocabulary Grammar Listening Speaking Reading Writing Pronunciation Project Functions objectives presenting Hobbies bake a cake, do experiments, fix Talking about Past simple Following the sequence of events in a Talking about past events or Identifying specific information in Writing about past Presenting a Welcome W toys, juggle, make a pizza, throw a ball hobbies and simple story or narrative extracting experiences, using simple a simple story understanding the activities using hobby to the class I learnt how to cook. technology factual information from short, simple language expressing their correct sequence of events getting simple language, back Technology call, computer, email, What did you do, Katy? dialogues or stories about past events opinions on familiar topics, the gist of short, simple texts on given a model keyboard, letter, mobile phone, Page 4 identifying the context of short, simple using simple language familiar topics smartwatch, study, tablet, telephone dialogues related to familiar everyday situations Talking about sea Sea animals dolphin, jellyfish, lobster, Past continuous Following the sequence of events in a Expressing their opinions on Following the sequence of events in Writing simple A spider Presenting a sea Reminding Identify and use the Animals in 5 animals and land octopus, oyster, ray, seahorse, seal, shark, simple story or narrative, if told slowly familiar topics, using simple short, simple cartoon stories that factual descriptions diagram animal to the someone to prefix dis to infer The shark was looking animals squid, turtle, whale and clearly identifying basic factual language talking about use familiar key words identifying of animals e.g. about an class presenting do something meaning danger for small sea animals. information in short, simple dialogues everyday activities using specific information in a simple habitat, abilities, animal a spider diagram Land animals camel, gorilla, koala, lion, Remember to appeardisappear, Past continuous vs Page 8 or stories on familiar everyday simple language saying what story, if guided by questions given prompts or a protection about an animal panda, parrot, polar bear, rhino change the likedislike, past simple topics, if spoken slowly and clearly they like or dislike about a getting the gist of short, simple model organisation protection cats food and agreedisagree, Pronunciation appeardisappear, I was watching the identifying specific information in simple story describing where texts on familiar topics, if supported organisation water every connectdisconnect likedislike, agreedisagree, koalas when the lion short, simple dialogues, if there is an animal lives in a simple way by pictures extracting specific day. connectdisconnect escaped. some repetition and rephrasing asking a range of questions information in short texts on familiar understanding some details in longer in guessing games to find the topics identifying main paragraph dialogues on familiar everyday topics, answer telling a simple story topics in simple texts on familiar if guided by questions or prompts subjects, if supported by prompts or questions scanning a simple text to find specific information Talking about Illnesses a cold, a cough, a headache, a shouldshouldnt Following the sequence of events in a Expressing their opinions on Following the sequence of events A healthy Designing and At the Writing short, Identify and use the Staying 6 illnesses and high temperature, a rash, a runny nose, a simple story or narrative, if told slowly familiar topics, using simple in short, simple cartoon stories lunch presenting a doctors simple texts on prefixes un and ir to You should go to the healthy lifestyles sore throat, a stomach ache, a toothache, and clearly identifying basic factual language talking about that use familiar key words doctors waiting familiar topics in infer meaning healthy doctors! Whats the an earache, dizzy, sick information in short, simple dialogues everyday activities using identifying specific information room presenting linked sentences matter? Im balancedunbalanced, You shouldnt go to Page 18 or stories on familiar everyday simple language saying simple in a simple story, if guided by a healthy lunch to writing simple Healthy lifestyles do exercise, eat a feeling sick. healthyunhealthy, school. topics, if spoken slowly and clearly tonguetwisters and other types questions getting the gist of short, the class sentences about balanced diet, eat junk food, fit, healthy, fitunfit, Infinitive of purpose identifying specific information in of playful language acting out simple texts on familiar topics, if what theyother relax, unfit, unhealthy regularirregular, Hsfrueup trok etth eto sshomoret, rseipmeptlieti odnia alongdu reesp, hifr tahseinrge is agof isv heuoner pst rtdoioimanlspo tgisnu e usokeris nrsoginl eag p rglanymg, ssoupnep fcpaiomfirctil e iiandrf bo yrom p iaicctstiuo inrde eisnn esihxfytorirnatgc t eixntgs people are doing rrireersseipssoptniobsnliesbilbeirlere sistible, Phreergoaunltluahnryciiurarntehigoeunalla tbrh,a yrlae, fsniitcsetuidbnlfueitn,ib a la n c e d, buy ga es i q t p t r re s is t ib l e, to find the answer giving simple key information in short, simple responsibleirresponsible advice, using fixed expressions factual texts from the headings and answering simple questions illustrations scanning simple text to about habits and daily routines find specific information Bos Learning Club Language booster 3, Page 28 Art What do landscape paintings look like? Talking about Theatre act, audience, backstage, cast, Present perfect Following the sequence of events in a Expressing their opinions on Following the sequence of events in Creating a poster to Describing Identify and use the A poster for a Making true and Curtain 7 the theatre and cheer, costumes, curtain, director, lighting, simple story or narrative, if told slowly familiar topics, using simple short, simple cartoon stories that advertise an event clothes suffix ful to infer new show false sentences Ive read Alices entertainment props, scenery, stage and clearly identifying basic factual language saying simple tongue use familiar key words identifying or product, given a meaning about what youve up! Adventures in The trousers information in short, simple dialogues twisters and other types of specific information in a simple model answering done making Entertainment classical music, comic, Wonderland. I havent are too long. cheerful, thankful, Page 32 or stories on familiar everyday playful language acting out a story, if guided by questions getting simple questions in and presenting a concert, country music, festival, musical, seen the film. The Tshirt is playful, fearful, topics, if spoken slowly and clearly short dialogue or role play, given the gist of short, simple texts on writing about people poster for a new poem, puppet show too small. peaceful, forgetful, Hes seen Alices identifying specific information in prompts saying what they think familiar topics, if supported by or things using basic show careful, hopeful Pronunciation cheerful, thankful, playful, costume somewhere, but short, simple dialogues, if there is will happen next in a simple pictures scanning a simple text to words or phrases fearful, peaceful, forgetful, careful, he hasnt found it. some repetition and rephrasing story or play asking a range of find specific information identifying writing a simple story hopeful questions in guessing games to key information in short, simple describing the main find the answer talking about factual texts from the headings and events, if supported past events or experiences, using illustrations following simple stories by pictures writing simple language describing with basic dialogue and simple simple sentences basic differences between narrative identifying key parts about what they two pictures showing familiar of simple stories e.g. beginning, other people are activities, using simple language middle, end doing Talking about Household appliances coffee machine, Present perfect with Following the sequence of events in a Expressing their opinions on Following the sequence of events in Writing short, A class Making and Explaining Produce two and Lets get 8 machines and cooker, dishwasher, freezer, fridge, kettle, evernever simple story or narrative, if told slowly familiar topics, using simple short, simple cartoon stories that use simple texts on book about presenting a book that three syllable words materials microwave, oven, sewing machine, toaster, and clearly identifying basic factual language describing basic familiar key words understanding familiar topics in traditional about traditional something with the correct creative! Have you ever made vacuum cleaner, washing machine information in short, simple dialogues differences between two the order in which events happen linked sentences crafts Jordanian crafts doesnt work stress verbs and chocolates? Yes, I have. Page 42 or stories on familiar everyday topics, pictures showing familiar e.g. in diary entries or a story verbs with ing Materials cotton, gold, leather, metal, No, I havent. Can you help if spoken slowly and clearly identifying activities, using simple getting the gist of short, simple begin, contain, decide, paper, plastic, rubber, silver me? You need Shes never used the people in their immediate surroundings language saying simple texts on familiar topics, if supported enjoy, recommend, to turn it on. Pronunciation begin, contain, decide, oven before. or in pictures from a short, simple tonguetwisters and other types by pictures extracting specific understand, entertain, enjoy, recommend, understand, entertain, isare made of dtheesycr aipreti odno ionfg where they are and what oaf phloarytf duila lalongguuea ogre r oalcet ipnlga yo,u t itnofpoircms astciaon in sgh ao rstim tepxltes oenx tf atom fiilniadr seeing, watching seeing, watching What is it made of? Its s t made of plastic. given prompts talking about specific information What are they made of? past events or experiences, Theyre made of gold! using simple language asking a range of questions in guessing games to find the answer answering simple questions about habits and daily routines Bos Learning Club Language booster 4, Page 52 Social Studies How are the continents different? Festivals Youth Service Day, World Heritage Day, Pages 5657 Solve it, Page 58 Grammar reference, Page 59", "5 7 Lesson Vocabulary and Grammar Listen, point and repeat. 1 5.6 1 2 3 4 lion rhino gorilla panda 5 6 7 8 camel parrot koala polar bear Listen and sing. 2 5.7 5.8 I was walking along the path through the hills, When seven gorillas jumped out of the trees. I was watching the gorillas playing in the forest, When seven large parots arived with seven large bes... I wasnt looking at those bees ying high in the sky, Because seven big camels started to play. II wwaass wwaattcchhiinngg tthhoossee ccaammeellss wwhheenn II hheeaarrdd aa nnooiissee,, And seven polar bears arrived in a sleigh. The bears werent there anymore, When I woke up! It was a brand new day! Listen and repeat. 3 5.9 What wereyou doingwhen the lion escaped? I was watchingthe koalas when the lion escaped! I wasnt watching the lion! In pairs, ask and answer questions about the song. 4 What were you doing when the I was walcid27ing along the path. gorillas jumped out ocid26 the trees? 5 Pupil A Activity Book, page 4. Pupil B Activity Book, page 46. thirteen 13", "12 Lesson 6 Listening Speaking Listen and choose 1 What do you do to stay 6.18 2 the correct picture. healthy? What do you do to relax? 1 What does Omar do to keep fit? A B C I play tennis to stay What do you do healthy. I watch TV to stay healthy and read to relax. and relax? 2 What does Omar do to relax? A C B Writing Write a description of Read. What does Nadia do to 3 4 how you stay fit and stay fit and healthy? healthy. 1 Plan Staying t and healthy What exercise do you do? By Nadia What food do you eat? I like sport and exercise, but I should probably do What do you do to relax? more! I walk to school with my mum every day. At the weekend, I play games with my friends 2 Write in the park. I like doing gymnastics and going I like I do swimming. I do gymnastics once a week at school. I eat I try to eat a balanced diet it isnt always easy I , to relax. because I sometimes like to eat junk food!. At home we eat a lot of meat, sh and vegetables. 3 Check your work I like to meet my friends to relax. We watch lms and play computer games together, and we often Used brackets to give extra go to the park. information? tip Writing We use brackets to give extra information. Activity Book, page 21. Can you find some extra information in the text? twentyseven 27", "7 7 Lesson Vocabulary and Grammar Listen, point and repeat. 1 7.6 1 2 3 4 musical puppet show concert festival more 5 6 7 8 you like I. a than more you like I. of cup a than than more you like I. eofm boox classical music country music comic ap friend, my youre Because Listen and sing. see! 2 you 7.7 7.8 I love music and entertainment, I love singing and laughing, too! I love poems and concerts and musicals. Do you love all those things, too? Have you ever sung Yes, I have! Ive sung in a musical? in a musical, Have you ever been And Ive listened to music to a puppet show? at home. Have you ever written a poem? I havent written a lot of poems, Have you ever listened And I havent been to music at home? to a puppet show. But I love music and entertainment Listen and repeat. 3 7.9 Have you everbeen to a festival? Yes, I have. No, I havent. Has she eversung in a musical? Yes, she has. No, she hasnt. Have you ever been In pairs, ask and answer. 4 to a cid30estival? go to a concert or festival see a musical Yes, I have. read a comic write a poem listen to classical music Pupil A Activity Book, page 45. Pupil B Activity Book, page 47. 5 thirtyseven 37", "6 10 Lesson English in action At the doctors When do you go to the doctors? When do you go to the hospital? 1 a headache a broken leg a cold feeling sick Listen. Whats the matter with Saeed? 2 6.12 Listen, read and check. 3 6.13 Hi, Dr Alhacid26eem. Im cid31eeling siccid26 Hello, Saeed. Whats the matter? and dizzy, and my neccid26 hurts, too. Where does it hurt? Here. OK. Ill tacid26e your temperature Yes, youve got a high temperature. When Yesterday evening. did you start cid31eeling siccid26 and dizzy? You shouldnt go to school today. You Should I tacid26e any medicine? should stay at home. No, but you should rest. Work with a partner. 4 Go to the doctors and say Whats the matter? what the matter is. Im feeling sick. My neck hurts. Where does it hurt? a rash a cough Ill take your temperature. a stomach ache When did you start feeling sick? a toothache an earache You shouldnt go to school. You should rest. Pronunciation Listen and read. What do you notice about the 5 6.14 coloured words? I am cid27 t and healthy. I eat a balanced diet. I do regular exercise. I am uncid27 t and unhealthy. I eat an unbalanced diet. My exercise routine is irregular. twentyfive 25", "7 1 Lesson Vocabulary Listen, point and repeat. 2 7.1 1 2 3 4 stage curtain audience cast 5 6 7 8 director costumes backstage lighting 9 10 1 12 props scenery cheer act Look for the words from Activity 2 in the picture on page 32. 3 Which word is missing from page 32? Write the words. 4 1 The people who are watching the show. 2 The place which is at the back of the stage. 3 The people who are acting in the show. 4 The person who tells the actors what to do. 5 The pictures at the back of the stage. Play a game in groups. Each person adds a new word. 5 I went to the theatre, and I went to the theatre, I went to the theatre, I saw the audience, the and I saw the audience and I saw the audience. director and the cast. and the director. thirtythree 3", "8 3 Lesson Oh no! The chocolates! What m Discovery a have you done to them? 7 e T Im sorry! I was showing Bo the box! What a mess! Our Later 8 9 10 beautiful chocolates! What are we going to do? Tahdaahh!!! I know! Ive got an idea! Give me We havent got any more chocolate! the chocolates How did Millie make the new chocolates? 3 CLIL Go to page 58 to find out. Number the sentences in the correct order to retell 4 you read After the story. a Katy and Hamed decorate the chocolates and Millie makes a box for them. b Millie has an idea. c Katy and Hamed take the jug out of the microwave. d The chocolates are a big mess! e They are making chocolates for Millies and Katys granny. 1 f Bo sees melted chocolate for the first time. g Millie knocks the jug on the chocolates. Values Act out the story. 5 I am kind to people. fortyfive 45", "Story How many illnesses can you find? 1 Before you read m Discovery a e T Listen and read. 2 6.3 What happened, Hamed? 1 2 Are you OK, I dont feel very Hamed? well. I feel dizzy. You shouldnt play football I was playing football when youre feeling dizzy. when suddenly Do you feel dizzy now? You should go to the doctors. 4 I dont want to be ill! 3 Not now, but Im going to Amman to I felt dizzy at watch the big football school! match this weekend! Bo, you should stay with Hamed and wait for his mum. Have you got No, I havent. a runny nose? 5 Do you feel sick? No, I dont. Have you got a cough? Yes, I have!!! 20 twenty", "5 12 Lesson Listening Speaking Talk about an animal in Listen and choose the 2 1 5.17 danger. What do you know correct answers. about it? 1 Where do polar bears live? Theyre mammals. They a the Arctic can move very quiccid27ly and b the Antarctic What do you jump out ocid26 the water! c the Atlantic Ocean know about They eat cid31 sh. Dolphins are 2 What do polar bears eat? dolphins? in danger because they get caught in cid31 shing nets. a oysters b seals c fish 3 H ow quickly can polar bears swim? a 15 kilometres an hour b 12 kilometres an hour c 10 kilometres an hour Writing Read. What do basking Find out about an 3 4 sharks eat? animal in danger in Jordan and write about it. Basking sharks 1 Basking sharks are Plan the second largest sh Where do these animals live? in the world! They can What do they eat? be 10 metres long! What do they do? Where do they live? Why are they in danger? Basking sharks live in the sea. They often swim near the land. 2 Write What do they do? They live Basking sharks swim slowly with They eat their mouths open to catch small sea animals. They like Why are they in danger? They are endangered Basking sharks are in danger because because people hunted them. Now you mustnt hunt them. 3 Check your work tip Writing Used headings? When your text has got a lot of information, headings Activity Book, page 13. make it easier to read. Look at the Plan and use the questions as headings. seventeen 17", "Lesson Grammar 5 Look back! Tick the sentence in this 1 picture. 1 I havent read the book. 2 Ive seen a blue and white dress somewhere 3 Bo, have you seen Alices costume? Listen and repeat. 7.3 2 Irregular verbs Ive readAlices Adventures in Wonderland. been, go beengone, see seen, be I havent seen the film. made, buy bought, read read make written, wear worn, sing sung write Hes seen Alices costume somewhere, Regular verbs but he hasnt found it. acted, visit visited act Lets go to the theatre. We havent been played, listen listened play for ages! More verbs in Activity Book page 48. Listen and point to the correct picture. 3 7.4 a b c d Describe a picture. Your partner guesses. 4 written bought seen HesHe hasnt ShesShe hasnt read made been Hes been to the theatre. He hasnt acted in a play. Is it Picture ? In groups, make true and false sentences about what 5 youve done. Can you guess which are true? been to the theatre acted in a play acted in a film worn a costume made a costume read a play read a really long book made a present for a friend seen a documentary False! Ive acted in a cid31 lm! 36 thirtysix", "5 3 Lesson m Discovery a e T 7 8 9 Look, here it comes again! Bo! Watch out, Bo! Its a basking shark. That shark wasnt trying to eat Bo! Basking I see youve got an egg case! A baby 10 1 sharks only eat very small sea shark or ray was growing in that! animals. That shark was swimming Eew!!!! with its mouth open to catch them! A baby shark??? Its OK, its empty! Why dont you nd out which kind of shark or ray it was? Which animal was growing in the egg case? 3 CLIL Go to page 58 to find out. Look at the story and write the names. Who... 4 you read After 1 uses a camera? 4 i s talking about whales? 2 finds an egg case? 5 is snorkelling? 3 falls into the water? 6 is flying? Values Act out the story. 5 I am careful not to harm animals. Find out about a sea animal. Does it lay eggs or does it have 6 live babies? Share with the class. eleven 11", "8 Lets get creative! Household appliances coffee machine, cooker, dishwasher, freezer, fridge, kettle, microwave, oven, sewing machine, toaster, vacuum cleaner, washing machine Materials cotton, gold, leather, metal, paper, plastic, rubber, silver Pronunciation begin, contain, decide, enjoy, recommend, understand, entertain, seeing, watching How many words for machines in the house do you know? 1 What doesnt belong in the picture? What is Bo doing? What has someone made for lunch? What is Millie reading? 42 fortytwo", "WW 1 Lesson Vocabulary Read the sentences and write the missing words. 2 1 Millie went to see her and Grandpa. 2 Hamed learnt how to bake a and to toys. 3 Katy did amazing in Science Club. 4 Bo learnt how to. 5 Bo wants someone to him another ball. Act out the story. 3 Listen and write Fatima or Amal. 4 W2 3 1 2 4 Describe a hobby. Your partner guesses. 5 You make this in the oven. Its got tomatoes and cheese on top. Its delicious! Make a pizza? Yes! Write about your favourite hobby. Share with the class. 6 five 5", "Lesson Skills 11 Reading Who is the main character? How do you know? 1 Before you read 2 Listen and read. 7.16 Yousuf in the mountains Scene 1 On the road Scene 2 In a house A boy, Yousuf, is walking through the mountains Yousuf is standing in front of along a road. Hes carrying a small bag on a stick. a door to a house. He knocks An old lady is sitting under a tree. and the door opens. A wolf is standing there. Yousuf Hello! Im going to visit my uncle. Yousuf You arent Uncle Imad! Old lady Hello, young man! Ive lost my stick. Wolf No, Im not. Yousuf takes his bag off the stick and gives the stick to her. Yousuf Help! Yousuf You can have this! Yousuf runs away. Old lady Thank you! You have helped me and, Scene 3 On the road when you need help, I will help you. Yousuf has stopped, out of breath. He is near Yousuf Thank you! Goodbye! the young girl, who is sitting in a tree. Yousuf walks on. Soon he comes to a young girl. Girl Whats the matter? She is looking everywhere on the ground and YousufAA wolf is chasing me! seems very worried. GirlHHeerree,, take my scooter. Yousuf Hello! Are you OK? She gives him a scooter. Girl Ive dropped my necklace! Yousuf Thank you! What Yousuf and the girl search together. about you? Suddenly, Yousuf finds the necklace. GirlDont worry, that Yousuf Here it is! wolf isnt very good at Girl Thank you! You have helped climbing trees! Now go! me and, when you need help, I will Yousuf rides off on the scooter. help you. Soon he comes to the old lady. Yousuf Thank you! Goodbye! Old lady Which parts of the text tell us what the characters 3 After you read are doing? Complete the sentences in your notebook. Use 1, 2 or 3 words. 4 4 A opens the door. 1 Yousuf is going to visit. his u n c l e 5 The wolf chases. 2 The old lady has lost. 6 The girl gives Yousuf. 3 The girl has. 40 forty", "The Ministry of Education has decided to adopt this book for Jordanian schools in accordance with the approval of the Supreme Council of the National Curriculum Center in its meeting No. 92024 on and the approval of the Board of Education decision No. 1512024 in its meeting No. 62024 on for the 20242025 academic year. Pearson Education Limited and York Press Ltd. 2024 ISBN 9789923417416 The Hashemite Kingdom of Jordan Deposit number by the National Library Department 20 Primary indexing data for the book Book title Jordan Team Together, Grade 5 Pupils Book, Semester 2 Prepared by Jordan National Center for Curriculum Development Publication data Amman National Center for Curriculum Development, 2024 Classifi cation number 372.6521 Descriptors English LanguageCoursesBasic Education Edition data First edition The author bears full legal responsibility for the content of their work, and this work does not express the opinion of the National Library Department. The right of Michelle Mahony to be identifi ed as author of this Work has been asserted by her in accordance with the Royal Legislative Decree, 12 April 11996, which approves the consolidated text of the Law of Intellectual Property Rights. The publishers would like to thank Kay Bentley, Gareth Vaughan and Tessa Lochowski for their contribution. All rights reserved no part of this publication may be reproduced, stored in a retrieval system, or transmitted in any form or by any means, electronic, mechanical, photocopying, recording, or otherwise without the prior written permission of the Publishers. First edition trial 2024 1445 i", "8 12 Lesson Listening Speaking Listen and match. Which machines 1 8.17 2 have you used this 1 2 3 4 week? What for? This weecid29, Ive used the microwave to melt ice cream! Mrs Mr Zeinab Faisal Alqassab Alqassab A B C D Writing Read. Which machine does Write a personal account 3 4 Nada think is the most useful about machines in your for her dad? home. 1 Plan What machines have you got at home? Which are the most useful? The most useful things Why? at home What are your family members By Nada favourite machines? At home weve got a lot of different Whats your favourite? machines, but some of them are more useful than others! In the kitchen, the cooker and the fridge are the most 2 Write useful because we can cook food with At home, weve got the cooker, and we can keep food in The most useful things are the fridge. We also have a coffee My favourite thing is , machine. I think this is the most useful because thing for my dad! He loves coffee! My favourite thing is my tablet. I use it 3 Check your work to do my homework and play games. Used exclamation marks to tip Writing show when youre making a joke? Exclamation marks ! are used to show a strong Activity Book, page 39. feeling. Here, Nada uses exclamation marks to show when she is making a joke. fiftyone 51", "Lesson Grammar 5 Look back! Tick the sentence 1 in this picture. 1 I dont feel very well. I feel dizzy. 2 You should go to the doctors. 3 I should take your temperature. Listen and repeat. 2 6.4 You should go to the doctors! You shouldnt go to school! Should I take some medicine? Yes, you should. No, you shouldnt. Listen and point. Then match with the advice. 3 6.5 put cream on it sit down not scratch it not go swimming blow your nose go home c b a d Choose someone from the picture. In pairs, ask and answer. 4 Ive got a rash. You should You shouldnt 2 twentytwo", "Grammar reference m Di a e scover T y Unit 5 What was the shark doing? What were you doing when the lion escaped? The shark was looking for small sea animals. I was watching the koalas when the It wasnt looking for big fish. lion escaped! I wasnt watching the lion! Unit 6 You should go to the doctors! Im running to be fit and healthy. You shouldnt go to school! He went to the supermarket to buy fruit. Should I take some medicine? Yes, you should. No, you shouldnt. Unit 7 Ive read Alices Adventures in Wonderland. Have you ever been to a festival? I havent seen the film. Yes, I have. No, I havent. Hes seen Alices costume somewhere, Has she ever sung in a musical? but he hasnt found it. Yes, she has. No, she hasnt. Lets go to the theatre. We havent been for ages! Unit 8 Have you ever made chocolates? What is it made of? Its made of plastic. Yes, I have. No, I havent. What are they made of? Theyre made of gold! Shes never used the oven before. fiftynine 59", "HAVE YOU EVER BEEN Lesson 9 TO THE THEATRE? E R CULTU There are lots of famous modern theatres around There are also the world where you can see a play or a musical. many ancient theatres around One of them is the Majestic Theatre in New York. the world. The Its in an area of the city centre called Broadway. Roman Theatre in There are more than 40 theatres on Broadway, and Amman, Jordan, many visitors to New York see a Broadway show. The is one example. It was built over 2,0 years Majestic is one of the largest theatres on Broadway ago and is on a hill opposite the Amman Citadel. It and many famous was rebuilt in 1957, and many people have visited musicals have played it since then. In fact, its one of the most visited here. Have you ever attractions in Amman. seen a musical? One famous musical opened Amman is also home to the more modern Haya at the Majestic Theatre Cultural Centre. Here, children of all ages can learn in 1988 and is now the about the theatre and acting by taking acting classes longestrunning show and workshops. The centre makes learning about on Broadway. theatre fun and gives children the chance to explore acting from a young age. un F y t i v i t a c Find all the numbers in the text. Write them as words! Project Do you know 1 Make a poster for a new show. Before you read any famous plays 1 In groups, invent a show. or musicals? 2 Think about information for your show Whats the name of the show? 2 Listen and read. 7.10 What kind of show is it? A musical? A play? Whats it about? 3 After you read How much are Activity Book, page 28. the tickets? 3 Make a poster for 4 What do you know your show and about other famous present it to ancient and modern the class. theatres around the world? Have you ever seen Roary the Lion? Its a musical about... 38 thirtyeight", "Lesson ss 1 ooBB Language booster 4 b u Le l C arning How many countries can you say? 1 Listen, point and repeat. 2 LC4.1 1 2 3 4 Jordan Argentina Brazil Mexico 5 6 7 8 Italy Portugal Japan Egypt 9 10 1 12 Morocco China Canada India Read and complete. 3 1 Hi, Im Paco. Im from M . 4 Im Carlos. Im from P . 2 This is Yuki. Hes from J . 5 This is Nadia. Shes from E . 3 Chen is from C . 6 Tom and Joe are from C . Describe a flag. Your partner guesses. 4 Its got a white baccid31ground. Theres a big red circle in the middle ocid30 the cid29 ag. Is it Japan? Yes! 52 fiftytwo", "2 Lesson Listen and repeat. 5 LC4.2 Ive been to Italy. I wentthere last month. My dads been to China. He wentthere a year ago. Listen and match. 6 LC4.3 Name Where did she go? When did heshe go? two weeks ago 1 Imad Mexico Dalias dad Egypt last month 2 Muneer Japan three years ago 3 Lubnas parents Italy in 2021 4 Read and circle the corect answer... 7 1 Farid s been ve been to Morocco. He went there in 2020. 2 Asma and Noura have been to Italy. They went ve been there last month. 3 Im Hisham. I s been ve been to Portugal. I went there six weeks ago. 4 Mariam s been ve been to India. She went there three months ago. 5 Were Ali and Omar. We s been ve been to Canada. We went there in 2022. 6 Saras been to Jordan. She went s been there last year. Use the table in Activity 6 to have a dialogue with a 8 partner. Ive been to Mexico. Where have you been? I went there two weecid31s ago. When did you go there? Show what you know don ell W Can you name countries? Can you say which countries youve been to? Can you say when you went there? fiftythree 53", "Lesson Grammar 5 Look back! Tick the sentence in this picture. 1 1 A baby shark or ray was growing in that! 2 That shark wasnt trying to eat Bo! 3 It was swimming more slowly than a whale. Listen and repeat. 2 5.3 What was the shark doing? The shark was looking for small sea animals. It wasnt looking for big fish. Listen and point to the correct picture. What were the 3 5.4 sea animals doing? There are two pictures you dont need. a b c d e f Hani visited the aquarium on Saturday. What were the 4 animals doing when he arrived at 1 oclock? In pairs, look, ask and answer. jump out of the water catch a small fish climb out of the tank eat fish look out of the water walk along the bottom of the tank What were the seals doing at cid28cid28 ocloccid27? They were eating cid31 sh! 12 twelve", "Story m How many sea animals can you 1 DDiscc a Before you read e TT ryy find in the story? Listen and read. 2 5.2 The whales were OK, kids. We heard there were Can I come? swimming over there. some humpback whales here Why dont you y over today. They were swimming 1 the water with your this way. But if you see a camera? whale, remember, dont get too close! Whales are endangered animals! 2 OK! I love ying! Whats this? It was 3 4 oating down there. Is it a sh? I dont think so. Lets ask my mum. Was it a whale? What was it doing? How quickly was Back on the boat... 5 6 it swimming? Look! Its a shark! Or is it a whale? It was swimming more slowly than a whale, and it didnt come up for air. 10 ten", "Story m Which machine do the children use 1 Before you read Discovery a e T in the story? Listen and read. 2 8.3 Right, lets get started! 1 2 Hamed, you and I are We can use Have you ever made going to make chocolates the microwave. chocolates before? for Grannys birthday. No, I havent. I made a chocolate cake last year for Granny, but Ive Ive made a box for the chocolates. never made chocolates. Now I need to decorate it. OK, so weve melted the chocolate. Next, Its hot, and Thats right, Bo! The chocolate 3 we have to pour it into these paper cases. it isnt solid has melted in the microwave! Then we have to decorate our chocolates! anymore! If you heat chocolate, it melts. 4 No, I havent! These Youre using silver and Ten minutes later decorations arent made 6 gold! I thought you of metal. Theyre made What have you couldnt eat metal! Have of sugar! made, Millie? you ever eaten silver? 5 Ive used this paper to decorate the chocolate box. Look! 44 fortyfour", "Lesson Grammar 5 Look back! Tick the sentence in this picture. 1 1 Have you ever made chocolates before? 2 Have you ever eaten silver? 3 Ive never made chocolates. Listen and repeat. 2 8.4 Have you evermade chocolates? Yes, I have. No, I havent. Shesneverused the oven before. Match the sentences to the pictures. In pairs, ask and answer. 3 a Has she ever bought a kettle? 1 2 b Has he ever baked bread in an oven? c Has he ever used a sewing machine? d Has she ever made toast in a toaster? 3 4 Has she ever bought a cid29ettle? No, she hasnt. Shes never bought a cid29ettle. Ask five partners. Has anyone done all these things? 4 1 Have you ever made toast in a toaster? Have you ever made 2 Have you ever washed clothes in a toast in a toaster? washing machine? 3 Have you ever made coffee in a coffee machine? 4 Have you ever used a vacuum cleaner? No, I havent. Ive never 5 Have you ever made food in a microwave? made toast in a toaster. Adnan has never used a toaster or made cid30ood in a microwave. He has used a washing machine and... Pupil A Activity Book, page 45. Pupil B Activity Book, page 47. 5 46 fortysix", "Story Can you find any props? m 1 Before you read Discovery a e T Listen and read. 2 7.2 1 This is fun! Whats the play called? Its called Alices Adventures in Wonderland. Its a famous book by Lewis Carroll. Ive I havent read the read the book. Its great! book. Whats it about? Its about a girl called Alice who follows a white rabbit into an amazing land Bo, have you seen Alices costume? A blue and white dress 2 3 4 Its a blue and white dress. Hmm let me think Yes, I have! Ive seen a blue and Millie! Katy! white dress somewhere but Hamed! Help! where? Ill go and look around We need something big to 5 6 We cant hold it! Its too heavy! push against the scenery! Look! What about those steps over there? 34 thirtyfour", "6 1 Lesson Vocabulary Listen, point and repeat. 2 6.1 Ive got 1 2 3 4 a headache a sore throat a stomach ache a cold 5 6 7 8 a high temperature a toothache a runny nose an earache I feel 9 10 1 12 a cough a rash dizzy sick Look for the words from Activity 2 in the picture on page 18. 3 Which word is missing from page 18? Listen, read and say. In pairs, play a 4 5 6.2 guessing game. Ive got a Ive got a d sore throat! a cough! Oh, my head! Ive got a b Ive got e runny nose! a cold! Have you got a headache? c I cid31eel dizzy! Yes, I have! nineteen 19", "Welcome back Welcome Hobbies bake a cake, do experiments, fix toys, juggle, make a pizza, throw a ball Technology call, computer, email, keyboard, letter, mobile phone, smartwatch, study, tablet, telephone Listen and read. 1 W1 the return of the discovery team! Great! We went to see Granny I love this computer. Before I wrote 1 and Grandpa. It was amazing. letters, but now I just send emails. How were your holidays? Why? And this smartwatch I bought is fantastic. I can make telephone Theyve got all this calls and play games. new technology! 2 What about you, Hamed? 4 What did I didnt do much. I learnt 3 you do, Katy? how to bake a cake. And I xed some toys! Maybe you can x my tablet! I went to a holiday club. Im not sure Science Club was great. Hey, I can do that! We did amazing experiments. Hello everyone! wheres Bo? Look at me! Throw me I can juggle ve balls another at the same time! ball! It looks like we all learnt We can see what Bo learnt something this summer! 5 6 to do in the holidays! How many balls is Bo juggling? How many different types of technology can you see? 4 four", "7 Curtain up! Theatre act, audience, backstage, cast, cheer, costumes, curtain, director, lighting, props, scenery, stage Entertainmentclassical music, comic, concert, country music, festival, musical, poem, puppet show Pronunciation cheerful, thankful, playful, fearful, peaceful, forgetful, careful, hopeful How many theatre words 1 do you know? What doesnt belong in the picture? Who is holding a book? Who is feeling dizzy? Whos got a rash? Can you find a mobile phone? 32 thirtytwo", "2 Lesson Listen and circle. 5 LC3.3 1 Talal visited his grandparents friends. 2 They live dont live in the town. 3 A place where you see fields and animals is called the ocean countryside. 4 Talal saw some baby sheep cows. 5 A baby cow is called a kitten calf. Read and number the definitions. 6 1 2 5 3 4 a A place where you see lots of buses is called a bus station. b A place where you see lots of animals is called a zoo. c A place where you see a show is called a theatre. d A place where you see lots of sand is called a desert. e A place where you see plants growing on a farm is called a field. In pairs, make true and false sentences. Correct the 7 1 A small river is called a the countryside. false sentences. 2 A green place with a lot of plants is called b a desert. A small river is called an ocean. 3 The land outside a town is called c a cave. 4 A piece of land on a farm is called d a jungle. No. A small river is called a stream. 5 A hot, dry place with a lot of sand is called e a stream. A place where you see lots ocid31 trains is called a train station. 6 A dark place underground is called f a field. Yes, thats right. Show what you know don ell W Can you name places in the town and countryside? Can you say what different places are called? Can you make definitions about places? twentynine 29", "5 10 Lesson English in action Reminding someone to do something Have you got an animal? How do you look after it? Circle. 1 feed it clean the cage change water wash it Listen. Why is the vet talking to Nadia? 2 5.11 Listen, read and check. 3 5.12 Nadia, youre going to adopt an animal cid26rom our centre, right? Yes, thats right. What cid27ind ocid26 animal do you want to adopt? I want to adopt a cat. OK. You must loocid27 acid26ter it. Remember to change the cats cid26ood and water every day. Ill remember! And dont cid26orget to clean the bowls every day. I wont cid26cid26oorrggeett!! I promise to llocid27cid27 aacid26cid26tteerr my cat! Choose an animal. 4 Have a conversation with a Remember to change the cats food and water every day. partner about how to look Dont forget to clean the bowls every day. after it. I promise to look after my cat! a cat a rabbit a fish a parrot a tortoise Pronunciation Listen and say the tongue twister. What do you 5 5.13 notice about the coloured words? The whale appears in the morning, And swims around in the sea. It disappears in the evening, And swims away from me! fifteen 15", "4 Lesson practise! Read and match. 1 Lets a hot and rainy all year 1 polar b four seasons 2 arid c hot and dry all year with very little rain 3 tropical d very, very cold, snowy winters 4 temperate Look at the map on page 54. Complete the fact file with the words 2 from Activity 1. Continent Countries Different climates North America 23 polar, 1 and tropical South America 12 2 to tropical Australia 14 arid desert,3 and temperate Antarctica none 4 What do you know about the four continents in the fact file? 3 Read and answer. 1 How many countries are there in South America? 2 What are the three climates of Australia? 3 How many countries are there in Antarctica? 4 Which continent has got 23 countries? 5 What is the climate of Antarctica? Show what you know Makea poster about a continent. 1 Choose one of the seven continents. 2 Find ten interesting facts about the countries, climate and landscape. 3 Draw or choose images from the Internet to stick on your poster. 4 Compare your poster with another group. fiftyfive 5", "7 3 Lesson Katy, Hamed, stay there. I can help. Theyre too heavy! I m Discovery a e T cant move them! 7 8 9 Phew! Thanks, Well done, kids! Dont There are three pieces of scenery. 10 1 Mrs Alhaddad! worry, Ill repair the Which one should we take? scenery now. Millie and Hamed, you can help me. Katy, can you and Bo bring the other piece of scenery from backstage, please? Yes, Mrs Alhaddad! Which piece of scenery belongs with the play? 3 CLIL Go to page 58 to find out. Circle the correct answer. 4 After you read 1 The play is called 3 Bo was flying when he a Alice Loves Wonderland. a broke something. b painted something. b Alices Adventures in Wonderland. c made a hole in something. c Alices Stories in Wonderland. 4 Mrs Alhaddad stops the scenery from falling over. She 2 Hamed and Bo are looking for uses a Alices black and white dress. a a box. b Alices green and white dress. b some steps. c Alices blue and white dress. c some costumes. Values Act out the story. 5 I work well together with my friends. thirtyfive 35", "Hello, Im Carlos. I am a volunteer in a charity centre for Youth Service Day old people. Listen and read. F3.1 1 On Service Day in April, we celebrate Youth people who help their own ccoomuunniittyy, young and other communities around the world. We also nd out more about ways that we can help other people! Last year on Youth Service Day, I found out about the in my community. I decided to charity centre there. Now I visit twice a week. I talk to the volunteer people there, and I read to them. I help them write cards and letters to their family. Ive become good friends with many of the people in the charity old centre. I love volunteering there! This year on Youth Service Day, Im going to tell students at my school about volunteering, and how much I enjoy it. What can you do to help in your community? Make a spider CircleTrue or False. Say why. 4 2 diagram of ways to help 1 Youth Service Day celebrates in your community. old volunteers. True False 2 Carlos volunteers at a 1 In groups, think of ways charity centre. True False to help in your community. 2 Draw and write them on a 3 He doesnt like spider diagram. volunteering there. True False 3 Present your 4 He isnt going to celebrate spider diagram Youth Service Day to the class. this year. True False How can you help in pick up 3 Helping our litter community! your community? I can... volunteer 56 fiftysix", "HHeeaalltthhyy FFodd DDaayy !! Lesson 9 Do you want to be a chef for a day? Well, now you can on E R CULTU Healthy Food Day! Many primary schools in Jordan have Healthy Food Day for children of all ages. And it can happen anytime during the school year, so its always a fun surprise! First, teachers send electronic invitations to parents. Then, parents think of healthy foods and teachers decide what food students should bring. These usually include local fruits, vegetables or other healthy snacks, which are all easy to get in Jordan. On Healthy Food Day, students get to be chefs. They can even wear chef hats while preparing and then enjoying their healthy lunches. But its not just about eating. Teachers also give lessons during the day on diff erent types of healthy food, explaining how these foods help us to grow strong and stay healthy. Some teachers even bring extra fruits and vegetables to share with their classes. The day also focuses on teamwork, with students working together, sharing meals and helping each other to prepare their lunches. una F y t i v i t c Create an invitation for Healthy Food Day! Project What do you 1 Before you read usually have for school lunch? Make a healthy lunch for Healthy Lunch Day. Listen and read. 2 6.11 1 In groups, agree on five food 3 After you read items for your healthy lunch Activity Book, page 18. from your local area. Draw pictures. In pairs, ask and 4 2 Write about your healthy lunch. answer. What food did you choose and why? 1 Whats your favourite school Where does the food come from? lunch? Why should we eat healthy food? 2 Do you have Healthy Food Day 3 Present your healthy lunch to in your school? What do the class. you eat? 4 Have a class vote! Which is 3 Why is it important to learn the healthiest? about healthy food at school? twentyfour 24", "W 3 Lesson Vocabulary Listen, point and repeat. 1 W5 3 1 2 4 5 call computer email keyboard letter 8 6 7 9 10 mobile phone study smartwatch tablet telephone . Listen and tick 2 W6 2 What did Fadis dad buy at the 1 What did Sami use to do weekend? his homework? a b a b 3 What did Abeer send to her grandpa? a b Make questions and ask your partner. 3 study for a test use a smartwatch play games on a tablet write an email send a letter call a friend make a call with a mobile phone do homework on a computer Did you study for a Yes, I did. What about you? I did, too! test at the weekend? seven 7", "5 Animals in danger Sea animals dolphin, jellyfish, lobster, octopus, oyster, ray, seahorse, seal, shark, squid, turtle, whale Land animals camel, gorilla, koala, lion, panda, parrot, polar bear, rhino Pronunciation appeardisappear, likedislike, agreedisagree, connectdisconnect How many sea animal words do you know? 1 What doesnt belong in the picture? Who is ready to go snorkelling? Find thirteen stars on the boat. What number can you find? 8 eight", "Lesson ss 1 ooBB Language booster 3 b u Le l C arning How many places can you name in the town or country? 1 . Listen and tick 2 LC3.1 1 2 a b a b 3 4 a b a b Read and match. 3 1 A small river is called a the countryside. 2 A green place with a lot of plants is called b a desert. 3 The land outside a town is called c a cave. 4 A piece of land on a farm is called d a jungle. 5 A hot, dry place with a lot of sand is called e a stream. 6 A dark place underground is called f a field. Look at the pictures in Activity 2. Complete the definitions 4 in pairs. A large sea is called LC3.2 an ocean. A small river is called a The land next to stream. The land next to the sea is the sea is called called the coast. the coast. 28 twentyeight", "Leson n2 4 practise! What materials do artists use in their 1 Lets landscape paintings??? pencils brushes oil paints watercolour paints Materials Colours Why do artists use the materials? artists use pencils light and dark Most artists use a pencil to draw what they see first. This is because coloured pencils they can use a rubber if they dont like it. Then artists try to draw the outdoor scene better the next time. oil paints and bright and dark Artists have used oil paints for hundreds of years. They like oil paints brushes primary and because the colours work well together. Artists can also use thick or secondary colours thin oil paints for their scenes. watercolour primary and Some artists like using watercolour paints because they dry quickly. paints and secondary colours Artists can then paint on top of watercolour paints. They can also use brushes wet or dry paper for their landscapes. Write three questions about materials 2 artists use in your notebook. 1 What type of materials do ? In pairs, ask and answer 3 2 What colours are the ? your three questions. Which 3 Why do artists use ? questions were different? Show what you know Make a drawing of an outdoor scene. 1 Think! What are you going to draw a landscape, a seascape or a cityscape? 2 Whats in the foreground and the background? 3 Whats the weather like in your drawing? 4 What colours are you going to use? 5 When youve finished, take turns to describe your outdoor scene to another group. thirtyone 31", "Handmade in Jordan Lesson 9 Do you know what a craft is? Its something that you make by hand. Have you ever seen any traditional Jordanian crafts? There are many different kinds! E R CULTU Pottery Rugs and Traditionally, people made pottery Carpets with stones from Petra, and they These are rugs and carpets. People decorated them with images of made these in Amman, but the natural landscape. Today, craftspeople make them all over visitors can buy beautiful pottery Jordan. They make them using a at the Petra Pottery Association. very old technique called weaving. This is close to Wadi Musa. The Weaving is still a very popular women that work here still use handicraft today in Jordan, and the same techniques that they many older people teach it to used hundreds of years ago! younger people. Traditionally, they una F y t i use weaving to make anything from v i t c carpets to tents. The main materials are sheeps wool, goats hair and Find out how long camel hair! They then use berries to people have made give the rugs their natural colour. pottery in Jordan for! Project Look at the 1 Before you read headings and pictures. Make a class book about Whats similar about the traditional crafts. pictures? Whats different? 1 In groups, choose a traditional Listen and read. 2 8.10 craft. 2 Find or draw pictures of the craft. 3 After you read 3 Write about the craft. Activity Book, page 36. Whats the name of the craft? What do you make? What other traditional 4 How do you make it? Jordanian crafts do you know? 4 Put the pages together to make a class book In Jordan, there is a long on traditional crafts. tradition ocid30 macid29ing painted 5 Choose your glass. Its cid30rom... favourite craft. These rugs are made of sheeps wool... 48 fortyeight", "Lesson Skills 11 Reading Look at the headings in the text. What do 1 Before you read you think the top five tips are about? Listen and read. 2 6.17 HEALTHY! STAY TO HOW ON TIPS 5 TOP 2 Get out Eat well, 3 Sleep tight! 1 and about! feel well! Make sure you get If you want to be Get moving to stay plenty of sleep each healthy, eat a balanced t! You should do night! You should diet! You should eat at exercise for 30 minutes sleep for 910 hours least ve portions of a day. Run around in each night. Make your fruit and vegetables the playground, play bedroom a calm, quiet every day to stay a sport or simply walk place and dont keep a healthy. You shouldnt quickly to school! phone or tablet by eat a lot of junk food. your bed. 5 Have fun! 4 Drink water! What do you do to relax? We all need water, and Do you do exercise, read drinking water in the day a book or watch a lm? helps your body to work Or do you meet friends in properly. Water also helps the park? Whatever you you get better when you choose, relaxing and having are ill. So, if youve got a fun are important ways to headache or a cough, you stay t and healthy! should drink some water! Were your ideas about the tips correct? 3 After you read Correct the sentences. 4 1 A balanced diet should have at least seven portions of fruit and vegetables a day. 2 Walking or doing other exercise for ten minutes a day keeps you fit and healthy. 3 You should always keep a phone in your bedroom. 4 If youre feeling well, you shouldnt drink water. 5 Relaxing doesnt help you stay fit and healthy. 26 twentysix", "6 7 Lesson Vocabulary and Grammar Listen, point and repeat. 1 6.7 1 2 3 4 healthy unhealthy fit unfit 5 6 7 8 do exercise relax eat a balanced diet eat junk food Listen and sing. 2 6.8 6.9 I wasnt very healthy, But I wanted to be t. II wwaanntteedd ttoo ddoo ssoommee eexxeerrcciissee,, To walk instead of sit! II started walking round the park,,, I wanted to do some exercise, I ran for a little bit. I ran to get healthy and t! Soon I could run for longer, I ran my rst race in the park! I was getting t! Now I feel super t! Listen and repeat. 3 6.10 Im running to be fit and healthy. He went to the supermarket to buy fruit. Combine the sentences. 4 1 I need to be fit and healthy. Im going for a walk twice a day. Im going for a walk twice a day to be fit and healthy. 2 I need to buy some trainers. Im going to the sports shop. 3 I need to eat a balanced diet. Im going to eat less junk food. 4 I need to buy some vegetables. Im going to the greengrocers. 5 Pupil A Activity Book, page 4. Pupil B Activity Book, page 46. twentythree 23", "Goal 68 My Things Rhythms and Listening Goal 69 My Things Words in Action I can ask to borrow some things in class. I can follow the teacher and play the Copycat Game. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Listen, point, and practice. Whats this? A 2. 2 Write. Whats this? Its a wallet. A B 1. Its a cell phone. B 1. Can I use your ? Whats this? Whats this? Its a comic book. A B A 3. 4. 2. Can I use your ? Its a watch. B 2 Read and answer. Say and write. 3. Can I use your ? 1. Whats this? Its a. 4. Can I use your ? 2. Whats this? Its a. 5. Can I use your ? 3. Whats this? Its a. Hint Words 4. Whats this? Its a. eraser glue scissors pencil pen 190 191", "on p64 ostrich p45 paper p70 rhino p45 rose p46 sandals p17 pencils p70 pens p70 photo p20 scared p8 school p57 scissors p70 playing computer pine p10 plate p18 shake p28 shirt p17 short p32 games p24 playing football police car p56 quiet p32 show p28 skirt p16 sleepy p8 p24 106 107", "Phonics Sounds and Letters 1 Listen, point, and say. Then read and number 1 or 2. 1 e 2 head read feather peach meat bread 1 2 Listen, point, and say. Then match with u or ue. U says u, u, tub and U says u, u, tube. cup bus u cube duck ue uniform huge 3 Listen, say, and match. food foot book moon boot cook 50", "Goal 7 Goal 76 My Day, Animals, Places Words in Action My Day, Animals, Places Rhythms and Listening I can ask and talk about jobs what someone does. I can talk about the weather. I listened to days this week. I listened to days this week. Name Class Name Class 1 1 Listen and practice. Write. Listen, point, and chant. Write the missing words. astronaut computer technician businessman cloudy rainy sunny snowy windy cook doctor firefighter pilot teacher farmer sunny Its and hot, Sit in the shade and talk Its and gray businessman Theres no sun today! Its and wet Were not there yet! Its and cold Dont catch a cold! Its cloudy and cool, Get out of the pool! 2 Write. 2 Read and answer. Write. A Two animals that live in very cold places Does your father work in an office? Does he work at the airport? B Two animals that live in very hot places What does he do? 199 198", "Goal 20 Things We Do Rhythms and Listening Goal 21 Things We Do Words in Action I can play the True or False Action Game with a friend. I can play the Card Snap Game with friends. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Trace. Listen, point, and practice. Im playing 1 2 3 A football. False! B Im playing 4 5 6 A computer games. True! B 2 2 Listen and play. Touch the cards as quickly as you can. Listen and circle T True or F False. Im playing football. Im playing computer games. 1 2 3 Im doing my Im playing Im watching TV. homework. football. 1. T F 2. T F 4 5 6 Im doing karate. Im doing karate. Im eating Im playing Im doing snacks. computer games. karate. 3. T F 4. T F 142 143", "Rhythms and Listening Fun Time! 1 Chant and do the actions. 3 When You See a Red Light Traffic Signal Game Listen to the leader and say what to do. When you see a red light, red light, red light. When you see a red light, stop, stop, stop. When you see a red light, red light, When you see a yellow light, red light yellow light, yellow light. When you see a yellow light, wait, wait, wait. Stop, stop, stop! When you see a green light, green light, green light. When you see a green light, go, go, go. Sounds and Letters Listen, say, and number. Then write the missing 2 letters. I Can ship chip slip chant the When You See a Red Light chant. GOAL 51 say if a traffic signal says Stop!, Wait!, ep eese ep or Go!. GOAL 52 Unit 7 Now go to page 94 54 5", "Words with short and long o Listen, point, and say. 1 o o short long foot moon book zoo Read and circle L for Long or S for Short. Then listen, 2 check, and say. 6. 1. 1. foot L S tooth L S cook L S 7. 12. 2. food L S kangaroo L S balloon L S 8. 13. 3. books L S cartoon L S school L S 14. 9. 4. pool L S boots L S football L S 15. 10. 5. spoon L S shampoo L S room L S 94", "Phonics Fun Time! 1 Listen, point and say. Write ea or e. Places in Town e ea ea 4 Listen, find and write. Practice in pairs. 3. bookstore 2. Theres a restaurant on the corner the bookstore. next to 1. supermarket 4. Theres a train station school 9. sleep read head the supermarket. opposite Theres a gym the between 8. 5. supermarket and the bus station. Theres a post office between bus station 6. the museum and the school. sh p m t br d museum 7. Theres a park the near supermarket. 10. 2 Listen, point, and say. Things in the House Look at this picture. There is a man, a woman and a child. Its a small family. 5 Listen, read, and circle T or F. 1. Theres a table between the sofa and the armchair. T F In this picture, there 2. Theres a rug behind the bed. T F are three men, three 3. Theres a table opposite the fridge women, and five children. and the stove. T F 6 Practice in pairs. Make your own sentences. Whats that? What are those? Its a tooth. Theyre teeth. I Can make the sounds for e and ea, use irregular GOAL 79 plurals and that those. 3 Ask and answer in pairs. Use that or those. talk about places in town and things in the GOAL 80 house using there is, there are. UUnnitit 1 20 82 83", "Introduction Classroom English Listen and point. 1 Good morning. Welcome to class. 1 Good idea! Lets play a game. Make pairs. Watch me. 2 3 Okay. Lets start! 4 5 Okay! Stop! 2", "small p32 snake p28 snow p28 tape p10 taxi p56 thirsty p8 space station speaking p20 spring p31 train p56 truck p56 under p64 p57 stop p54 strong p32 summer p31 wait p54 wallet p72 watch p72 table p64 tail p46 tap p10 watching TV p24 weak p32 winter p31 108 109", "CD 5 Audio Track List CD 3 Audio Track List Track Unit Phonics Practice Track Unit Workbook Section Track Unit Workbook Section 2 1 Exercise 1 Listen and chant 2 1 Exercise 1. Listen, point, and 24 3 Exercise 1. Listen and practice practice 3 1 Exercise 2 Listen and point 25 3 Exercise 1. Listen, point, and 3 1 Exercise 1. Listen, point, and practice 4 3 Exercise 1 Listen and write practice 26 4 Exercise 1. Listen, point and 5 3 Exercise 2 Listen, point, and say 4 1 Exercise 1. Listen, say, and do practice 6 4 Exercise 1 Listen, point, and say 5 1 Exercise 1. Listen and touch 27 4 Exercise 1. Listen, point, and 7 4 Exercise 2 Look at the picture practice 6 1 Exercise 1. Listen, point, and CD 4 Audio Track List practice 28 4 Exercise 1. Listen and chant 7 1 Exercise 1. Listen, point, and 29 4 Exercise 1. Listen and chant Track Unit Phonics Practice practice 30 4 Exercise 1. Listen, point, and 02 6 Exercise 1. Listen, point, and say 8 1 Exercise 1. Listen, point at the practice 03 6 Exercise 2. Look at the picture, pictures 31 4 Exercise 1. Listen, point, and write 9 1 Exercise 1. Listen, number the practice 04 6 Exercise 1. Listen, point, and say pictures 32 4 Exercise 1. Listen and practice 05 6 Exercise 2. Look at the pictures and 10 2 Exercise 1. Listen, point, and match 3 4 Exercise 1. Listen, point, and practice practice 06 7 Exercise 1. Listen, point, and say 1 2 Exercise 1. Listen, point, and 34 5 Exercise 1 Listen and practice 07 7 Exercise 2. Read and circle practice 35 5 Exercise 1 Listen and chant 08 7 Exercise 1. Listen, point, and say 12 2 Exercise 1. Listen and chant 36 5 Exercise 1 Listen and chant 09 7 Exercise 2. Listen to the sound, 13 2 Exercise 1. Listen and color check 37 5 Exercise 1 Listen and practice 14 2 Exercise 1. Listen, point, and 10 7 Exercise 3. Listen and circle 38 5 Exercise 1 Listen and chant practice 1 7 Exercise 1. Listen, point, and say 39 5 Exercise 1 Listen and practice 15 2 Exercise 1. Listen, point, and 12 7 Exercise 2. Listen to the sound, 40 5 Exercise 1 Listen and check practice check 41 5 Exercise 1 Listen and practice 16 2 Exercise 1. Listen and practice 13 8 Exercise 1. Listen, point, and say 17 2 Exercise 1. Listen, point, and 14 8 Exercise 2. Look at the pictures and practice write 18 3 Exercise 1 Listen, point, and 15 8 Exercise 1. Listen, point, and say practice 16 8 Exercise 2. Listen and circle 19 3 Exercise 1. Listen, point, and 17 8 Exercise 3. Listen, circle, and write practice 18 8 Exercise 1. Listen, point, and say 20 3 Exercise 1. Listen and chant 19 8 Exercise 2. Listen and circle 21 3 Exercise 1. Listen, point, and practice 20 8 Exercise 3. Listen, point, and say 2 3 Exercise 1. Listen, point, and 21 9 Exercise 1. Listen, complete, and chant practice 2 9 Exercise 1. Read and circle 23 3 Exercise 1. Listen, point, and practice 12 13", "Words with bl, br, fl, fr, cl, cr, dr Write the words and read. 1 flag green fresh black swan clock frog fruit crayon brown brown crayon 1. a 2. a 3. a 5. The 4. The is on. the is in the basket. Listen, complete, and chant. 2 The driver on the bus The wheels the back! says, Move Move on back! round and round, Move on back! round and round, on the bus The. round and says, Move on back! on the bus The town. all the and round, go all the way to town. 100", "Phonics Listen, read, and say. 1 T and D Jingles T says t, t, tiger. says t, t, tomato. says t, t, telephone. D says d, d, door. says d, d, doll. says d, d, duck. Sounds and Letters 2 Listen, number, and say. Then write tr or dr in the blanks. e uck ess ink 26", "Goal 6 My Things Talk Time I can count from one to thirty. I listened to days this week. Name Class 1 Listen, point, and practice. Lets count them. B Then write the missing 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 12, 13, 14, 15, 16, 17, numbers on the candy. 18, 19, 20, 21, 2, 23, 24, How many are there? A 25, 26, 27, 28, 29, 30. Thats a lot. A 8 2 4 5 3 7 1 6 14 9 12 13 10 1 15 16 17 20 19 18 2 Say and write 30 to 1. 30 29 188", "Words with s ending Listen, point, and say. 1 s z z carrot pizza pizzas orange carrots oranges Q Look at the picture, write the word, and check the 2 sound. Then listen and check your answers. s z z s z z 1. 5. apples s z z s z z 2. 6. s z z s z z 3. 7. s z z s z z 4. 8. 92", "CD 3 Audio Track List Track Unit Phonics Practice 2 1 Exercise 1 Listen and chant 3 1 Exercise 2 Listen and point 4 3 Exercise 1 Listen and write 5 3 Exercise 2 Listen, point, and say 6 4 Exercise 1 Listen, point, and say 7 4 Exercise 2 Look at the picture CD 4 Audio Track List Track Unit Phonics Practice 02 6 Exercise 1. Listen, point, and say 03 6 Exercise 2. Look at the picture, write 04 6 Exercise 1. Listen, point, and say 05 6 Exercise 2. Look at the pictures and match 06 7 Exercise 1. Listen, point, and say 07 7 Exercise 2. Read and circle 08 7 Exercise 1. Listen, point, and say 09 7 Exercise 2. Listen to the sound, check 10 7 Exercise 3. Listen and circle 1 7 Exercise 1. Listen, point, and say 12 7 Exercise 2. Listen to the sound, check 13 8 Exercise 1. Listen, point, and say 14 8 Exercise 2. Look at the pictures and write 15 8 Exercise 1. Listen, point, and say 16 8 Exercise 2. Listen and circle 17 8 Exercise 3. Listen, circle, and write 18 8 Exercise 1. Listen, point, and say 19 8 Exercise 2. Listen and circle 20 8 Exercise 3. Listen, point, and say 21 9 Exercise 1. Listen, complete, and chant 2 9 Exercise 1. Read and circle 12", "Goal 40 Friends, Actions, Things Phonics I can ask and say whose something is using name's. I listened to days this week. Name Class 1 Listen and practice. Trace. Whose hat Maybe it's is that? Noura's. Let's ask her! 2 Ask and answer. Write. blouse cap dress Tshirt skirt sweater Noura Faisal Whose skirt is this? It's Noura's. 1. 2. 3. 4. 5. 6. 162", "Goal 54 From Here to There Words in Action Goal 5 From Here to There Phonics I can tell someone two sentences like Take a bus. or Take a taxi. I can listen, point, and match pictures, words, and letters. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and match the sentences Listen, point, and match. Then copy. a. and the pictures. 1. black 1. Take a bus and go to the school. b. 2. flag 2. Take a taxi and go to the train station. c. 3. Take an airplane and go to the space station. 3. glass 4. Take a rocket and go to the moon. d. 4. class 5. Take a bicycle and go to the hospital. e. 5. plant i. g. f. 6. plate j. h. 2 Trace. 7. clock I go to school by bus. 8. fly 2 I go to school by bicycle. Say and match. I walk to school. cl gl fl pl 176 177", "Goal 72 My Things Phonics I can count from 40 to 100. I listened to days this week. Name Class 1 Listen and connect the numbers. 5 80 71 50 63 68 49 60 85 72 86 7 89 64 79 70 59 90 8 100 2 Listen and circle the correct number. A. 35 36 B. 42 52 C. 63 6 D. 78 98 E. 64 84 F. 92 82 194", "Words in Action 1 Listen, point, and chant. Im wearing Im wearing Boys Girls 1. a cap 6. a hat 2. sunglasses 7. a blouse 3. a Tshirt 8. a sweater 4. a jacket 9. a skirt 5. jeans 10. shoes 2 Practice saying the chants. Boys chant the boys clothes. Girls chant the girls clothes. 16", "Things We Wear Rhythms and Listening Goal 13 Things We Wear Words in Action Goal 12 I can say three colors that Im wearing today. I can say the names of five things that you can wear. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Im wearing... Listen and color. Listen, point, and practice. 2 Join the dots, color, and trace. a sweat er a cap purple red pink white black blue 2. 2 Listen and write the color. 1. Im wearing today. sunglasses a Tshirt 2. Im wearing today. 4. 3. Im wearing today. 4. Im wearing today. jeans a jacket 5. Im wearing today. 6. 6. Im wearing today. 3 Write two things you are wearing today. a skirt a hat 8. Im wearing and oday. shoes a blouse 10. 134 135", "Rhythms and Listening Fun Time! 1 Listen and chant. 3 True or False Action Game What Are You Doing? Run to the T or F when your teacher does the action. What are you doing? Im playing basketball. Im doing karate, doing karate, doing karate. What are you doing? Im doing karate, and how about you? What are you doing? Im playing football, playing football, playing football. I think its true. I think its false. What are you doing? Im playing football, I Can and how about you? GOAL 19 chant the What Are You Doing? chant. play the True or False Action Game with a friend. 2 Chant again and do. GOAL 20 Unit 3 2 23", "Term 2 Phonics Practice Words with short and long o Words with gr, gl and cr, cl Listen, point, and say. Listen, point, and say. 1 1 gr gl cr cl o o short long grass glass crab class foot moon book zoo Read and circle L for Long or S for Short. Then listen, 2 Q Listen to the sound, check, and write. Then draw a 2 check, and say. line to the right picture. gr 1. gr gl en 1. 6. 1. 2. gr gl ass foot L S tooth L S cook L S 3. gr gl ue 4. gr gl ay 7. 12. 2. 5. gr gl asses food L S kangaroo L S balloon L S Listen and circle the word. Then match with a picture. 3 8. 13. 3. 1. crayon crane rayon clay cartoon L S books L S 2. club crab crib clot school L S 3. crowd coward clod cloud 9. 14. 4. 4. crush class lash rush boots L S pool L S football L S 1 15. 10. 5. spoon L S shampoo L S room L S 94 95", "Goal 34 Friends, Actions, Things Talk Time I can chant, tell the time of day and use greetings correctly. I listened to days this week. Name Class 1 Listen and chant. Trace and write. morning Good It's. Good morning! morning to you! How are you? How ? so nice to see you It's. afternoon It's. Good afternoon! Good afternoon to you! Here's homework, more for you! evening It's. Good evening! Good evening to you! It's playtime and bath time and bedtime for you! Goodnight! Goodnight! to you! 2 Match and write. eat lunch go to school watch TV It's morning. 1.. Lets It's afternoon. 2.. Lets It's evening. 3.. Lets 156", "Goal 28 Beautiful Nature Rhythms and Listening Goal 29 Beautiful Nature Words in Action I can name seasons and months. I can act out one pair of opposites. I listened to I listened to days this week. days this week. Name Class Name Class 1 Listen and chant. Write the words. 1 Listen, point, and practice. Trace. Its long. f awlli wr i n tseprr gsp r i nsugm seurm m Seer Smebpteerm b Mera hMarch fall n t e in m p t e r c Its short. Back to school, its., October, November. Its big. s here. Getting cooler, Its small. December, January, February. Its quiet. Flowers are out, its., April, May. Its noisy. s here. Yummy, June, July, August, Its weak. And back again. Its strong. 2 Write the opposites. 2 Find and circle four words. 1. Its long. n i t w n i e r g r p l s s l u a m f 2. Its big. r m e 150 151", "Phonics Fun Time! Listen, read, and say. 1 3 T and D Jingles Listen and touch the right picture. Play with a partner. T says t, t, tiger. says t, t, tomato. says t, t, telephone. D says d, d, door. says d, d, doll. Where is it? Here it is. I found it! says d, d, duck. I Can tell if the words start with t or d. GOAL 23 Sounds and Letters say two words that begin with t or d, and 2 Listen, number, and say. Then write tr or dr in the describe things. GOAL 24 blanks. Advice Time Do whats right. e uck ess ink Unit 3 Now go to page 90 26 27", "Words in Action Fun Time! 1 Listen, point, and chant. 3 Touch the screen. Im wearing Im wearing Boys Girls Listen and touch the right picture! Use two hands. What? Once more, please! I cant remember. 1. a cap 6. a hat 2. sunglasses 7. a blouse 3. a Tshirt 8. a sweater I Can 4. a jacket 9. a skirt say the names of five things that you can 5. jeans 10. shoes wear. GOAL 13 2 Practice saying the chants. name two things I am wearing, saying Im wearing... and... today. Boys chant the boys clothes. Girls chant the girls clothes. GOAL 14 Unit 2 16 17", "Goal 4 Feelings Rhythms and Listening Goal 5 Feelings Words in Action I can play the Confusion Game with a partner and say sixth, seventh, I can act out three feelings. eighth,... I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen, point, and practice. Do the actions. 1 Listen and touch. Trace. Im hungry. 2 Listen and match. Write. Im thirsty. d a f i c j h g b e Im hot. e 1. is the letter of the alphabet. h 2. is the. Im cold. i 3.. first sixth Im sleepy. seventh second third eighth fourth ninth Im scared. fifth tenth 2 Find and circle six feeling words. 3 Join the dots. Write. hotthirsty y f h yscaredcol p r g n e u h e l s d 126 127", "UUnniitt 99 My Things Goal 64 My House Phonics I can read the threeletter word speedreading list by myself. Goal 65 My Things Talk Time I listened to days this week. I can act out the talks about candy with a partner. Name Class I listened to days this week. Name Class 1 Listen and read. 1 Listen, point, and practice. Trace. No.1 No.2 sun nut ox dot Can I have some candy? A fun but fox not run cut box hot Sure. Here you go. B 2 Draw lines and connect the family words. hot cut ox nut dot but Thanks. A 2 Can you unscramble the words and say the sentence? e v andy c a fox box not e h m Can ? I so 186 187", "RhytRhhmytsh amnsd a Lnidst eLnisintegning Fun Time! 1 ChanCt haanndt manadrc . I LoIv Leo tvhee t Mheo uMnotaunintsains 3 Months and Seasons Chant Listen and match. Then chant and do. I lovIIe ltohvee mmthooeuu nnmmttooaauuiinsstt,aa Ii nnloss,v IeI ltohvee rrtoohllellii nrgo lhliinllgs, hills, Back to school, its fall. 1 3 I lovIIe ltohvee fftllhooeww felrosw, eI rrloss,v IeI ltohvee ddthaaeff ffddooaaddffiillffssoo,ddiillss, September, October, November. I lovIIe ltohvee cctaahemm ppccaffaiimmrreepp fwirhee nw ahheell nt haell ssthaaerr sst aress oaurte. out. Getting cooler, winters here. I sit Ia snidt alonodk l,o Io lko,o Ik l oaonkd asmndile s,mile, December, January, February. Im hIamp phya ptop yb teo u bndee urn tdheirs tskhiys. sky. Flowers are out, its , April, May. 2 4 Yummy, summers here. June, July, August, And back again. SounSdosu nadnsd a Lnedt tLeerstters Haha! This is fun! 2 ListenL, issateyn,,a snady,n aunmdb neur.m Tbheern. Trehaedn. read. 1 z1 z 2 s2 s 3 Iz3 Iz I Can mounmtaoinusntains cats cats faces faces chant the I Love the Mountains chant. GOAL 27 2flo w erfslo wers hil l s hills ducksd uck s 2 name seasons and months. GOAL 28 dressedsr ess es sn a kessn akes no s esn oses Unit 4 30 31", "Goal 56 From Here to There Phonics I can say, read, and write the sounds for bl, black cl, clock fl, flag gl, glass pl, plant. I listened to days this week. Name Class 1 Listen and write the words. 1. Its a. 2. Its a. 3. Its a. 2 Write the missing letters. bl gl fl cl pl 1. ack 2. ue 3. ock 4. ag 5. ate 6. y 178", "Grammar Toolbox UUnniitt 1100 My Day, Animals, Places Fun Time! Do you watch TV in the evening? do. dont. Yes, I No, I Talk Time What time do you get up? 4 What time is it? I get up at six oclock. Listen and number. 1 Listen and say. Iyouwethey get up at 6 oclock. Tell me about your day! I get up at 6 oclock. 9 0 1 1 0 1 At 2.00 oclock. What time do seven three nine twelve eleven Then I do my you eat lunch? homework. Check school days in your country. 5 Q Sunday Monday Tuesday Wednesday Thursday Friday Saturday What time do you I get up at 6 Ask and answer in pairs. get up on Saturday? 7 oclock! Yes, I do. Do you watch TV in the evening? From Sunday to Thursday YOU YOUR FRIEND 7 o'clock 1. What time get up? 2. What time go to school? 3. Where eat lunch? What do you do I play with my 5. What time come home? on Saturday? friends. 6. What do in the evening? I Can 2 Practice the talks in pairs. ask my friend questions about his her day 3 Practice and act out the GOAL 73 and get an answer. talks in pairs. tell the time, ask, and talk about everyday activities. GOAL 74 UUnnitit 20 1 76 7", "Term 1 Phonics Practice Phonics Jingle S s T U u Listen and chant. 1 sun tiger umbrella Listen and point to the letters, then the pictures. 2 V v W w X x vase wolf fox A a B b C c apple bear cow Y y Z z yard zebra D d E e F f duck egg fish Unscramble the letters and write the words. 3 G g H h I i rbea b goat hat ink dkcu d otag g J j K k L l iwki k jet kiwi lion ykemno m M m N n O o rtapro p nest octopus monkey itrbab r greti t P p Q q R r lubrleam u parrot quilt rabbit bazre z 85 84", "Fun Time! Good morning! Chant 43 Listen and chant. Its morning. Good morning! Good morning to you! How are you? How are you? Its so nice to see you. Its afternoon. Good afternoon! Good afternoon to you! Heres homework, more homework for you! Its evening. Good evening! Good evening to you! Its playtime and bath time and bedtime for you! Goodnight! Goodnight! Goodnight to you! 4 Write. 1. ! 3. ! Lets go to school! Lets watch TV! 2. ! 4. ! Lets have lunch! Lets go to bed! I Can introduce someone, say This is my friend . GOAL 3 and Let's ! chant, tell the time of day and use greetings GOAL 34 correctly. Unit 5 37", "Words in Action Fun Time! 1 Listen, point, and say. 4 Guess what it is. Do the opposite action. Its big! Its gray. 1. long 2. short Its a mouse! No, its an elephant. A mouse is small. 3. big 4. small 5. quiet 6. noisy What is it? 7. weak 8. strong I Can 2 Shout the opposites in two groups. act out one pair of opposites. GOAL 29 3 Practice the actions in pairs. describe and guess what or who. GOAL 30 Unit 4 32 3", "Goal 2 Feelings Talk Time I can say Im first, second, third... I listened to days this week. Name Class 1 Listen, point, and practice. Trace and write. Hi, ! How ? A Im fine. B 2 Match and write. 1 second fifth first fourth third 1 2 first 1. Im. 3 4 2. Im. 5 3. 4. 5. 124", "2 mreT UUnniitt 44 Beautiful Nature Fun Time! Talk Time 4 Find Something Beautiful! Look! Its a plastic bag! Look around and find a beautiful or an ugly object. 1 Listen and point. Look! Its a snake! Its beautiful! Find something thats beautiful or ugly. Its short! Look! Its a plastic bag! Its ugly. Look at the beautiful flower. No, its ugly! No, its long! 2 Practice and act out the talks in pairs. Sounds and Letters Yes, it is! No, its not! 3 Listen, point, and say. Then write sn or sh. I Can act out one of the talks about nature. GOAL 25 ake ake ow ow find something beautiful or ugly and say Look! Its a ! Its beautiful or ugly. GOAL 26 Show me the snake! Unit 2 28 29", "Rhythms and Listening 1 Chant and mime. Animal Chant I will catch a monkey, by the toes, by the toes. I will catch a monkey, by the ttooeess!... a monkey, by the ttooeess!... an elephant, by the ttrruunnkk!... an elephant, by the ttrruunnkk!... a tiger, by the ttaaiill!... a tiger, by the ttaaiill!... a snake, by the hheeaadd!... a snake, by the hheeaadd!... a bear, by the nnoossee!... a bear, by the nose! Sounds and Letters 2 Listen, say, and match. o oe rose octopus fox rope 46", "Phonics Fun Time! 1 Listen, read, and say. 3 Does It Move? P and B Jingles Hold a tissue in front of your mouth and say the words. P says p, p, parrot. Parrot. Bear. Pen. Banana. says p, p, pen. says p, p, panda. Plane. Blue. B says b, b, bear. Plate. Black. says b, b, banana. Panda. Bed. says b, b, bed. Wow! It moves. I Can Sounds and Letters tell if the words start with p or b. GOAL 15 Listen, say, and match. Then write the missing letters. 2 say two words that begin with p and two words that begin with b. plane blue GOAL 16 Advice Time plate black Dress neatly. The ate is ue. Unit 2 Now go to pages 8, 89 18 19", "Term 1 Term 2 Phonics Practice Phonics Practice Words with a e i o u Words with ae, ie Long Vowels Listen and write the letter or u. Then match a, e, i, o, 1 with the pictures. Listen, point, and say. 1 18 ae ie a i a 1. rt 5. mbrella 2. range 6. pricot 3. lephant 7. nder tap tape Tim time 4. nk 8. ighteen Look at the picture and circle the right word. Then 2 listen and check. Listen, point, and say. Then draw a line to the right 2 picture. Q 1. snak snake sack shake apple. We call it a, but say apron. We call it a, so we say 2. Kate cake cate kake elephant. We call it e, but we say 3. hate take hat het eleven. We call it e, so we say ink. We call it i, but we say 4. tap tape pat pate ice cream. We call it i, so we say 11 orange. We call it o, but we say 5. site cite sit tis open. We call it o, so we say umbrella. We call it u, but we say 6. nil Nile Lyn line uniform. We call it u, so we say We call them sounds and letters! 90 91", "Term 2 Term 3 Phonics Practice Phonics Practice Words with fl, fr and dr, tr Words with br, pr Listen, point, and say. Listen, point, and say. Write br or pr. 1 1 fl fr tr dr pr br idge ize flag fruit dress tree Look at the pictures and write br or pr. Then listen 2 and check. Q Listen to the sound, check, and write. Then draw a 2 line to the right picture. br 1. ead 5. esent 2. ince 6. acelet fr 1. fl fr og 2. fl fr ower idge 3. 7. ice 3. fl fr ashlight 4. fl fr iends 5. fl fr or own 4. 8. ize 6. dr tr eam 7. dr tr ink 8. dr tr uck Tongue Twister. Read and say this as fast as you can. 3 9. dr tr unk My brother prepares prawn sandwiches with brown 1 0. dr tr ain bread and eats them on the bridge. 96 97", "Goal 38 Friends, Actions, Things Words in Action I can ask questions with or, want, and say what I like and what I don't like I listened to days this week. Name Class 1 Listen and practice. Trace. Is it cold or hot? It's cold. What color is it? It's a fruit. It's yellow. Is it sweet or sour? It's sour. I know! It's a lemon! That's right! Do you want one? No, thanks. I don't like lemons. I like oranges. 2 Answer the questions about your favorite food. 1. Is it cold or hot? 2. Is it salty or sweet? 3. Is it sour? 4. What color is it? 5. Is it tasty? Write your favorite food 160", "Term 3 Phonics Practice Words with wh, w, h, and ph Words with sm, sn and st, sl Listen, point, and say. Listen, point, and say. 1 1 wh wh ph sn w sm st sl h ? walk whale hose whose phone smile snail stop slot Listen and circle the silent letter. Listen and circle sm, sn, st, or sl. Then write and 2 2 wh wh wh silent silent silent match with the right picture. 1. where w h 3. who w h 5. whales w h snorkel sn sm sn st sl 1. orkel 2. what w h 4. whose w h 6. white w h sm sn st sl 2. ot Listen, circle, and write. 3 1 sm sn st sl 3. fir shop ship whale cherry phone whistle photo white sm sn st sl 4. ep sm sn st sl 5. ile wh ph ph wh 5. 1. sm sn st sl 6. icker whale Listen, point, and say. Then say and mime. sh wh ph sh 3 6. 2. An eel, a shellfish, Swim and snorkel, ch sh ch wh I stop and touch Watch the fish. 7. 3. And try to catch Starfish, shellfish Snap! Snap! Ouch! a small red crab! Any fish you wish! ch ph wh ph 4. 8. 98 9", "Words in Action Fun Time! 1 Listen, point, and say. 3 Animal Two Hints Game Listen to two hints and say the animal's name. 1. Elephants 2. Zebras are big. are black and white. They are big. have trunks. have stripes. They have trunks. I know! 4. Chimpanzees 3. Crocodiles Elephants. are smart. are scary. Thats right! have long arms. have big teeth. Let me try! 5. Snakes 6. Hippos are long. are fat. I Can have no arms or legs. have big mouths. GOAL 45 say something about three wild animals. 2 Practice the sentences in pairs. play the Animal Two Hints Game. One partner says the animal name. The other says GOAL 46 one thing about it. Then switch. Unit 6 Now go to page 92 48 49", "UUnniitt 66 Wild Animals Fun Time! Talk Time Look! Its a Monkeys are cute! 4 Find the Animal baby monkey. 1 Listen and point. Listen to the teacher and look for the animal. Say the letter. A B C Wheres the lion? Look! Its an elephant. D E F Elephants are big! G H I Its here. L J K Wheres Wheres the lion? the snake? M Its over there. We got it! Its A. 2 Practice the talks in pairs. I Can 3 Act out the talks in pairs. act out the talks about wild animals. GOAL 41 tell friends the names of six wild animals using the animal chart. GOAL 42 Unit 2 4 45", "Goal 79 Goal 78 My Day, Animals, Places Phonics My Day, Animals, Places Words in Action I can make the sounds for e and ea, use irregular plurals and I can talk about someones appearance using have, has. that those. I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen, read, and number. 1 Listen and say. Write ea or e. 1. h d 2. sh p 3. m t 4. br d He has short, brown hair and brown eyes. Hes 2 Write about the pictures. Use there is there are. wearing a thobe and speaking with his friend. He has short, blond hair and blue eyes. Hes wearing a blue Tshirt. She has long, brown hair and brown eyes. Shes wearing a jacket, a Tshirt and a long skirt. is a man. There There She has short black hair and brown eyes. Shes There There wearing a jacket, a Tshirt, a long skirt, and pink There There shoes. 3 2 Write. feet foot mouse mice teeth tooth Read and answer about a friend. Thats a foot. 1. Whats hisher name? 1. 2. Is heshe tall or short? 2. 3. Does heshe have long 3. or short hair? 4. 4. Whats heshe wearing? 5. 5. Whats heshe doing? 6. 201 200", "Goal 6 Feelings Words in Action I can ask a friend Whats the matter? I listened to days this week. Name Class 1 Listen, point, and practice. Trace. Whats the matter? A Im cold. B Im sleepy. B Im hot. B Im hungry. B Im scared. B 2 Unscramble the words. 1. l o c d 2. r n h g u y 3. y e e l p s 4. o t h 128", "Goal 68 My Things Rhythms and Listening I can ask to borrow some things in class. I listened to days this week. Name Class 1 Listen and practice. 2 Write. 1. Can I use your ? 2. Can I use your ? 3. Can I use your ? 4. Can I use your ? 5. Can I use your ? Hint Words eraser glue scissors pencil pen 190", "Things We Wear Rhythms and Listening Goal 12 I can say three colors that Im wearing today. I listened to days this week. Name Class 1 Listen and color. purple red pink white black blue 2 Listen and write the color. 1. Im wearing today. 2. Im wearing today. 3. Im wearing today. 4. Im wearing today. 5. Im wearing today. 6. Im wearing today. 3 Write two things you are wearing today. Im wearing and oday. 134", "Phonics Fun Time! 1 Listen, read, and say. 3 Word Making Game C and G Jingles Listen to the teacher and hold up the letters. C bag, bag says c, c, cat. says c, c, cake. says c, c, cap. B A G G says g, g, goat. says g, g, gorilla. b, b a, a We got it! says g, g, girl. g, g I Can Sounds and Letters tell if the words start with c or g. GOAL 31 2 Listen, point, and say. Write gr, cr, gl, or cl. say two words that begin with c and two words that begin with g. ass ab ass ass GOAL 32 Advice Time Nature is your home look after it. Unit 4 Now go to page 91 34 35", "Rhythms and Listening 1 Listen and chant. What Are You Doing? What are you doing? Im doing karate, doing karate, doing karate. What are you doing? Im doing karate, and how about you? What are you doing? Im playing football, playing football, playing football. What are you doing? Im playing football, and how about you? 2 Chant again and do. 2", "Phonics Fun Time! 1 Listen and check. Say. Whose... is that? s z z s z z 1. 4. Listen, point, and say. 4 Maybe it's Noura's. s z z s z z Whose hat is that? 2. 5. s z z s z z 3. 6. Let's ask her! What's in your bag? 5 Trace. Ask and answer. 2 Listen, point, and say. Do you have apples? No, I don't. Do you have Abdullah Yes, I do. Faisal sandwiches? Do you have orange juice? Yes, I do. and She has sandwiches orange juice. Noura Nawal but She has orange juice she doesn't have apples. Ask your friend. Check YES or NO. 3 Food YES NO School things YES NO I Can apples books sandwiches notebooks make the sounds for s, ask and answer with orange juice a poster GOAL 39 have, and use and or but. carrots pens ask and say whose something is using name's. GOAL 40 Say and write. Use or but. and Unit 5 42 43", "Goal 80 My Day, Animals, Places Phonics I can talk about places in town and things in the house using there is, there are. I listened to days this week. Name Class 1 Listen and point. Then circle T or F. 3. train station 2. bookstore 1. restaurant 4. supermarket 9. school 8. post office 5. gym 7. museum 10. park 6. bus station 1. Theres a bookstore between the T F restaurant and the train station. T F 2. Theres a museum near the restaurant. T F 3. Theres a bus station next to the school. T F 4. Theres a supermarket opposite the gym. 5. Theres a school between the post office T F and the train station. 2 Find photos about places in your country and make a poster. Write where the place is something about the place Faisaliah Tower Faisaliah Tower in Riyadh. is very tall. It is 202", "Phonics Practice nest umbrella octopus vase parrot wolf quit fox rabbit yard sun zebra tiger 8 89", "Goal 14 Things We Wear Words in Action Goal 15 Things We Wear Phonics I can name two things I am wearing, saying Im wearing... I can tell if the words start with p or b. and... today. I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen and practice. 1 Listen, point, and practice. 2 Listen and circle p or b. 2 Listen and circle A or B. 1. 2. 3. 4. 5. 6. 2. A B 1. A B p or b p or b p or b p or b p or b p or b 3 Write the missing letters. Trace. 4. A B 3. A B e d 41 5 e a r e 6. A B 5. A B 3 n n a n d a 2 3 Write two things your friend is wearing today. n My friend is wearing a r r o t 6 and today. 136 137", "Goal 76 My Day, Animals, Places Rhythms and Listening I can talk about the weather. I listened to days this week. Name Class 1 Listen, point, and chant. Write the missing words. cloudy rainy sunny snowy windy sunny Its and hot, Sit in the shade and talk Its and gray Theres no sun today! Its and wet Were not there yet! Its and cold Dont catch a cold! Its cloudy and cool, Get out of the pool! 2 Write. A Two animals that live in very cold places B Two animals that live in very hot places 198", "glasses p17 glue p70 go p54 kangaroo p45 kitchen p61 koala p45 gorilla p34 grass p34 green light p54 light p54 lion p45 lock p6 long p32 monkey p46 motorbike p56 hippo p48 hospital p57 hot p8 mountains p30 next to p64 noisy p32 hungry p8 in p64 iron p10 104 105", "Words in Action Grammar Toolbox Whats this? What are these? Fun Time! this it Its Theyre 1 Listen, point, and say. they these 3 Pointing Race Point faster than your partner. 1. a comic book 2. comic books Singular 3. an MP3 player 4. MP3 players 5. a wallet 6. wallets Plural 7. a watch 8. watches 2 Practice the sentences. Play the Copycat Game. Whats this? Its a wallet. Whats this? Its a wallet. I was first! I Can follow the teacher and play the Copycat GOAL 69 Game. What are these? What are these? ask Whats this? or What are these? Theyre wallets. Theyre wallets. GOAL 70 Unit 9 Now go to page 100 72 73", "Goal 52 From Here to There Rhythms and Listening Goal 53 From Here to There Words in Action I can say if a traffic signal says Stop!, Wait!, or Go!. I can say the names of three vehicles. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Trace and color. Listen and practice. Copy. red yellow green 1. truck 2. bus 3. train 4. car 5. bicycle 6. taxi 2 Read and answer. Say and write. 2 Trace and copy. 1. Whats number 3? Its a. Stop! Wait ! Go! 2. Whats number 6? Its a. ! ! ! 3. Whats number 4? Its a. 174 175", "Words in Action Im Hes... 1 Listen, point, and say. 1. doing my 2. watching 3. eating homework TV snacks 4. doing 5. playing 6. playing karate football computer games Sounds and Letters Listen, point, and say. Then read and circle. 2 gring ring rink wink giwn wing speak speaking peaking 24", "Goal 34 Friends, Actions, Things Talk Time Goal 35 Friends, Actions, Things Rhythms and Listening I can chant, tell the time of day and use greetings correctly. I listened to days this week. I can talk about what I'm, heshe's, weyouthey're doing or not doing. Name Class I listened to days this week. Name Class 1 Listen and chant. Trace and write. 1 Listen and chant. Trace. morning Good It's. Good morning! We're playing, we're cycling morning to you! Our friends are here and laughing They're jumping, they're cycling How are you? How ? so nice to see you It's. As happy as can be! afternoon It's. Good afternoon! he's walking There's Omar, Good afternoon to you! His friend, Ali is talking Here's homework, more for you! He's not cycling He's laughing. evening It's. Good evening! As happy as can be! Good evening to you! Are you playing, are they cycling? It's playtime and bath time and bedtime for We're not playing, you! Goodnight! Goodnight! to you! they're not cycling 2 Match and write. We're talking, we're walking eat lunch go to school watch TV As happy as can be! It's morning. 1.. Lets 2 Look at the picture and write. It's afternoon. They're sitting. sitting 2.. Lets pointing It's evening. They're not writing. writing 3.. Lets cycling 156 157", "UUnniitt 66 Wild Animals Talk Time Look! Its a Monkeys are cute! baby monkey. 1 Listen and point. Wheres the lion? Look! Its an elephant. Elephants are big! Its here. Wheres the snake? Its over there. 2 Practice the talks in pairs. 3 Act out the talks in pairs. 4", "Goal 2 Things We Do Words in Action I can say two things when asked What are you doing? I listened to days this week. Name Class 1 Listen, point, and practice. Trace. What are you doing? Im eat ing snacks. Im playing football. Im wat ching TV. Im doing nothing! 144", "Rhythms and Listening Grammar Toolbox Fun Time! He is Hes 1 Chant and point. She is Shes Wheres the Boy? Where is Wheres 3 Where? Relay Don't forget to Wheres ? In the repeat Where? Wheres Hashim? Hes in the bathroom. Where? Hes in the bathroom. Quick! Hurry up! Sounds and Letters 2 Listen, say, and match. Then write the missing letters. I Can chant the Wheres the Boy? chant. GOAL 15195 ask Wheres ? when I want to know prize fries present frog where someone is. GOAL 16106 ies. My friend is eating Now go to page 97 Unit 8 62 63", "Words in Action Fun Time! 1 Point and chant. Write. Lemons are sour 3 The 3 Questions Game Ask and answer. Apples are sweet! Lemons are sour, Cherries are sweet! Is it cold or hot? It's cold. It's a fruit. What color is it? It's yellow. They're not sour. Is it sweet or sour? It's sour. My soup is hot! That's right! Do you I know! It's a lemon! want one? No, thanks. I don't like Icecream is cold, lemons. I like oranges. Rice is hot, Play with a friend. Ask 3 questions. Use some of the 4 words in the box. It's not cold. sweet sour salty tasty hot cold fresh round small big Chips are salty, And they're tasty! Let's eat! I Can 2 Change the words and chant. talk about food using the words hot, cold, sour, sweet, salty, tasty GOAL 37 ask questions with or, want, and say what I like and what I don't like. GOAL 38 Unit 5 40 41", "2 mreT Word List Airport p 57 Hat p 43, 91 Smile p 30 Ambulance p 56 Hills p 30 Snake p 28, 30, 4, 46, 48, 51, Beautiful p 28, 29 Hippo p 45, 48, 51 91 Bicycle p 56 Hospital p 57 Snow p 28 Big p 32, 3, 41 Hot p 40, 41 Sour p 40, 41 Bread p 50 Kangaroo p 45, 94 Space station p 57 Bus p 50, 52, 56, 57 Koala p 45 Spring p 31 Campfire p 30 Laughing p 38 Stars p 30 Cap p 34 Legs p 48 Stop p 53, 54, 5 Car p 56 Lion p 4, 45, 47 Stripes p 48 Cats p 30 Long p 28, 32 Strong p 32 Chimpanzees p 48 Meat p 50 Summer p 31 Chip p 40, 54 Monkey p 4, 46 Sweet p 40, 41 Cloud p 95 Moon p 50 Tail p 46 Cold p 40, 41 Motorbike p 56 Tasty p 40, 41 Cook p 50, 94 Mountains p 30, 31 Tap p 91 Crab p 34 Mouths p 48 Tape p 91 Crocodile p 48, 51 Noisy p 32 Taxi p 56, 57 Crush p 95 Orange p 41, 42 Taxi stand p 57 Cube p 50, 51 Peach p 50, 51 Teeth p 48 Cycling p 38, 39 Plant p 58, 59 These p 51 Daffodils p 30 Plastic p 28, 29 This p 30, 36, 37, 47 Dress p 30 Police car p 56 Tiger p 46 Excuse me. p 52 Quiet p 32 Train p 52, 56 Fall p 31 Red light p 54, 5 Train station p 52, 57 Feather p 50 Rhino p 45 Truck p 56 Flag p 58, 59, 96 Rocket p 57 Trunk p 46, 48, 49, 51 Flower p 29, 30, 31 Rolling hills p 30 Ugly p 28, 29 Fox p 46 Rope p 46 Watching TV p 39 Giraffe p 45 Rose p 46, 51 Wait p 54, 5 Glass p 34 Salty p 40, 41 Winter p 31 Go p 52, 54 School p 52, 57, 94 Yellow light p 54 Good afternoon! p 37 Sheep p 54 Zebra p 45,48 Good evening! p 37 Ship p 54 Good morning! p 36, 37 Short p 28, 32 Goodnight! p 37 Show p 28 Gorilla p 34 Sky p 30 Grass p 34 Slip p 54 Gray p 3 Small p 32, 3, 41 Green light p 54 Smart p 48 16", "Goal 54 From Here to There Words in Action I can tell someone two sentences like Take a bus. or Take a taxi. I listened to days this week. Name Class 1 Listen and match the sentences a. and the pictures. 1. Take a bus and go to the school. b. 2. Take a taxi and go to the train station. c. 3. Take an airplane and go to the space station. 4. Take a rocket and go to the moon. d. 5. Take a bicycle and go to the hospital. e. i. g. f. j. h. 2 Trace. I go to school by bus. I go to school by bicycle. I walk to school. 176", "We Can! Students Book 2 We Can! Copyright 2009 by McGrawHill Education KB R O O W Adaptation Copyright 2023 by McGrawHill Education UK Limited O K Published by arrangement with McGraw Hill LC 2 ALL RIGHTS RESERVED. NO PART OF THIS BOOK MAY BE REPRODUCED OR TRANSMITTED IN ANY FORM OR BY ANY MEANS, ELECTRONIC OR MECHANICAL, INCLUDING PHOTOCOPYING, RECORDING OR BY INFORMATION STORAGE AND RETRIEVAL SYSTEMS, WITHOUT PERMISSION IN WRITING FROM MCGRAW HILL. ISBN 9781398928183 Series consultant Mayumi Tabuchi Judy MacDonald, Steve Longworth, Anne Tseng, Project manager Development editor Editor Alfonso Reyes, Kate Vandestadt, Vandestadt Design, Peter Shaw Production manager Designer Design supervision 2023. Exclusive rights by McGrawHill Education UK Limited for manufacture and export. This book cannot be reexported from the country to which it is sold by McGrawHill Education UK Limited. Photo Credits crKatsiaryna DrobyshevaShutterstock tlLev KropotovAlamy, brAnton StarikovAlamy Stock Photo WB 125 135 5Save nature and wildlifeShutterstock clBogdan FloreaShutterstock, crLuXpicsShutterstock 143 146 166 blStephen McsweenyShutterstock, bcShawn Mahoney, brPaul HenningImage Source, 1Shawn Mahoney, 2Ondrej ProsickyShutterstock, 3Paul HenningImage Source lr, tbDmytro GilitukhaShutterstock, 2paula 167 frenchShutterstock, 3WorraketShutterstock, 4Radek BorovkaShutterstock, 5Ronnie HowardShutterstock lr, tbSerhii BrovkoShutterstock, 2David CarilletShutterstock, 3McGrawHill Education, 4Vibrant Image 170 StudioShutterstock, 5AkugasahagyShutterstock, 6Tewin KijthamrongworakulAlamy Stock Photo, 7bigjom jom Shutterstock, 8Tatweer Co. for Educational Services 1WhitevectorShutterstock, 2Sony HerdianaShutterstock, 175 3SaudiArabiaPhotographyShutterstock, 4Alexander KondratenkoShutterstock, 5iofotoShutterstock, 6Tatweer Co. for Educational Services 1MikbizShutterstock, 2vkstudioAlamy, 3Hannu LiivaarAlamy 1David 178 180 PapazianShutterstock, 2 3PeshkovaShutterstock, 4 5Interior DesignShutterstock, 6Africa StudioShutterstock, 7JOATShutterstock 1PhotobacShutterstock, 183 2Miroslav PesekShutterstock, 3 4AvaniksShutterstock, 5 Shutterstock, 6Juris KraulisShutterstock 1chalrumpon onnongwaShutterstock, 2PicsfiveShutterstock, 190 3McGrawHill Education, 4Mark Steinmetz, 5ChameleonsEyeShutterstock trKoya979Shutterstock, clLana 191 StemShutterstock, blKoya979Shutterstock, blFernandodiassShutterstock clTarikdizShutterstock, crb71 201 Shutterstock, crAmmar RasheedShutterstock, crVladislav AshikhminAlamy Stock Vector, 5tiny windmillShutterstock, 6tiny windmillShutterstock.", "Goal 62 My House Words in Action I can play the Two Hands Game. I listened to days this week. Name Class 1 Listen and play. on in under next to behind 2 Listen and practice. Trace. on in 2. 1. under behind 3. 4. next to 5. 184", "Term 1 Phonics Practice Words with a e i o u Listen and write the letter or u. Then match a, e, i, o, 1 with the pictures. 18 a 1. rt 5. mbrella 2. range 6. pricot 3. lephant 7. nder 4. nk 8. ighteen Listen, point, and say. Then draw a line to the right 2 picture. apple. We call it a, but say apron. We call it a, so we say elephant. We call it e, but we say eleven. We call it e, so we say ink. We call it i, but we say ice cream. We call it i, so we say 11 orange. We call it o, but we say open. We call it o, so we say umbrella. We call it u, but we say uniform. We call it u, so we say We call them sounds and letters! 90", "Rhythms and Listening 1 Listen, chant and match. Which animal is it? Its jaws are huge. They crush and chew. It can walk and swim It can hunt for food! Their skin is green, Their eyes pop out. They can jump and dive, They are loud and fun. 2 Listen, point, and circle YES or NO. Practice in pairs. Can ostriches run? YES NO Can they fly? YES NO Can kangaroos fly? YES NO Can they jump? YES NO Can polar bears swim? YES NO Can they speak? YES NO Ostriches can run but they cant fly! Kangaroos but Polar bears but Advice Time Birds of a feather flock together. 78", "Goal 62 My House Words in Action Goal 63 My House Phonics I can play the Two Hands Game. I can say the spelling of two threeletter words. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and play. Listen and spell. Copy. b o x o x 2. box 1. ox s u n f u n 4. sun 3. fun on in under n o t h o t 6. not 5. hot 2 Write two words in each house. next to behind 2 Listen and practice. Trace. o x o t u n 1. 2. 3. on in 2. 1. under behind 3. 4. next to 5. 184 185", "Picture Dictionary airport p57 ambulance p56 bathroom p61 clap p6 cold p8 comic book p72 bear p18 bedroom p61 behind p64 crab p34 crocodile p48 dining room p61 doing my big p32 blouse p16 bus p50 doing karate p22 dress p17 homework p20 candy p68 cap p6 chimpanzee p48 eating snacks p21 fall p31 giraffe p45 102 103", "Phonics 1 Read and color o and u. Story Ox The had He boox. a on sat ox An hoot. was He suun. the in fuun tree. a uunder sat He hoot. noot was he Then 2 Listen and spell. ox ox? 1. How do you spell box box? 2. How do you spell fun fun? 3. How do you spell sun sun? 4. How do you spell hot hot? 5. How do you spell not not? 6. How do you spell 6", "Goal 52 From Here to There Rhythms and Listening I can say if a traffic signal says Stop!, Wait!, or Go!. I listened to days this week. Name Class 1 Listen, point, and practice. Trace and color. red yellow green 2 Trace and copy. Stop! Wait ! Go! ! ! ! 174", "SyllabusSyllabus Unit and Topic Talk Time Rhythms and Listening Look! Its a baby monkey, an elephant. Mon Chant Animal Chant 6 Wild Animals keys are cute. Elephants are big. Wheres the I will catch a monkey, elephant, tiger, lion, snake? snake, bear by the toes, tail, nose. Its over there. Its here. Sounds monkey, elephant, tiger, snake, bear Excuse me. Wheres the train station? Walk Chant When You See a Red Light 7 From Here to There straight and turn left. How do you go to red, yellow, green, stop, wait, go school? I walk. How about you? I go by school bus. Term 3 Hello. Welcome to our house. Would you like Chant Wheres the Boy? 8 My House to come in? Yes, please. Ill show you around. Wheres Ali, mother, the boy? In the Thanks. This is the living room. bathroom, kitchen, dining room, yard, bedroom. Can I have some candy? Sure. Here you go. Chant Things on My Desk 9 My Things Great! Thanks. How many are there? Lets pens, pencils, paper, glue, scissors, eras count them. Numbers 1100. ers, candy Thats a lot. Tell me about your day! I get up at 6 oclock. Chant Which animal is it? 10 My Day, Animals, Places What time do you eat lunch? At 2.00 oclock. Its jaws are huge. Their skin is green Then I do my homework. Do you watch TV Can ostriches run? Yes, they can. in the evening? Yes, I do. What do you do on Can they fly? No, they cant. Saturday? I play with my friends. Ostriches can run but they cant fly! Sunday, Monday, Wednesday, Thursday, sunny, cloudy, rainy, snowy Friday, Saturday. vi", "Goal 74 My Day, Animals, Places Talk Time Goal 75 My Day, Animals, Places Rhythms and Listening I can tell the time, ask, and talk about everyday activities. I can chant, ask, and talk about animals using can or cant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and say. Then write. Listen, point, and chant. Write the missing words. huge green walk swim jump dive Which animal is it? Its jaws are. seven 2. I go to school at 1. I get up at They crush and chew. oclock. oclock. It can and, It can hunt for food! 2 0 9 0 Their skin is, 4. I go to bed at 3. I eat lunch at Their eyes pop out. oclock. oclock. They can and, 2 Put the days of the week in the right order. Write. They are loud and fun. Thursday Monday Sunday Friday 2 Read and answer. Then write sentences. Tuesday Wednesday Saturday Can snakes bite? Can elephants swim? Sunday 1. 5. Yes, hey can. 2. 6. Can they run? Can they fly? 3. 7. 4. but they cant. Elephants can but. Snakes 196 197", "Goal 4 Wild Animals Rhythms and Listening Goal 45 Wild Animals Words in Action I can play the What Animal Is This? Game with a partner. I can say something about three wild animals. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and say what animal it is. Listen, point, and practice. Trace. 2 Trace and copy. Elephant s are big. Its an elephant. 1. Zebras have stripes. Its a monkey. 2. Snakes have no arms or legs. Snakes are long. Its a tiger. Hippos have Chimpanzees 3. big mouths. are smart. 2 Finish the sentences. 3 Draw lines and match. 1. Elephants are. 2. Zebras have. 3. Hippos have. iger snake elephan 1. 2. 3. 4. Snakes are. 166 167", "Words in Action Fun Time! 1 Listen and practice. Match words and pictures. She has long, brown hair 3 Listen and match. Practice in pairs and write. astronaut architect pilot cook technician doctor teacher computer farmer firefighter businessman 1 He has short, brown hair and brown eyes. Hes 1. wearing a thobe and speaking with his friend. 2. long, brown hair, brown eyes, a red jacket, sitting 3. black hair, brown eyes, a green jacket, a white Tshirt, 2 Ask and answer. Guess. a blue skirt, pink shoes Does he work in 4. short, blond hair, blue eyes, a blue Tshirt Yes, he does. an office? Guess who! Describe someone in your class. 4 No, he isnt. Is he an She has long, brown architect? hair and brown eyes. No, he isnt. I know! Shes tall. Shes Is he a technician? Its Rana! standing near the Hes a door. Whats her name? businessman. I give up! What does he do? I Can Grammar Toolbox ask and talk about jobs what someone does. What does he she do? He Shes a teacher. GOAL 7 Does he she work in an office? talk about someones appearance using Yes, he she does. No, he she doesnt. have, has. He She works doesnt work at the airport. GOAL 78 Unit 1 80 81", "Goal 36 Friends, Actions, Things Rhythms and Listening I can ask and answer Yes No questions about what people are doing I listened to days this week. Name Class 1 Listen and practice. Trace. Where is he? He's at home. Is he sitting? Yes, he is. Is he playing? No, he isn't. Yes, he is. Now Is he watching TV? it's my turn! 2 Ask and answer. Write. reading standing Is he reading? 1. 3. ? No, he isn't. running watching TV 2. ? 4. ? 158", "UUnniitt 88 My House Talk Time Hello. Welcome to our house. 1 Listen and point. Would you like to come in? Yes, please. Ill show you around. Thanks. This is the living room. 2 Practice the talks in pairs. 3 Act out the talks in pairs. 60", "Goal 8 Feelings Phonics I can say, read, and write the sounds for a, apple a, cape i, pin i, pine by myself. I listened to days this week. Name Class 1 Listen, number the pictures, and say. t le c e ce a n k p r t v m p 2 Write the missing letters. 130", "Are you ready? Introduction Lets do it again. 6 7 One more time. Classroom English Listen and point. 1 Good morning. Welcome to class. 1 Wow! Good job! Good idea! 9 8 Lets finish. Lets play a game. Make pairs. Watch me. 2 3 Please listen to me. Okay. Lets start! 4 5 10 Okay! Stop! You were great! Goodbye. 2 3", "Phonics Read and number. Then listen and check. 4 1 z 2 s 3 z Sounds and Letters arms trunks noses 1 Listen, point, and say. Then read and number 1 or 2. 1 e 2 head read 1 hippos crocodiles snakes elephants dresses faces feather peach meat bread 1 Fun Time! 2 Listen, point, and say. Then match with u or ue. oe says rose o says hot 5 Phonics Race U says u, u, tub and U says u, u, tube. Say and mime words in pairs. bus cup Use these letters. u cube duck o ou ea u ue ue o uniform huge I Can 3 Listen, say, and match. listen, point, and match pictures, words, and food foot letters. GOAL 47 say, read, and write the sounds for ea, book moon peach and ea, head u, duck ue, cube o, book and o, boot by myself. boot cook GOAL 48 Unit 6 Now go to page 93 50 51", "Rhythms and Listening Fun Time! 1 Listen, chant and match. 3 Listen and chant. Write the words. Which animal is it? sunny cloudy rainy snowy Its jaws are huge. Its and hot, They crush and chew. It can walk and swim Sit in the shade and talk It can hunt for food! Its and gray Theres no sun today! Their skin is green, Its and wet Their eyes pop out. Were not there yet! They can jump and dive, They are loud and fun. Its and cold Dont catch a cold! 2 Listen, point, and circle YES or NO. Practice in pairs. Its cloudy and cool, Can ostriches run? YES NO Get out of the pool! Can they fly? YES NO 4 Can kangaroos fly? YES NO Talk about the weather Its sunny and Can they jump? YES NO in your town. very hot in summer! Can polar bears swim? YES NO summer autumn Can they speak? YES NO winter spring Ostriches can run but they cant fly! Kangaroos but I Can Polar bears but Advice Time chant, ask, and talk about animals using GOAL 4735 can or cant. Birds of a feather flock together. talk about the weather. GOAL 4746 Unit 1 78 79", "UUnniitt 11 Feelings Talk Time Hi. Its nice Hello! to meet you. 1 Listen and point. Hi. How are you? Im great, thanks. And you? Its nice to meet you, too. Im fine. 2 Practice the talks in pairs. 1. Use lots of facial 3 Act out the talks in pairs. expressions, like Hi. Its nice big smiles. to meet you. Hello! 2. Use your body to make gestures. 3. Talk with a strong voice. 4. Keep eye contact when you speak to someone. 4", "Goal 16 Things We Wear Phonics I can say two words that begin with p and two words that begin with b. I listened to days this week. Name Class 1 Listen, point, and practice. Trace. panda pizza 1. bear banana 2. bed bear 3. pen panda 4. box banana 5. 2 Make the sounds. p p p p b b b b p p p b b b p p b b p b 138", "Goal 20 Things We Do Rhythms and Listening I can play the True or False Action Game with a friend. I listened to days this week. Name Class 1 Listen, point, and practice. Trace. Im playing A football. False! B Im playing A computer games. True! B 2 Listen and circle T True or F False. Im playing football. Im playing computer games. 1. T F 2. T F Im doing karate. Im doing karate. 3. T F 4. T F 142", "Goal 26 Beautiful Nature Talk Time I can find something beautiful or ugly and say Look! Its a...! Its beautiful or ugly. I listened to days this week. Name Class 1 Listen, point, and practice. 2 Point and say by yourself. Trace. Look! Its a...! Its beautiful. Its ugly. plastic bag hat flower monster 3 Draw something beautiful and something ugly. Trace. beautiful ugly Its beautiful. Its ugly. 148", "Rhythms and Listening Fun Time! 1 Chant and mime. 3 Animal Chant What Animal Is This? Game Listen and guess. I will catch a monkey, by the toes, by the toes. I will catch a monkey, by the toes! What animal is this?... a monkey, by the ttooeess!... an elephant, by the trunk! I know. Its a lion.... an elephant, by the ttrruunnkk!... a tiger, by the ttaaiill!... a tiger, by the ttaaiill!... a snake, by the head! Thats right.... a snake, by the hheeaadd!... a bear, by the nose! I Can ... a bear, by the nose! chant the Animal chant. GOAL 43 Sounds and Letters play the What Animal Is This? Game with a partner. 2 Listen, say, and match. GOAL 4 o oe Advice Time rose octopus The early bird catches the worm. fox rope Unit 6 46 47", "Goal 58 My House Talk Time Goal 59 My House Rhythms and Listening I can show someone around my house. I can chant the Wheres the Boy? chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and write. Listen and chant. Trace. Wheres Ali? 1. door the hroom. In bat 2. room 1 Wheres Mom? 3. room the chen. In kit 4. room 2 Wheres Ali? 5. room the room. In dining 6. Wheres Ali? 7. door 3 the yard. In he boy? Wheres the bedroom. In 4 5 6 7 Hint Words 2 Write the missing words. A is under front door kitchen dining room bedroom the ! bathroom living room back door 180 181", "Goal 24 Things We Do Phonics I can say two words that begin with t or d and describe things. I listened to days this week. Name Class 1 Listen, point, and practice. Trace. tiger tomato 1. doll door 2. telephone tomato 3. 4. duck doll 2 Write the missing letters. A. Its t. B. Its o r. C. Its f. D. Its l l. 146", "Goal 14 Things We Wear Words in Action I can name two things I am wearing, saying Im wearing... and... today. I listened to days this week. Name Class 1 Listen, point, and practice. 2 Listen and circle A or B. 2. A B 1. A B 4. A B 3. A B 6. A B 5. A B 3 Write two things your friend is wearing today. My friend is wearing and today. 136", "Goal 2 Feelings Talk Time Goal 3 Feelings Rhythms and Listening I can say Im first, second, third... I can chant the If Youre Happy and You Know It chant with a partner. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Trace and write. Listen, say, and do. Hi, ! How ? A 2 Im fine. Listen, chant, and do. Trace. B If youre happy and you i t, know 2 Match and write. Clap your hands. 1 second fifth first If youre and you it, happy know fourth third 1 Clap your hands. , 2 first 1. Im. 3 4 If youre and you it, happy know 2. Im. 5 Then your will surely it. face show 3. If youre and you it, happy know 4. Clap your hands. , 5. 124 125", "Term 3 Phonics Practice Words with bl, br, fl, fr, cl, cr, dr Long vowel sounds Write the words and read. Read and circle the words that dont belong. Then 1 1 listen, check, and write them in the correct cloud. flag green fresh black swan clock frog fruit crayon brown 1 o Long sound go show no tomato shoe snow two so brown crayon 1. a 2. a 3. a 2 u Long sound glue blue you toe to so who too shoe 4. The is on 5. The the. is in the basket. 3 i Long sound Listen, complete, and chant. pie bye dry taxi kind line field rain 2 8 The driver on the bus The wheels the says, Move back! 4 e Long sound Move on back! round and round, spaghetti ski piece me eight donkey sky space Move on back! round and round, taxi The on the bus round and. says, Move on back! The on the bus all the town. go and round, a Long sound 5 all the way to town. able tie shake apron break neighbor ceiling steak weight 100 101", "Goal 10 Things We Wear Talk Time Things We Wear Rhythms and Listening Goal 1 I can meet someone and say I like your... I can chant the Who is Wearing Green? chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and chant. Trace. Listen, point, and practice. Trace. Green, green, green, green. I like is wearing Who A your hat. today? green Thank you. B Green, green, green, green. I like your is wearing green? Who A Tshirt. am wearing I Thank you. B today. green I like your at me, Look A jacket. And will see, you Thank you. B That am wearing today. I green 2 Listen and point. 2 Read and color his clothes. He is wearing a yellow Tshirt, Its not mine. blue pants, and a brown jacket. His cap is red. Its my hat. 132 133", "Phonics Fun Time! 1 Listen, say, and number 1 or 2. Then write the missing letters. 3 Find the numbers and draw lines. 1 sp 2 sw Listen, count, and say the missing numbers. Then play with a friend. spider sweater 81 6 40 70 68 73 50 43 56 90 60 ring ort ing an 2 62 82 48 5 2 Read and color all the vowels, a, e, i, o, and u. 78 98 80 47 57 y a D y n n u F 59 A 76 79.. t a m a n o t a s 100 t a c t a f A 84 4 62 Im finished!.. n e p a n o t a s n e h t a f A. x o b a n i t a s x o f t a f A I Can .. g u r a read the story A Funny Day by myself. n o GOAL 71 t a s g u b t a f a d n A count from 40 to 100. GOAL 72 Unit 9 Now go to page 101 74 75", "Phonics Sounds and Letters 1 Listen, say, and match. Then write the missing letters. bl cl fl gl pl 1. ack 2. ass 3. ag 4. ant 5. ock 6. ue 7. y 8. ate Advice Time Ask and youll never be lost. 58", "Phonics 1 Listen, say, and number 1 or 2. Then write the missing letters. 1 sp 2 sw spider sweater ring ort ing an 2 2 Read and color all the vowels, a, e, i, o, and u. y a D y n n u F A. t a m a n o t a s t a c t a f A. n e p a n o t a s n e h t a f A. x o b a n i t a s x o f t a f A. g u r a n o t a s g u b t a f a d n A 74", "UUnniitt 99 My Things Fun Time! Are you ready? Talk Time 4 Can I have some candy? Word Hunt When you get a row 1 Listen and point. of letters, shout Row! Sure. Here you go. Yes, we are! Great! Thanks. Bed! How many are there? Lets count them. Row! I Can 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, Thats a lot! 1, 12, 13, 14, 15, 16, 17, 18, 19, 20, act out the talks about candy with GOAL 65 21, 2, 23, 24, 25, 26, 27, 28, 29, 30. a partner. count from one to thirty. GOAL 6 Advice Time 2 Practice the talks in pairs. Don't put all your eggs in one 3 Act out the basket. talks in pairs. Unit 2 68 69", "Words in Action 1 Point and chant. Write. Lemons are sour Apples are sweet! Lemons are sour, Cherries are sweet! They're not sour. My soup is hot! Icecream is cold, Rice is hot, It's not cold. Chips are salty, And they're tasty! Let's eat! 2 Change the words and chant. 40", "Goal 26 Beautiful Nature Talk Time Goal 27 Beautiful Nature Rhythms and Listening I can find something beautiful or ugly and say Look! Its a...! I can chant the I Love the Mountains chant. Its beautiful or ugly. I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen and chant. Trace. 1 Listen, point, and practice. love the ains, I mount 2 Point and say by yourself. Trace. love the hills, I rolling Look! Its a...! love the flowers, I Its beautiful. love the daffodils, I Its ugly. plastic bag hat flower monster love the I campfire when 3 Draw something beautiful and something ugly. Trace. all the are out. stars beautiful ugly I sit and look, I look and smile, Im happy to be under this sky. 2 Color the picture. Its beautiful. Its ugly. 148 149", "Goal 28 Beautiful Nature Rhythms and Listening I can name seasons and months. I listened to days this week. Name Class 1 Listen and chant. Write the words. fall winter spring summer September March Back to school, its., October, November. s here. Getting cooler, December, January, February. Flowers are out, its., April, May. s here. Yummy, June, July, August, And back again. 2 Find and circle four words. n i t w n i e r g r p l s s l u a m f r m e 150", "Term 2 Term 3 Phonics Practice Phonics Practice Words with fl, fr and dr, tr Words with br, pr Listen, point, and say. Listen, point, and say. Write br or pr. 1 1 fl fr tr dr pr br idge ize flag fruit dress tree Look at the pictures and write br or pr. Then listen 2 and check. Q Listen to the sound, check, and write. Then draw a 2 line to the right picture. br 1. ead 5. esent 2. ince acelet 6. fr 1. fl fr og 2. fl fr ower idge ice 3. 7. 3. fl fr ashlight 4. fl fr iends 5. fl fr or own ize 4. 8. 6. dr tr eam 7. dr tr ink 8. dr tr uck Tongue Twister. Read and say this as fast as you can. 3 9. dr tr unk My brother prepares prawn sandwiches with brown 1 0. dr tr ain bread and eats them on the bridge. 96 97", "Rhythms and Listening 1 Chant and march. I Love the Mountains I love the mountains, I love the rolling hills, I love the flowers, I love the daffodils, I love the campfire when all the stars are out. I sit and look, I look and smile, Im happy to be under this sky. Sounds and Letters 2 Listen, say, and number. Then read. 1 z 2 s 3 Iz mountains cats faces flowers hills ducks 2 dresses snakes noses 30", "Words in Action Grammar Toolbox playing with Im football. sports a ball Im Hes... 1 Listen, point, and say. without doing sports a ball Im karate. Fun Time! 3 Card Snap Game When your teacher says the sentence, hit the card. Im eating snacks! 1. doing my 2. watching 3. eating homework TV snacks Oh! Hey! 4. doing 5. playing 6. playing karate football computer games I was first! No, I was! Sounds and Letters Listen, point, and say. Then read and circle. 2 I Can gring ring rink play the Card Snap Game with friends. GOAL 21 wink giwn wing say two things when asked What are you doing? GOAL 2 speak speaking peaking Unit 3 24 25", "Grammar Toolbox Rhythms and Listening Fun Time! Whos Who is 1 Chant and clap the rhythm. 3 Clothes Color Basket Who is Wearing Green? Ask about the colors your classmates are wearing. Green, green, green, green. Whos wearing blue today? Who is wearing green today? Green, green, green, green. He is! Who is wearing green? I am wearing green today. I am! Look at me, And you will see, Im not! That I am wearing green today. Youre it! Im it! Sounds and Letters 2 Listen, point, and say. Then write the missing letters. I Can green grass GOAL 1 chant the Who is Wearing Green? chant. ass is een. Its eat! The say three colors that Im wearing today. GOAL 12 Unit 2 Now go to pages 86, 87 14 15", "Grammar Toolbox UUnniitt 22 Things We Wear Fun Time! my hat. mine. Its Its not mine. not my hat. Its Its Talk Time Hi, Labeeba. Hi. 4 Whose is This? 1 Ask your classmates about peoples belongings. Listen and point. Thank you! Wow! I like your hat! Whose hat is this? Whose hat is this? Its mine. Thank you. Its not mine. Its mine. Thank you. Youre welcome. 2 Practice and act out the talks in pairs. Hey! Oh! Sounds and Letters 3 Listen, point, and number. Then say. I Can whose who what white GOAL 09 1 ask Whose... is this? meet someone and say I like your... Whos wearing white? The girls wearing white. GOAL 10 Unit 2 12 13", "Goal 48 Wild Animals Phonics I can say, read, and write the sounds for ea, peach and ea, head u, duck ue, cube o, book and o, boot by myself. I listened to days this week. Name Class 1 Listen and write the missing letters. 1. r s 2. m n 3. 4. f x b s 5. 6. b k c b 2 Find the words in your book and copy them. 1. 2. 3. 4. 5. 170", "Words in Action 1 Listen, point, and say. mouse on chair. The is the mouse in cupboard. The is the mouse under bed. The is the mouse next to fridge. The is the mouse behind table. The is the Sounds and Letters 2 Listen, say, and match. Then write the missing letters. cloud mouse house mountain se is in the h se. The m 64", "UUnniitt 44 Beautiful Nature Talk Time Look! Its a plastic bag! 1 Listen and point. Look! Its a snake! Its beautiful! Its short! No, its ugly! No, its long! 2 Practice and act out the talks in pairs. Sounds and Letters 3 Listen, point, and say. Then write sn or sh. ake ake ow ow Show me the snake! 28", "UUnniitt 77 From Here to There Talk Time Excuse me. Wheres the train station? 1 Listen and point. Walk straight and turn left. How do you go to school? I walk. How about you? I go by school bus. 2 Practice and act out the talks in pairs. 3 Listen, point, and say. Then write the missing letters. station st ep st op eps Walk straight two and op! 52", "Goal 18 Things We Do Talk Time Goal 19 Things We Do Rhythms and Listening I can have a telephone conversation in English. I can chant the What Are You Doing? chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Say your name. Listen and chant. Trace. are you doing? What 2 Speak English with your family or friends. Im karate, doing Hello. Can I speak to ? Speaking. A B karate, karate. doing doing are you doing? What What are you doing? Im watching TV. B A Im karate, and about you? doing how Goodbye. are you doing? What Bye. B A Im playing football, football, football. playing playing are you doing? What Im football, and how about you? playing doing playing watching 2 Match the words. homework karate TV football 140 141", "UUnniitt 1100 My Day, Animals, Places Talk Time 1 Listen and say. Tell me about your day! I get up at 6 oclock. At 2.00 oclock. What time do Then I do my you eat lunch? homework. Yes, I do. Do you watch TV in the evening? What do you do I play with my on Saturday? friends. 2 Practice the talks in pairs. 3 Practice and act out the talks in pairs. 76", "Rhythms and Listening Fun Time! 1 Chant and do the actions. 3 When You See a Red Light Traffic Signal Game Listen to the leader and say what to do. When you see a red light, red light, red light. When you see a red light, stop, stop, stop. When you see a red light, red light, When you see a yellow light, red light yellow light, yellow light. When you see a yellow light, wait, wait, wait. Stop, stop, stop! When you see a green light, green light, green light. When you see a green light, go, go, go. Sounds and Letters Listen, say, and number. Then write the missing 2 letters. I Can ship chip slip chant the When You See a Red Light chant. GOAL 51 say if a traffic signal says Stop!, Wait!, ep eese ep or Go!. GOAL 52 Unit 7 Now go to page 94 54 5", "Goal 60 My House Rhythms and Listening Goal 61 My House Words in Action I can ask Wheres...? when I want to know where someone is. I can say the names of three pieces of furniture. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Trace. Listen and practice. Wheres Ali? Ali Hes in the bat hroom. 1. 2. 3. Wheres Mom? Mom 4. 5. 6. Shes in the kitchen. 2 Unscramble the words. Write. Draw lines and match. Wheres Ali? Ali Hes in the dining room. 1. r a i c h a. Wheres the boy? boy In the bedroom. 2. b u p c d a o r b. 2 Write. 1. Wheres Mom? in the kitchen. 3. d i r e g f c. 2. Wheres Ali? in the bathroom. 4. e a l b t d. Hint Words Hint Words fridge chair cupboard table Hes Shes 182 183", "Goal 30 Beautiful Nature Words in Action Goal 31 Beautiful Nature Phonics I can describe and guess what or who. I can tell if the words start with c or g. I listened to I listened to days this week. days this week. Name Class Name Class 1 Listen and practice. 1 Listen, point, and practice. 2 Listen and circle c or g. Its long. Its short. Its big. Its small. 1. 2. 3. c or g c or g c or g 4. 5. 6. c or g c or g c or g 3 Write the missing letters c or g. Trace and copy. 2 Listen, read, and match. irl at 1. 2. Its small Its big and A B and gray. strong. oat ap 3. 4. ake orilla 5. 6. Its small Its small C D and noisy. and quiet. 152 153", "Phonics Practice goat Handwriting Practice Phonics Key Words Read and say. 1 Trace and copy. 2 hat apple apple apple ink bear jet cow kiwi duck egg lion monkey fish 86 87", "UUnniitt 99 My Things Talk Time Can I have some candy? 1 Listen and point. Sure. Here you go. Great! Thanks. How many are there? Lets count them. 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, Thats a lot! 1, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 2, 23, 24, 25, 26, 27, 28, 29, 30. 2 Practice the talks in pairs. 3 Act out the talks in pairs. 68", "Contents Workbook Term 1 123 Feelings Unit 1 131 Things We Wear Unit 2 139 Things We Do Unit 3 Term 2 147 Beautiful Nature Unit 4 155 Friends, Actions, Things Unit 5 163 Wild Animals Unit 6 171 From Here to There Unit 7 Term 3 179 My House Unit 8 187 My Things Unit 9 195 My Day, Animals, Places Unit 1", "Words in Action Fun Time! Whats the matter? 1 Listen, point, and say. 1. 2. 4 Same as the Leader Game Hes hungry! Do the same action as the leader. Whats the matter? Im hungry. Im thirsty. Im hungry! 3. 4. Im hot. Im cold. 5. 6. Im sleepy. Im scared. 2 Listen and do. 3 Practice and do in pairs. I got it! Oops! Whats the matter? I Can GOAL 05 act out three feelings. ask a friend Whats the matter? Im hungry. GOAL 06 Unit 1 8 9", "Goal 46 Wild Animals Words in Action I can play the Animal Two Hints Game. I listened to days this week. Name Class 1 Listen to two hints and guess what the animals are. 2 Write the animal names. 1. 2. 3. 4. 5. Hint Words hippo crocodile chimpanzee elephant zebra 168", "Words in Action 1 Listen, point, and say. 1. Elephants 2. Zebras are big. are black and white. have trunks. have stripes. 4. Chimpanzees 3. Crocodiles are smart. are scary. have long arms. have big teeth. 5. Snakes 6. Hippos are long. are fat. have no arms or legs. have big mouths. 2 Practice the sentences in pairs. One partner says the animal name. The other says one thing about it. Then switch. 48", "Rhythms and Listening 1 Chant and point. Wheres the Boy? Wheres ? In the Sounds and Letters 2 Listen, say, and match. Then write the missing letters. prize fries present frog ies. My friend is eating 62", "Words in Action Whats this? What are these? Its Theyre 1 Listen, point, and say. 1. a comic book 2. comic books 3. an MP3 player 4. MP3 players 5. a wallet 6. wallets 7. a watch 8. watches 2 Practice the sentences. Play the Copycat Game. Whats this? Its a wallet. Whats this? Its a wallet. What are these? What are these? Theyre wallets. Theyre wallets. 72", "Goal 50 From Here to There Talk Time I can give directions to a partner, saying Turn left., Turn right., and Walk straight. I listened to days this week. Name Class 1 Listen, point, and practice. Do the actions. Trace. Turn left. Turn left. Walk straight three steps. Turn right. 2 Listen to the directions and go to the exit. Entrance Exit 172", "nest octopus parrot quit rabbit sun tiger 8", "CD 6 Audio Track List Track Unit Workbook Section Track Unit Workbook Section 2 6 Exercise 1. Listen, point, and practice 2 8 Exercise 1. Listen and practice 3 6 Exercise 1. Listen, point, and practice 23 8 Exercise 1. Listen and play 4 6 Exercise 1. Listen, chant, and mime 24 8 Exercise 1. Listen and spell 5 6 Exercise 1. Listen and say what 25 8 Exercise 1. Listen and read animal it is 26 9 Exercise 1. Listen, point, and practice 6 6 Exercise 1. Listen, point, and practice 27 9 Exercise 1. Listen, point, and practice 7 6 Exercise 1. Listen to two hints and 28 9 Exercise 1. Listen, chant, and point guess 29 9 Exercise 1. Listen and practice 8 6 Exercise 1. Listen, point, and match 30 9 Exercise 1. Listen, point, and practice 9 6 Exercise 1. Listen and write the miss 31 9 Exercise 1. Listen, point, and practice ing letters 32 9 Exercise 1. Listen and read 10 7 Exercise 1. Listen, point, and practice 3 9 Exercise 1. Listen and connect the 1 7 Exercise 1. Listen, point, and practice numbers 12 7 Exercise 1. Listen and chant 34 10 Exercise 1. Listen, point, and 13 7 Exercise 1. Listen, point, and practice practice 14 7 Exercise 1. Listen and practice 35 10 Exercise 1. Listen, point, and say. 15 7 Exercise 1. Listen and match 36 10 Exercise 1. Listen, point, and chant 16 7 Exercise 1. Listen, point, and match 37 10 Exercise 1. Listen, point, and chant 17 7 Exercise 1. Listen and write the 38 10 Exercise 1. Listen and practice words 39 10 Exercise 1. Listen, read, and number 18 8 Exercise 1. Listen, point, and practice 40 10 Exercise 1. Listen and say 19 8 Exercise 1. Listen and write 41 10 Exercise 1. Listen and point 20 8 Exercise 1. Listen and chant 21 8 Exercise 1. Listen and practice 14", "Goal 58 My House Talk Time I can show someone around my house. I listened to days this week. Name Class 1 Listen and write. 1. door 2. room 1 3. room 4. room 2 5. room 6. 7. door 3 4 5 6 7 Hint Words front door kitchen dining room bedroom bathroom living room back door 180", "Rhythms and Listening 1 Chant and do. If Youre Happy and You Know It If youre happy and you know it, Clap your hands. , If youre happy and you know it, Clap your hands. , If youre happy and you know it, Then your face will surely show it, If youre happy and you know it, Clap your hands. , Sounds and Letters 2 Listen, say, and match. cap clap lock clock 6", "1 mreT Word List CD 6 Audio Track List Track Unit Workbook Section Track Unit Workbook Section 2 6 Exercise 1. Listen, point, and practice 2 8 Exercise 1. Listen and practice Apron p 10, 90 Orange p 14, 90 Wearing p 12, 14, 15, 16, 17 3 6 Exercise 1. Listen, point, and practice 23 8 Exercise 1. Listen and play Blouse p 16 Phone p 20 Whats the matter? p 8, 9 4 6 Exercise 1. Listen, chant, and mime 24 8 Exercise 1. Listen and spell Blue p 15, 18, 19 Photo p 20 Wing p 24 5 6 Exercise 1. Listen and say what 25 8 Exercise 1. Listen and read Cap p 6, 10, 16 Pin p 10, 1 animal it is 26 9 Exercise 1. Listen, point, and practice Cape p 10, 1 Pine p 10, 1 6 6 Exercise 1. Listen, point, and practice 27 9 Exercise 1. Listen, point, and practice Clap p 6, 14 Plate p 18, 19 7 6 Exercise 1. Listen to two hints and 28 9 Exercise 1. Listen, chant, and point guess Clock p 6 Playing computer games p 24 29 9 Exercise 1. Listen and practice 8 6 Exercise 1. Listen, point, and match Cold p 8 Playing football p 2, 24, 25 30 9 Exercise 1. Listen, point, and practice 9 6 Exercise 1. Listen and write the miss Doing karate p 2, 24, 25 Please listen to me. p 3 31 9 Exercise 1. Listen, point, and practice ing letters Doing my homework p 20, 24 Ring p 24 32 9 Exercise 1. Listen and read 10 7 Exercise 1. Listen, point, and practice Dress p 17, 19 Sandals p 17 3 9 Exercise 1. Listen and connect the 1 7 Exercise 1. Listen, point, and practice numbers Drink p 26 Scared p 8 12 7 Exercise 1. Listen and chant 34 10 Exercise 1. Listen, point, and Eating snacks p 21, 24, 25 Second p 5, 7 13 7 Exercise 1. Listen, point, and practice practice Eighth p 7 Seventh p 7 14 7 Exercise 1. Listen and practice 35 10 Exercise 1. Listen, point, and say. Fifth p 5, 7 Shake p 28 15 7 Exercise 1. Listen and match 36 10 Exercise 1. Listen, point, and chant First p 5, 7, 25 Shirt p 17 16 7 Exercise 1. Listen, point, and match 37 10 Exercise 1. Listen, point, and chant 17 7 Exercise 1. Listen and write the Fourth p 5, 7 Shoes p 16 38 10 Exercise 1. Listen and practice words Glasses p 17 Show p 6 39 10 Exercise 1. Listen, read, and number 18 8 Exercise 1. Listen, point, and practice Good idea! p 2 Sixth p 7 40 10 Exercise 1. Listen and say 19 8 Exercise 1. Listen and write Good job! p 3 Skirt p 16 41 10 Exercise 1. Listen and point 20 8 Exercise 1. Listen and chant Good morning! p 2 Sleepy p 8 21 8 Exercise 1. Listen and practice Grass p 14 Speaking p 20, 21, 24 Green p 14, 15 Strong p 4 Hands p 6, 17 Sunglasses p 16 Hat p 12, 13, 16 Sweater p 16 Hungry p 8, 9 Tap p 10 Ink p 10, 84, 87, 90 Tape p 10 Iron p 10 Tenth p 7 Jacket p 16 Third p 5, 7 Jeans p 16 Thirsty p 8 Lets do it again. p 3 Tiger p 26 Lets play a game. p 2 Tshirt p 16 Lock p 6 Tree p 26 Make pairs. p 2 Watching TV p 20, 24 Ninth p 7 Watch me. p 2 One more time. p 3 Weak p 3 14 15", "Words in Action 1 Listen, point, and say. 1. long 2. short 3. big 4. small 5. quiet 6. noisy 7. weak 8. strong 2 Shout the opposites in two groups. 3 Practice the actions in pairs. 32", "SyllabusSyllabus Unit and Topic Talk Time Rhythms and Listening Words in Action Phonics Phonics Practice Good morning. Welcome to class. Lets Introduction play a game. Good idea! Watch me. Make pairs. Okay. Lets start! Yeah! Okay! Stop! Are you ready? Lets do it again. One more time. Please listen to me. Wow! Good job! Lets finish. You were great! Goodbye. Term 1 Term 1 Hello. Hi. Its nice to meet you. Its nice to Chant If Youre Happy and 1 Feelings Whats the matter? ConsonantsC and Cl, L and Cl Phonics Jingle meet you, too. How are you? You Know It Im hungry, thirsty, hot, cold, sleepy, cap, clap, lock, clock Im great, thanks. And you? Im fine. Clap your hands. Stamp your foot. scared. Longshort vowels Nod your head. Snap your fingers. a and ae, i and ie Thump your chest. cap, cape, tap, tape, pin, pine, ink, Tim, time, iron Wow! I like your hat. Thank you. Whose Chant Who is Wearing Green? 2 Things We Wear Im wearing a Tshirt, a jacket, a cap, Consonants P and B Handwriting Practice Phonics Key Words hat is this? Its not mine. Its mine. Thank I am wearing green today. Look at jeans, a skirt, sunglasses, a sweater, a P and B Jingles you. Youre welcome. me. I am. Im not. blouse, parrot, pen, panda Color review a hat, shoes. bear, banana, bed Consonant clusters pl and bl plane, plate, blue, black gr, grass, green, great who, whose, who and what, white Hello. Can I speak to Joe? Speaking. Chant What Are You Doing? 3 Things We Do What are you doing? Im watching TV, eat Consonants T and D Words with a e i o u What are you doing? Im watching TV. Im doing karate. Im playing ing snacks, doing karate my homework, T and D Jingles And you? Im eating snacks. football. playing football computer games. tiger, tomato, telephone door, doll, duck ph, phone, photo, phonics, elephant ing, ring, wing, speaking, doing, watch ing, eating, playing tr and dr, tree, truck, dress, drink Term 2 Term 2 Look! Its a snake, plastic bag. Its short Chant I Love the Mountains 4 Beautiful Nature Its long short, big small, Consonants C and G Words with ae, ie long, beautiful ugly. Look at the beautiful I love the mountains, rolling hills, quiet noisy, weak strong. C and G Jingles Long Vowels flowers, daffodils, campfire when cat, cake, cap all the stars are out. goat, gorilla, girl Consonant clusters gr and cr, gl and cl class, crab, glass, grass sn and sh snake, shake, snow, show z, s, z mountains, flowers, hills, cats, ducks, snakes, faces, dresses, noses Good morning Ali. Wheres Jake? He Chant Were playing, were cycling 5 Friends, Actions, Things Theyre sweet, sour, hot, cold, salty, Plural endings z, s, z cant come. Hes helping his brother. Our friends are laughing, jump tasty She has sandwiches and orange juice. This is my friend Omar. Nice to meet you ing, cycling as happy as can be! Thats right! She has orange juice but she doesnt Omar! Nice to meet you, too! Ready? His friend is walking, talking, not Do you want one? have apples. Lets go to the new computer store! cycling Are you they playing, cy Whose hat is that? Maybe, Its Nouras Chant Good morning! Chant cling? Were not playing, theyre Good morning afternoon evening! not cycling Goodnight! iv v", "Goal 60 My House Rhythms and Listening I can ask Wheres...? when I want to know where someone is. I listened to days this week. Name Class 1 Listen and practice. Trace. Wheres Ali? Ali Hes in the bat hroom. Wheres Mom? Mom Shes in the kitchen. Wheres Ali? Ali Hes in the dining room. Wheres the boy? boy In the bedroom. 2 Write. 1. Wheres Mom? in the kitchen. 2. Wheres Ali? in the bathroom. Hint Words Hes Shes 182", "Goal 38 Friends, Actions, Things Words in Action Goal 39 Friends, Actions, Things Phonics I can ask questions with or, want, and say what I like and what I can make the sounds for s, ask and answer with have and use I don't like and or but I listened to I listened to days this week. days this week. Name Class Name Class Q. 1 1 Listen and practice. Trace. Listen and check Then write. s z z s z z Is it cold or hot? 1. 4. It's cold. apples What color is it? It's a fruit. It's yellow. Is it sweet s z z s z z 2. 5. or sour? It's sour. I know! It's a lemon! That's right! Do s z z s z z you want one? 3. 6. No, thanks. I don't like lemons. I like oranges. 2 Write answers. 2 Answer the questions about your favorite food. Yes, I do. No, I don't. 1. Do you have a pen? 1. Is it cold or hot? 2. Do you have cookies? 2. Is it salty or sweet? 3. Is it sour? 3. Do you have a computer? 4. What color is it? 4. Do you have notebooks? 5. Is it tasty? Write your favorite food 160 161", "Goal 4 Wild Animals Rhythms and Listening I can play the What Animal Is This? Game with a partner. I listened to days this week. Name Class 1 Listen and say what animal it is. 2 Trace and copy. Its an elephant. 1. Its a monkey. 2. Its a tiger. 3. 3 Draw lines and match. iger snake elephan 1. 2. 3. 166", "Unit 2 Things We Wear Goal 8 Feelings Phonics I can say, read, and write the sounds for a, apple a, cape i, pin Goal 9 Things We Wear Talk Time i, pine by myself. I can ask Whose... is this? I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen, number the pictures, and say. 1 Listen, point, and practice. 2 Read and write the missing letters. a is this? Its mine. 1. Whose t le c e e 2. Whose is this? Its not mine. a 3. Whose is this? Its mine. ce a n u 4. Whose is this? Its not mine. 3 Draw lines and match. k p r mouse candy t v m p squirrel cheese 2 Write the missing letters. boy acorn 130 131", "Picture Dictionary airport p57 ambulance p56 bathroom p61 bear p18 bedroom p61 behind p64 big p32 blouse p16 bus p50 candy p68 cap p6 chimpanzee p48 102", "Phonics Fun Time! 1 Listen, point, and say. Phonics Game 4 Mime and say in pairs. and A says a, a, A says a, a, apple apron I, i, pine. I says a ae cap tap cape tape 2 Listen and number 1 for a and 2 for ae. Then say. 1 I Can listen and point to the right pictures and words. GOAL 07 say, read, and write the sounds for a, 3 Listen, say, and match. apple a, cape i, pin i, pine by myself. GOAL 08 I says i, i, ink and I says i, i, iron Advice Time ink Tim iron pine A kind word is a form of charity. Prophet Muhammad peace be upon him pin time Unit 1 Now go to pages 84, 85 10 1", "Goal 4 Feelings Rhythms and Listening I can play the Confusion Game with a partner and say sixth, seventh, eighth,... I listened to days this week. Name Class 1 Listen and touch. 2 Listen and match. Write. d a f i c j h g b e e 1. is the letter of the alphabet. h 2. is the. i 3.. first sixth seventh second third eighth fourth ninth tenth fifth 3 Join the dots. Write. f h 126", "1 mreT Unit 1 Feelings Goal 1 Feelings Talk Time I can greet my teacher and ask How are you? I listened to days this week. Name Class 1 Listen, point, and practice. Trace. Contents Hello! Hello! B Workbook A Term 1 123 Feelings Unit 1 131 Things We Wear Unit 2 139 Things We Do Unit 3 How are you? Im great, thanks. A B Term 2 And you? 147 Beautiful Nature Unit 4 155 Friends, Actions, Things Unit 5 Im fine. A 163 Wild Animals Unit 6 171 From Here to There Unit 7 Term 3 2 Join the dots. Read. 179 My House Unit 8 187 My Things Unit 9 195 My Day, Animals, Places Unit 1 123", "Goal 18 Things We Do Talk Time I can have a telephone conversation in English. I listened to days this week. Name Class 1 Listen, point, and practice. Say your name. 2 Speak English with your family or friends. Hello. Can I speak to ? Speaking. A B What are you doing? Im watching TV. B A Goodbye. Bye. B A 140", "UUnniitt 33 Things We Do Talk Time Hello. Can I speak to Joe? 1 Listen and point. Speaking. Its Labeeb. What are you doing? Hi, Labeeb! Im doing my homework. Whats your dad doing? Hes watching TV. 2 Practice and act out the talks in pairs. Sounds and Letters 3 Listen, say, and match. Then write the missing letters. phone photo phonics elephant a b apple bear I like the ele ant oto. 20", "Phonics 1 Listen, read, and say. P and B Jingles P says p, p, parrot. says p, p, pen. says p, p, panda. B says b, b, bear. says b, b, banana. says b, b, bed. Sounds and Letters Listen, say, and match. Then write the missing letters. 2 plane blue plate black The ate is ue. 18", "3 mreT UUnniitt 88 My House Fun Time! Talk Time Hello. 4 An Old House Welcome to our house. Listen and find one thing 1 Listen and point. Would you like to come in? in each room. Yes, please. 6. living room 4. bathroom 5. bedroom 3. kitchen Ill show you around. Thanks. 2. dining room Here it is! I found it! 1. front door This is the living room. I Can 2 Practice the talks act out the talks about showing around the GOAL 57 in pairs. house with a partner. 3 Act out the talks show someone around my house. GOAL 58 in pairs. Unit 2 60 61", "Goal 50 From Here to There Talk Time Goal 51 From Here to There Rhythms and Listening I can give directions to a partner, saying Turn left., Turn right., I can chant the When You See a Red Light chant. and Walk straight. I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen and chant. Trace. 1 Listen, point, and practice. Do the actions. Trace. you see a ligh, When red light, light. red red Turn left. Turn left. you see a When red Walk st raight three light, stop, stop, stop. steps. Turn right. you see a light, When yellow light, light. yellow yellow you see a When yellow 2 Listen to the directions and go to the exit. light,,,. wait wait wait Entrance you see a light, When green light, light. green green you see a When green light, go, go, go. Exit 2 Color. green yellow red wait stop go 172 173", "Rhythms and Listening F is the seventh letter Fun Time! of the alphabet. 1 Chant and do. 3 Confusion Game If Youre Happy and You Know It Try and trick your partner! If youre happy and you know it, Clap your hands. , If youre happy and you know it, No, its the sixth letter. G is the seventh letter. Clap your hands. , 1 first 6 sixth If youre happy and you know it,................ 2 second 7 seventh Then your face will surely show it,................ 3 third 8 eighth................ If youre happy and you know it, 4 fourth 9 ninth................ Clap your hands. , 5 fifth 10 tenth................ Sounds and Letters This is fun! Haha! 2 Listen, say, and match. I Can cap clap chant the If Youre Happy and You Know chant with a partner. It GOAL 03 play the Confusion Game with a partner lock clock and say sixth, seventh, eighth, GOAL 04 Unit 1 7 6", "Unit 3 Things We Do Goal 16 Things We Wear Phonics I can say two words that begin with p and two words that begin with b. Goal 17 Things We Do Talk Time I listened to days this week. I can act out the telephone talks with a partner. Name Class I listened to days this week. Name Class 1 Listen, point, and practice. Trace. 1 Listen, point, and practice. Trace. panda pizza 1. Hello. Can I speak to Joe? A bear banana Speaking. 2. B bed bear 3. What are you doing? A pen panda Im doing my homework. 4. B box banana What s your dad doing? 5. A 2 Make the sounds. Hes watching TV. B p p p p b b b b p p p b b b p p b b p b 138 139", "UUnniitt 22 Things We Wear Talk Time Hi, Labeeba. Hi. 1 Listen and point. Thank you! Wow! I like your hat! Whose hat is this? Its not mine. Its mine. Thank you. Youre welcome. 2 Practice and act out the talks in pairs. Sounds and Letters 3 Listen, point, and number. Then say. whose who what white 1 Whos wearing white? The girls wearing white. 12", "UUnniitt 33 Things We Do Fun Time! Talk Time Hello. Can I speak to Joe? 4 Telephone Conversation Act out a telephone conversation. Call a friend and 1 Listen and point. Speaking. ask what he or she is doing. Its Labeeb. What Hello. Can I are you doing? speak to Samir? Speaking. Its Adel. What are you doing? Hi, Labeeb! Im doing my homework. Whats your Hi, Adel! Im dad doing? eating snacks! Hes watching TV. Lucky you! 2 Practice and act out the talks in pairs. Speak up! Sounds and Letters 3 Listen, say, and match. Then write the missing letters. I Can phone photo phonics elephant act out the telephone talks with a partner. GOAL 17 a b have a telephone conversation in English. apple bear GOAL 18 I like the ele ant oto. Unit 2 20 21", "2 mreT Unit 4 Beautiful Nature Goal 24 Things We Do Phonics I can say two words that begin with t or d and describe things. Goal 25 Beautiful Nature Talk Time I listened to days this week. I can act out one of the talks about nature. Name Class I listened to days this week. Name Class 1 Listen, point, and practice. Trace. tiger tomato 1 Listen, point, and practice. Trace. 1. Look! Its a snake! A doll door 2. Its short! B telephone tomato 3. No, it s long! 4. duck doll A Look! Its a plastic bag! A 2 Write the missing letters. Its beautiful! B A. Its t. B. Its o r. No, it s ugly! C. Its f. D. Its l l. A 146 147", "Goal 42 Wild Animals Talk Time Goal 43 Wild Animals Rhythms and Listening I can tell friends the names of six wild animals using the animal chart. I can chant the Animal chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Trace. Listen, chant, and mime. Trace. a monkey will, I catch By the toes, by the toes. zebra 2. 1. giraffe 3. ostrich will a monkey, by the toes! I catch... a monkey by the toes! lion elephant an 4. 5. hyena 6. elephant will, by the trunk! I catch... an elephant by the trunk! hippo tiger a 8...., the tail! by 7. chimpanzee 9. rhinoceros... a tiger by the tail! koala a snake..., the head! by 12. 10. snake 1. kangaroo... a snake by the head! a bear tiger..., the nose! by 15. 13. iguana 14. polar bear... a bear by the nose! 2 Point to and say six animals that you like. 164 165", "Contents We Can! Students Book 2 We Can! Copyright 2009 by McGrawHill Education Adaptation Copyright 2023 by McGrawHill Education UK Limited Students Book Published by arrangement with McGraw Hill LC Term 1 ALL RIGHTS RESERVED. NO PART OF THIS BOOK MAY BE REPRODUCED OR TRANSMITTED IN ANY FORM OR BY ANY MEANS, ELECTRONIC OR MECHANICAL, INCLUDING PHOTOCOPYING, RECORDING OR BY INFORMATION STORAGE AND RETRIEVAL SYSTEMS, WITHOUT PERMISSION IN Classroom English 2 Introduction WRITING FROM MCGRAW HILL. Feelings 4 Unit 1 ISBN 9781398928183 Things We Wear 12 Unit 2 Series consultant Mayumi Tabuchi Judy MacDonald, Steve Longworth, Anne Tseng, Project manager Development editor Editor Things We Do 20 Unit 3 Alfonso Reyes, Kate Vandestadt, Peter Shaw Production manager Designer Design supervision Term 2 Beautiful Nature 28 Unit 4 Friends, Actions, Things 36 Unit 5 2023. Exclusive rights by McGrawHill Education UK Limited for manufacture and export. This book cannot be Wild Animals 4 Unit 6 reexported from the country to which it is sold by McGrawHill Education UK Limited. Photo Credits From Here to There 52 Unit 7 tTatweer Co. for Educational Services tcrEric IsseleeShutterstock, trAleksandr BryliaevAlamy Stock SB ii 18 Term 3 Photo, clLife on whiteAlamy Stock Photo, crLife on whiteAlamy, bclIan 2010Shutterstock, brJudith Collins Alamy Stock Photo blD. HurstAlamy Stock Photo, brvalzanShutterstock, insetLife on whiteAlamy Stock Photo 20 cSave nature and wildlifeShutterstock tloleksiy123RF, trLife on whiteAlamy Stock Photo, clAllan Swart 24 26 My House 60 Alamy Stock Photo, crD. HurstAlamy Stock Photo, blYAY Media ASAlamy, brEnjoylifeAlamy Stock Photo Unit 8 34 tlAleksandrs SamuilovsAlamy Stock Photo, trnathapol HPSShutterstock, clYAY Media ASAlamy, crSvetlana FooteAlamy, blChris ClorBlend Images, brLightField StudiosShutterstock llynx 41 cHolly HildrethMcGraw Hill, rIngram PublishingAlamy Stock Photo lr, tbAndrew Paul DeerShutterstock, 45 My Things 68 Unit 9 2Jan StriaShutterstock, 3DavesayitShutterstock, 4Tatiana GrozetskayaShutterstock, 5Vaclav Sebek Shutterstock, 6paula frenchShutterstock, 7davegkuglerShutterstock, 8Nick FoxShutterstock, 9Donovan van StadenShutterstock, 10fouroaks123RF, 11Glow Images, 12semue85Shutterstock, 13Panther Media GmbHAlamy My Day, Animals, Places 76 Unit 1 Stock Photo tbPix OneShutterstock, 2Fotos593Shutterstock, 3Chase SwiftGetty Images, 4Tom Reichner 46 Shutterstock, 5McGrawHill Education, 6SeregamShutterstock, 7Jan StriaShutterstock, 8Martin Strmiska Alamy Stock Photo, 9Elko TsuchiyaShutterstock lr, tbbigjom jomShutterstock, 2David CarilletShutterstock, 50 84 Phonics Practice 3Tatweer Co. for Educational Services, 4Alina ZamogilnykhShutterstock, 6 McGrawHill Education Tatweer Co. 56 for Educational Services lr, tbMoatassemShutterstock, 2Alexander ChaikinShutterstock, 3allexxandar123RF, 57 4Volodymyr DvornykShutterstock, 5AHMAD FAIZAL YAHYAShutterstock, 6Tatweer Co. for Educational Services, 102 Picture Dictionary 7dnavehShutterstock, 8Volodymyr DvornykShutterstock 1Aui MeesriShutterstock, 2MikbizShutterstock, 59 3Hannu LiivaarAlamy, 4Tom SagaShutterstock, 5vkstudioAlamy lr McGrawHill Education, 2pmozz 62 Shutterstock, 3George DoyleSuperStock, 4Irina NartovaShutterstock lrJames GathanyCDC, 2Punit Gupta, 64 10 Audio Track Lists 3ElenamivShutterstock, 4fam DubaiShutterstock lrGordana SermekShutterstock, 2ZurijetaShutterstock, 70 3zi30Shutterstock, 4MWermuthShutterstock lr, tbLana StemShutterstock, 2Lana StemShutterstock, 72 3FernandodiassShutterstock, 4Istvan CsakShutterstock, 5Istvan CsakShutterstock, 6Photoongraphy 15 Word Lists Shutterstock, 7Aakash BagchiShutterstock, 8Nor GalShutterstock, 9demidoffShutterstock Es sarawuth 73 Shutterstock lr, tbYuri ArcursDesignPics, 2Ruslan KudrinShutterstock, 3Radius ImagesImage Source, 74 4CosminIftodeShutterstock, 5BohbehShutterstock, 6Image Source clb71Shutterstock, clAmmar Rasheed 82 Shutterstock, clVladislav AshikhminAlamy Stock Vector crTarikdizShutterstock, bltiny windmillShutterstock, brtiny 18 Objectives windmillShutterstock clbaibazShutterstock tlOrlaShutterstock Tatweer Co. for Educational Services 90 91 96 98 cmkos83123RF, insetZurijetaShutterstock 1Chris ClorBlend Images insetLife on whiteAlamy Stock 104 106 Photo, 1Save nature and wildlifeShutterstock, 10valzanShutterstock 5Colorfuel StudioShutterstock 108 109 120 Workbook 11Colorfuel StudioShutterstock.", "Goal 70 My Things Words in Action I can ask Whats this? or What are these? I listened to days this week. Name Class 1 Listen, point, and practice. Whats this? Its an MP3 player. A B 1. What are these? Theyre MP3 players. A B 2. Whats this? Its a pencil. A B 3. What are these? Theyre pencils. A B 4. Whats this? Its a watch. A B 5. What are these? Theyre watches. A B 6. 2 Read and answer. Say and write. 1. Whats number 5? Its a. 2. Whats number 6? Theyre. 192", "Words in Action Fun Time! 1 Listen, point, and say. Watch out! Its a an 3 Take a Trip! Listen and trace with your finger from Where are each place to the next to complete you now? your trip. Where do you end up? 1. truck 2. bus 3. train A I R P O R T S P A C E S T A T I O N M O O N 4. motorbike 5. car 6. bicycle T R A I N S T A T I O N T A X I S T A N D H O S P I T A L 7. taxi 8. police car 9. ambulance Take a bus. 2 Practice the words in pairs. Then race your partner. S C H O O L H O M E I Can say the names of three vehicles. GOAL 53 tell someone two sentences like Take a bus. or Take a taxi. GOAL 54 Unit 7 Now go to page 95 56 57", "Goal 2 Things We Do Words in Action Goal 23 Things We Do Phonics I can say two things when asked What are you doing? I can tell if the words start with t or d. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Trace. Listen and practice. 2 Listen and circle t or d. What are you doing? 1. 2. 3. t or d t or d t or d Im eat ing 4. 5. 6. snacks. t or d t or d t or d 3 Write the missing letters t or d. Trace. Copy. oll iger Im playing 1. 2. football. elephone or 3. 4. Im wat ching TV. uck omat o 5. 6. Im doing nothing! 144 145", "Goal 32 Beautiful Nature Phonics I can say two words that begin with c and two words that begin with g. I listened to days this week. Name Class 1 Listen, point, and practice. Trace. cat cake 1. goat gorilla 2. cap cake 3. cap cat 4. goat girl 5. 2 Make the sounds. c c c c g g g g c c c g g g c c g g c g 154", "UUnniitt 66 Wild Animals Goal 40 Friends, Actions, Things Phonics I can ask and say whose something is using name's. Goal 41 Wild Animals Talk Time I listened to days this week. I can act out the talks about wild animals. Name Class I listened to days this week. Name Class 1 Listen and practice. Trace. Whose hat Maybe it's 1 Listen, point, and practice. Trace. is that? Noura's. Monkeys Look! Its a baby monkey. A B are cute! Let's ask her! Elephant s Look! Its an elephant. A 2 Ask and answer. Write. blouse cap dress Tshirt skirt sweater B are big! Noura 2 Draw a monkey and an elephant. Give them names that you like and write them. Faisal Whose skirt is this? It's Noura's. 1. monkey elephant 2. 3. 4. 5. Name Name 6. 162 163", "Goal 46 Wild Animals Words in Action Goal 47 Wild Animals Phonics I can play the Animal Two Hints Game. I can listen, point, and match pictures, words, and letters. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen to two hints and guess what the animals are. Listen, point, and match. Copy. 2 Write the animal names. 1. bread 1. 2. bus 3. cup 2. 4. cube 3. 5. peach 6. feather 4. 7. meat 5. 2 Read and draw. Hint Words book boot hippo crocodile chimpanzee elephant zebra 168 169", "Goal 42 Wild Animals Talk Time I can tell friends the names of six wild animals using the animal chart. I listened to days this week. Name Class 1 Listen, point, and practice. Trace. zebra 2. 1. giraffe 3. ostrich lion 4. 5. hyena 6. elephant hippo 8. 7. chimpanzee 9. rhinoceros koala 12. 10. snake 1. kangaroo tiger 15. 13. iguana 14. polar bear 2 Point to and say six animals that you like. 164", "CD 1 Audio Track List CD 2 Audio Track List Track Unit Student Book Section Track Unit Student Book Section Track Unit Student Book Section Track Unit Student Book Section 2 Intro Exercise 1. Listen and point 2 6 Exercise 1. Listen and point 31 8 Exercise 3. Listen, say, and match 29 3 Exercise 1. Listen and chant 3 1 Exercise 1. Listen and point 3 6 Exercise 4. Find the Animal 32 8 Exercise 3. Two Hands Game 30 3 Exercise 3. True or False Action Game 4 1 Exercise 4. Greeting Line 4 6 Exercise 1. Chant and mime 3 8 Exercise 1. Read and color 31 3 Exercise 1. Listen, point, and say 5 1 Exercise 1. Chant and do 5 6 Exercise 2. Listen, say, and match 34 8 Exercise 2. Listen and spell 32 3 Exercise 2. Listen, point, and say 6 1 Exercise 2. Listen, say, and match 6 6 Exercise 3. What Animal Is This? 35 8 Exercise 3. Speedreading 3 3 Exercise 3. Card Snap Game 7 1 Exercise 3. Confusion Game 7 6 Exercise 1. Listen, point, and say 36 9 Exercise 1. Listen and point 34 3 Exercise 1. Listen, read, and say 8 1 Exercise 1. Listen, point, and say 8 6 Exercise 3. Animal Two Hints Game 37 9 Exercise 4. Word Hunt 35 3 Exercise 2. Listen, number, and say 9 1 Exercise 3. Practice and do in pairs 9 6 Exercise 1. Listen, point, and say 38 9 Exercise 1. Chant and point 36 3 Exercise 3. Listen and touch the 10 1 Exercise 4. Same as the Leader 10 6 Exercise 2. Listen, point, and say 39 9 Exercise 2. Listen, say, and match right picture Game 1 6 Exercise 3. Listen, say, and match 40 9 Exercise 3. Borrowing Things Relay 37 4 Exercise 1. Listen and point 1 1 Exercise 1. Listen, point, and say 12 6 Exercise 4. Read and number 41 9 Exercise 1. Listen, point, and say 38 4 Exercise 3. Listen, point, and say 12 1 Exercise 2. Listen and number 13 6 Exercise 5. Phonics Race 42 9 Exercise 3. Pointing Race 39 4 Exercise 4. Find Something 13 1 Exercise 3. Listen, say, and match Beautiful! 14 7 Exercise 1. Listen and point 43 9 Exercise 1. Listen, say, and number 14 1 Exercise 4. Phonics Game 40 4 Exercise 1. Chant and march 15 7 Exercise 3. Listen, point, and say 4 9 Exercise 2. Read and color 15 2 Exercise 1. Listen and point 41 4 Exercise 2. Listen, say, and number 16 7 Exercise 4. Which Way Are You 45 9 Exercise 3. Find the numbers and Looking? draw lines 16 2 Exercise 3. Listen, point, and 42 4 Exercise 3. Months and Seasons number Chant 10 Exercise 1. Listen and say 17 7 Exercise 1. Chant and do the actions 46 17 2 Exercise 4. Whose... is This? 43 4 Exercise 1. Listen, point, and say 10 Exercise 4. Listen and number 47 18 7 Exercise 2. Listen, say, and number 18 2 Exercise 1. Chant and clap the 4 4 Exercise 4. Guess what it is 10 Exercise 6. Ask and answer in pairs 48 19 7 Exercise 3. Traffic Signal Game rhythm 45 4 Exercise 1. Listen, read, and say 10 Exercise 1. Listen, chant and match 49 20 7 Exercise 1. Listen, point, and say 19 2 Exercise 2. Listen, point, and say 46 4 Exercise 2. Listen, point, and say 10 Exercise 2. Listen, point, and circle 50 21 7 Exercise 2. Practice the words in 20 2 Exercise 3. Clothes Color Basket pairs 47 4 Exercise 3. Word Making Game 10 Exercise 3. Listen and chant 51 21 2 Exercise 1. Listen, point, and chant 2 7 Exercise 3. Take a Trip! 48 5 Exercise 1 Listen and say 10 Exercise 4. Talk about the weather 52 2 2 Exercise 3. Touch the screen 23 7 Exercise 1. Listen, say, and match 49 5 Exercise 3 Good morning! Chant 10 Exercise 1. Listen and practice 53 23 2 Exercise 1. Listen, read, and say 50 5 Exercise 1 Listen and chant 24 7 Exercise 2. Picture Puzzle 10 Exercise 2. Ask and answer 54 51 5 Exercise 3 Guess the Action Game 24 2 Exercise 2. Listen, say, and match 25 8 Exercise 1. Listen and point 10 Exercise 3. Listen and match 5 52 5 Exercise 1 Point and chant 25 2 Exercise 3. Does It Move? 26 8 Exercise 4. An Old House 53 5 Exercise 3 The 3 Questions Game 10 Exercise 4. Guess who 56 26 3 Exercise 1. Listen and point 27 8 Exercise 1. Chant and point 54 5 Exercise 1 Listen and check 10 Exercise 1. Listen, point, and say 57 27 3 Exercise 3. Listen, say, and match 5 5 Exercise 2 Listen and check 28 8 Exercise 2. Listen, say, and match 10 Exercise 2. Listen, point, and say 58 28 3 Exercise 4. Telephone Conversation 56 5 Exercise 4 Whose is that? 29 8 Exercise 3. Where? Relay 10 Exercise 4. Listen, find, and write 59 30 8 Exercise 1. Listen, point, and say 10 Exercise 5. Listen, read, and circle 60 10 11", "Goal 6 Feelings Words in Action Goal 7 Feelings Phonics I can ask a friend Whats the matter? I can listen and point at the right pictures and words. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Trace. Listen, point at the pictures and words, and say. Whats the matter? A apple cap tap hat Im cold. B cat apron cape tape Im sleepy. B Im hot. B cake vase face ink pin Tim iron pine time Im hungry. B 2 Write the missing letters and read. Im scared. B p t ron pl c c 2 Unscramble the words. p k n pr n c c p 1. l o c d p v s n t p 2. r n h g u y p f c m t T 3. y e e l p s h t nk m t 4. o t h 128 129", "Phonics Fun Time! 1 Read and color o and u. 3 Speedreading Story Ox The Make pairs. Read together and clap. dot nut had He boox. a on sat ox An not but hot cut hoot. was He suun. the in fuun tree. a uunder sat He ox sun hoot. fox fun noot was he Then box run 2 Listen and spell. I Can ox ox? 1. How do you spell say the spelling of two threeletter words. GOAL 63 box box? 2. How do you spell read the threeletter word speedreading list fun by myself. fun? 3. How do you spell GOAL 64 sun Advice Time sun? 4. How do you spell hot hot? 5. How do you spell You can buy a house but not a home. not not? 6. How do you spell Unit 8 Now go to page 9 6 67", "SyllabusSyllabus Unit and Topic Talk Time Rhythms and Listening Good morning. Welcome to class. Lets Introduction play a game. Good idea! Watch me. Make pairs. Okay. Lets start! Yeah! Okay! Stop! Are you ready? Lets do it again. One more time. Please listen to me. Wow! Good job! Lets finish. You were great! Goodbye. Term 1 Hello. Hi. Its nice to meet you. Its nice to Chant If Youre Happy and 1 Feelings meet you, too. How are you? You Know It Im great, thanks. And you? Im fine. Clap your hands. Stamp your foot. Nod your head. Snap your fingers. Thump your chest. Wow! I like your hat. Thank you. Whose Chant Who is Wearing Green? 2 Things We Wear hat is this? Its not mine. Its mine. Thank I am wearing green today. Look at you. Youre welcome. me. I am. Im not. Color review Hello. Can I speak to Joe? Speaking. Chant What Are You Doing? 3 Things We Do What are you doing? Im watching TV. Im doing karate. Im playing And you? Im eating snacks. football. Term 2 Look! Its a snake, plastic bag. Its short Chant I Love the Mountains 4 Beautiful Nature long, beautiful ugly. Look at the beautiful I love the mountains, rolling hills, flowers, daffodils, campfire when all the stars are out. Good morning Ali. Wheres Jake? He Chant Were playing, were cycling 5 Friends, Actions, Things cant come. Hes helping his brother. Our friends are laughing, jump This is my friend Omar. Nice to meet you ing, cycling as happy as can be! Omar! Nice to meet you, too! Ready? His friend is walking, talking, not Lets go to the new computer store! cycling Are you they playing, cy Chant Good morning! Chant cling? Were not playing, theyre Good morning afternoon evening! not cycling Goodnight! iv", "3 2 2 mreT mreT Word List Word List Airport p 57 Hat p 43, 91 Smile p 30 Airport p 80 Living room p 60, 61 Twenty p 68 Ambulance p 56 Hills p 30 Snake p 28, 30, 4, 46, 48, 51, Architect p 80 MP3 player p 72 Under p 64, 65, 6 Beautiful p 28, 29 Hippo p 45, 48, 51 91 Astronaut p 80 Next to p 64, 65, 83 Wallet p 72 Bicycle p 56 Hospital p 57 Snow p 28 Bathroom p 61, 63 Ninety p 75 Watch p 72 Big p 32, 3, 41 Hot p 40, 41 Sour p 40, 41 Bedroom p 61 On p 64, 65, 6, 70, 71 Yard p 62 Bread p 50 Kangaroo p 45, 94 Space station p 57 Behind p 64, 65, 83 Ostrich p 78 Bus p 50, 52, 56, 57 Koala p 45 Spring p 31 Bread p 97 Paper p 70 Campfire p 30 Laughing p 38 Stars p 30 Bus p 83, 100 Pencils p 70 Cap p 34 Legs p 48 Stop p 53, 54, 5 Candy p 68, 69, 70 Pens p 70 Car p 56 Lion p 4, 45, 47 Stripes p 48 Chew p 78 Pilot p 80 Cats p 30 Long p 28, 32 Strong p 32 Cloud p 64 Play p 76 Chimpanzees p 48 Meat p 50 Summer p 31 Comic book p 72 Polar bear p 78 Chip p 40, 54 Monkey p 4, 46 Sweet p 40, 41 Cook p 80 Present p 62 Cloud p 95 Moon p 50 Tail p 46 Crush p 78 Prize p 62 Cold p 40, 41 Motorbike p 56 Tasty p 40, 41 Dining room p 61 Quick! p 63 Cook p 50, 94 Mountains p 30, 31 Tap p 91 Crab p 34 Mouths p 48 Tape p 91 Dive p 78 Row p 69 Crocodile p 48, 51 Noisy p 32 Taxi p 56, 57 Eat lunch p 76, 7 School p 7, 83 Crush p 95 Orange p 41, 42 Taxi stand p 57 Eighty p 75 Scissors p 70, 71 Cube p 50, 51 Peach p 50, 51 Teeth p 48 Feather p 78 Seventy p 75 Cycling p 38, 39 Plant p 58, 59 These p 51 Fifty p 75 Shake p 101 Daffodils p 30 Plastic p 28, 29 This p 30, 36, 37, 47 Firefighter p 80 Ship p 98 Dress p 30 Police car p 56 Tiger p 46 Flag p 100 Sixty p 75 Excuse me. p 52 Quiet p 32 Train p 52, 56 Fly p 78 Smile p 70, 9 Fall p 31 Red light p 54, 5 Train station p 52, 57 Forty p 75 Snail p 70, 9 Feather p 50 Rhino p 45 Truck p 56 Fox p 67, 74 Spider p 74 Flag p 58, 59, 96 Rocket p 57 Trunk p 46, 48, 49, 51 Fries p 62 Stop p 9 Flower p 29, 30, 31 Rolling hills p 30 Ugly p 28, 29 Frog p 62, 100 Swan p 74, 100 Fox p 46 Rope p 46 Watching TV p 39 Front door p 61 Swim p 78, 9 Giraffe p 45 Rose p 46, 51 Wait p 54, 5 Get up p 76, 7 Swing p 74 Glass p 34 Salty p 40, 41 Winter p 31 Glue p 70, 101 Table p 64, 83 Go p 52, 54 School p 52, 57, 94 Yellow light p 54 Good afternoon! p 37 Sheep p 54 Zebra p 45,48 Here you go. p 68, 71 Taxi p 101 Good evening! p 37 Ship p 54 Hurry up! p 63 Teeth p 82 Good morning! p 36, 37 Short p 28, 32 I'll show you around. p 60 These p 72, 73 Goodnight! p 37 Show p 28 In p 64, 65, 6 Thirty p 68, 69 Gorilla p 34 Sky p 30 Kangaroo p 78 This p 60, 72, 73, 82 Grass p 34 Slip p 54 Kitchen p 61 Train p 83 Gray p 3 Small p 32, 3, 41 Let's count them. p 68 Train station p 83 Green light p 54 Smart p 48 16 17", "Grammar Toolbox Fun Time! He's She's playing We're You're They're playing He's not She's not cycling 3 Choose a place. Ask and We're not You're not They're not answer. playing Where is he? He's at home. Is he sitting? Yes, he is. Is he playing? No, he isn't. Is he watching TV? Y es, he is. Now it's my turn! 2. Jim and 1. Pete 3. Joe 4. Sabah 5. Noura Ken at school at home in his room in her room in the classroom I Can talk about what I'm, heshe's, weyou they're doing or not doing. GOAL 35 ask and answer Yes No questions about what people are doing. GOAL 36 Unit 5 39", "small p32 snake p28 snow p28 space station speaking p20 spring p31 p57 stop p54 strong p32 summer p31 table p64 tail p46 tap p10 108", "Goal 6 My Things Talk Time Goal 67 My Things Rhythms and Listening I can count from one to thirty. I can chant the Things on My Desk chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Listen, chant, and point. Lets count them. B Then write the missing 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, and pencils, Pens 1, 12, 13, 14, 15, 16, 17, numbers on the candy. 18, 19, 20, 21, 2, 23, 24, and pencils. Pens How many are there? A 25, 26, 27, 28, 29, 30. and glue, Paper and glue. Paper and erasers, Scissors Thats a lot. A and erasers. Scissors 8 for you. Candy 2 4 5 3 7 1 for you. Candy 6 14 9 12 13 10 2 1 Chant by yourself and write the missing letters. 15 16 17 20 e g s p a i c l y 19 18 2 Say and write 30 to 1. 30 29 p n encil p p r ue sc ssor and 188 189", "Term 2 Phonics Practice Words with s ending Words with bl, pl Consonant Blends Listen, point, and say. Listen, point, and say. Write bl or pl. 1 1 s z z pl bl ouse ane carrot pizza pizzas orange carrots oranges Look at the pictures and match with bl or pl. 2 Q Listen, check, and write. Look at the picture, write the word, and check the 2 sound. Then listen and check your answers. 2. s z z s z z 1. 3. 5. 1. apples bl pl s z z s z z 6. 4. 6. 2. 5. s z z s z z 7. 3. 1 pl ate ack ay s z z s z z ane ue ouse 4. 8. 92 93", "Term 1 Phonics Practice Phonics Jingle S s T U u Listen and chant. 1 sun tiger umbrella Listen and point to the letters, then the pictures. 2 V v W w X x vase wolf fox A a B b C c apple bear cow Y y Z z yard zebra D d E e F f duck egg fish Unscramble the letters and write the words. 3 G g H h I i rbea b goat hat ink dkcu d otag g J j K k L l iwki k jet kiwi lion ykemno m M m N n O o rtapro p nest octopus monkey itrbab r greti t P p Q q R r lubrleam u parrot quilt rabbit bazre z 85 84", "2. SPB from Boy 1 Hello, Hashim. UUnniitt 55 Friends, Actions, Things SPB from Boy2 Good morning Ali. Where's Jake? SPB from Boy 1 He cant come. Hes helping his brother. AW Three boys, 2 boys from the AW above, with Boy 2 in the Talk Time foreground, gesturing towards a third boy standing by, waiting in the first AW to introduce him to his friend 1 Listen and say. NEW AW Please modify the AW of two boys shaking hands, from Good morning Ali.", "Phonics 1 Listen, point and say. Write ea or e. e ea ea sleep read head sh p m t br d 2 Listen, point, and say. Look at this picture. There is a man, a woman and a child. Its a small family. In this picture, there are three men, three women, and five children. Whats that? What are those? Its a tooth. Theyre teeth. 3 Ask and answer in pairs. Use that or those. 82", "on p64 ostrich p45 paper p70 pencils p70 pens p70 photo p20 playing computer pine p10 plate p18 games p24 playing football police car p56 quiet p32 p24 106", "UUnniitt 77 From Here to There Fun Time! Talk Time Excuse me. Wheres 4 Which Way Are You Looking? the train station? Close your eyes and try to follow. 1 Listen and point. Close your eyes! Walk straight Turn left! Turn left! and turn left. Walk straight three steps. Turn right! How do you go to school? I walk. How about you? I go by school bus. We cant see! 2 Practice and act out the talks in pairs. 3 Listen, point, and say. Then write the missing letters. I Can station st ep st op eps Walk straight two act out the talks about directions and and op! going places with a partner. GOAL 49 give directions to a partner, saying Turn left., Turn right., and Walk straight. GOAL 50 Unit 2 52 53", "UUnniitt 1100 My Day, Animals, Places Goal 72 My Things Phonics I can count from 40 to 100. Goal 73 My Day, Animals, Places Talk Time I listened to days this week. I can ask my friend questions about his her day and get an answer. Name Class I listened to days this week. Name Class 1 Listen and connect the numbers. 1 Listen, point, and practice. Trace. 5 80 71 50 63 I get up at Tell me about your day! 6 oclock. What time do you eat lunch? 68 49 60 85 72 At 2.00 oclock. Then I do my homework. 86 7 89 64 79 Do you watch TV Yes, I do. in the evening? I play with my 70 59 90 8 100 friends. What do you do on Saturday? 2 Listen and circle the correct number. 2 Read and answer. A. 35 36 B. 42 52 1. Do you walk to school in the morning? C. 63 6 D. 78 98 2. Do you do your homework in the morning? E. 64 84 F. 92 82 194 195", "Goal 64 My House Phonics I can read the threeletter word speedreading list by myself. I listened to days this week. Name Class 1 Listen and read. No.1 No.2 sun nut ox dot fun but fox not run cut box hot 2 Draw lines and connect the family words. hot cut ox nut dot but fox box not 186", "Unit 5 Friends, Actions, Things Goal 32 Beautiful Nature Phonics I can say two words that begin with c and two words that begin with g. Goal 3 Friends, Actions, Things Talk Time I listened to days this week. I can introduce someone, say This is my friend , and Let's . ! Name Class I listened to days this week. Name Class 1 Listen, point, and practice. Trace. c a cta t c a ckaeke 1 Listen and practice. 1. Hello, Hashim. g o gaotat g o griollari la Good morning Ali. 2. Where's Jake? c a cpap c a ckaek e 3. He can't come. He's helping his brother. c a cpap c a cta t 4. This is my friend, Omar. lg o gaotat girgl ir Nice to meet you Omar. 5. Nice to meet you too. 2 Make the sounds. c c c c g g g g c c c g g g c c g g c g Ready? Let's go to the new computer store! 154 155", "Phonics Fun Time! Sounds and Letters 2 Picture Puzzle 1 Listen, say, and match. Then write the missing letters. Write five words from the photos. 1. b 2. b 3. p 4. c 5. b bl cl fl gl pl 1 1 1. ack 2. ass 3. ag 4. ant 1 5. ock 6. ue 7. y 8. ate I Can Advice Time listen, point, and match pictures, words, and GOAL 5 letters. Ask and youll never be lost. say, read, and write the sounds for bl, black cl, clock fl, flag gl, glass pl, plant. GOAL 56 Unit 7 Now go to page 96 58 59", "Rhythms and Listening 1 Listen and chant. We're playing, we're cycling Our friends are here and laughing They're jumping, they're cycling As happy as can be! There's Omar, he's walking His friend, Ali is talking He's laughing, he's not cycling As happy as can be! Are you playing, are they cycling? We're not playing, they're not cycling We're talking, we're walking As happy as can be! 2 Change the words and chant. Advice Time Help a friend in need. 38", "Handwriting Practice Phonics Key Words Read and say. 1 Trace and copy. 2 apple apple apple bear cow duck egg fish 86", "Phonics 1 Listen, point, and say. and A says a, a, A says a, a, apple apron a ae cap tap cape tape 2 Listen and number 1 for a and 2 for ae. Then say. 1 3 Listen, say, and match. I says i, i, ink and I says i, i, iron ink Tim iron pine pin time 10", "3 mreT UUnniitt 88 My House Goal 56 From Here to There Phonics I can say, read, and write the sounds for bl, black cl, clock fl, flag Goal 57 My House Talk Time gl, glass pl, plant. I can act out the talks about showing around the house with a partner. I listened to days this week. I listened to days this week. Name Class Name Class 1 Listen and write the words. 1 Listen, point, and practice. 1. Its a. Welcome to our Ill show you around. Hello. A B house. Would you B like to come in? 2. Its a. Thanks. A 3. Its a. This is the B Yes, please. A living room. 2 Write the missing letters. 2 Write the words. bl gl fl cl pl 1. This is our. 2. This is our. 3. This is our. 1. ack 2. ue 3. ock 4. This is our. Hint Words living room bathroom kitchen bedroom 4. ag 5. ate 6. y 178 179", "Rhythms and Listening Fun Time! 1 Chant and point. 3 Borrowing Things Relay Things on My Desk Can I use your scissors? Ask to borrow things. Pens and pencils, Here you go. Pens and pencils. Paper and glue, Paper and glue. Scissors and erasers, Can I use Scissors and erasers. Here you go. your eraser? Candy for you, Candy for you. Sounds and Letters Listen, say, and match. Then write the missing 2 Lets do it again! letters. I Can GOAL 67 chant the Things on My Desk chant. smile snail small snack ask to borrow some things in class. ails are all and quiet. GOAL 68 Unit 9 70 71", "Words in Action Fun Time! 1 Listen, point, and say. Watch out! Its a an 3 Take a Trip! Listen and trace with your finger from Where are each place to the next to complete you now? your trip. Where do you end up? 1. truck 2. bus 3. train A I R P O R T S P A C E S T A T I O N M O O N 4. motorbike 5. car 6. bicycle H O S P I T A L T R A I N S T A T I O N T A X I S T A N D 7. taxi 8. police car 9. ambulance Take a bus. 2 Practice the words in pairs. Then race your partner. H O M E S C H O O L I Can say the names of three vehicles. GOAL 53 tell someone two sentences like Take a bus. or Take a taxi. GOAL 54 Unit 7 Now go to page 95 56 57", "We Can! Students Book 2 We Can! Copyright 2009 by McGrawHill Education Adaptation Copyright 2023 by McGrawHill Education UK Limited Published by arrangement with McGraw Hill LC ALL RIGHTS RESERVED. NO PART OF THIS BOOK MAY BE REPRODUCED OR TRANSMITTED IN ANY FORM OR BY ANY MEANS, ELECTRONIC OR MECHANICAL, INCLUDING PHOTOCOPYING, RECORDING OR BY INFORMATION STORAGE AND RETRIEVAL SYSTEMS, WITHOUT PERMISSION IN WRITING FROM MCGRAW HILL. ISBN 9781398928183 Series consultant Mayumi Tabuchi Judy MacDonald, Steve Longworth, Anne Tseng, Project manager Development editor Editor Alfonso Reyes, Kate Vandestadt, Vandestadt Design, Peter Shaw Production manager Designer Design supervision 2023. Exclusive rights by McGrawHill Education UK Limited for manufacture and export. This book cannot be reexported from the country to which it is sold by McGrawHill Education UK Limited. Photo Credits crKatsiaryna DrobyshevaShutterstock tlLev KropotovAlamy, brAnton StarikovAlamy Stock Photo WB 125 135 5Save nature and wildlifeShutterstock clBogdan FloreaShutterstock, crLuXpicsShutterstock 143 146 166 blStephen McsweenyShutterstock, bcShawn Mahoney, brPaul HenningImage Source, 1Shawn Mahoney, 2Ondrej ProsickyShutterstock, 3Paul HenningImage Source lr, tbDmytro GilitukhaShutterstock, 2paula 167 frenchShutterstock, 3WorraketShutterstock, 4Radek BorovkaShutterstock, 5Ronnie HowardShutterstock lr, tbSerhii BrovkoShutterstock, 2David CarilletShutterstock, 3McGrawHill Education, 4Vibrant Image 170 StudioShutterstock, 5AkugasahagyShutterstock, 6Tewin KijthamrongworakulAlamy Stock Photo, 7bigjom jom Shutterstock, 8Tatweer Co. for Educational Services 1WhitevectorShutterstock, 2Sony HerdianaShutterstock, 175 3SaudiArabiaPhotographyShutterstock, 4Alexander KondratenkoShutterstock, 5iofotoShutterstock, 6Tatweer Co. for Educational Services 1MikbizShutterstock, 2vkstudioAlamy, 3Hannu LiivaarAlamy 1David 178 180 PapazianShutterstock, 2 3PeshkovaShutterstock, 4 5Interior DesignShutterstock, 6Africa StudioShutterstock, 7JOATShutterstock 1PhotobacShutterstock, 183 2Miroslav PesekShutterstock, 3 4AvaniksShutterstock, 5 Shutterstock, 6Juris KraulisShutterstock 1chalrumpon onnongwaShutterstock, 2PicsfiveShutterstock, 190 3McGrawHill Education, 4Mark Steinmetz, 5ChameleonsEyeShutterstock trKoya979Shutterstock, clLana 191 StemShutterstock, blKoya979Shutterstock, blFernandodiassShutterstock clTarikdizShutterstock, crb71 201 Shutterstock, crAmmar RasheedShutterstock, crVladislav AshikhminAlamy Stock Vector, 5tiny windmillShutterstock, 6tiny windmillShutterstock.", "Words in Action Fun Time! 1 Listen, point, and say. 3 Two Hands Game mouse on chair. The is the Listen and move your hands. mouse in cupboard. The is the mouse under bed. The is the on in under mouse next to fridge. The is the mouse behind table. The is the Sounds and Letters next to behind 2 Listen, say, and match. Then write the missing letters. I Can GOAL 61 cloud mouse house mountain say the names of three pieces of furniture. play the Two Hands Game. se is in the h se. The m GOAL 62 Unit 8 Now go to page 98 64 65", "CD 1 Audio Track List Track Unit Student Book Section Track Unit Student Book Section 2 Intro Exercise 1. Listen and point 29 3 Exercise 1. Listen and chant 3 1 Exercise 1. Listen and point 30 3 Exercise 3. True or False Action Game 4 1 Exercise 4. Greeting Line 31 3 Exercise 1. Listen, point, and say 5 1 Exercise 1. Chant and do 32 3 Exercise 2. Listen, point, and say 6 1 Exercise 2. Listen, say, and match 3 3 Exercise 3. Card Snap Game 7 1 Exercise 3. Confusion Game 34 3 Exercise 1. Listen, read, and say 8 1 Exercise 1. Listen, point, and say 35 3 Exercise 2. Listen, number, and say 9 1 Exercise 3. Practice and do in pairs 36 3 Exercise 3. Listen and touch the 10 1 Exercise 4. Same as the Leader right picture Game 37 4 Exercise 1. Listen and point 1 1 Exercise 1. Listen, point, and say 38 4 Exercise 3. Listen, point, and say 12 1 Exercise 2. Listen and number 39 4 Exercise 4. Find Something 13 1 Exercise 3. Listen, say, and match Beautiful! 14 1 Exercise 4. Phonics Game 40 4 Exercise 1. Chant and march 15 2 Exercise 1. Listen and point 41 4 Exercise 2. Listen, say, and number 16 2 Exercise 3. Listen, point, and 42 4 Exercise 3. Months and Seasons number Chant 17 2 Exercise 4. Whose... is This? 43 4 Exercise 1. Listen, point, and say 18 2 Exercise 1. Chant and clap the 4 4 Exercise 4. Guess what it is rhythm 45 4 Exercise 1. Listen, read, and say 19 2 Exercise 2. Listen, point, and say 46 4 Exercise 2. Listen, point, and say 20 2 Exercise 3. Clothes Color Basket 47 4 Exercise 3. Word Making Game 21 2 Exercise 1. Listen, point, and chant 48 5 Exercise 1 Listen and say 2 2 Exercise 3. Touch the screen 49 5 Exercise 3 Good morning! Chant 23 2 Exercise 1. Listen, read, and say 50 5 Exercise 1 Listen and chant 51 5 Exercise 3 Guess the Action Game 24 2 Exercise 2. Listen, say, and match 52 5 Exercise 1 Point and chant 25 2 Exercise 3. Does It Move? 53 5 Exercise 3 The 3 Questions Game 26 3 Exercise 1. Listen and point 54 5 Exercise 1 Listen and check 27 3 Exercise 3. Listen, say, and match 5 5 Exercise 2 Listen and check 28 3 Exercise 4. Telephone Conversation 56 5 Exercise 4 Whose is that? 10", "SyllabusSyllabus Words in Action Phonics Phonics Practice Unit and Topic Talk Time Rhythms and Listening Elephants are big, have trunks. Zebras are Longshort vowels Words with s ending Look! Its a baby monkey, an elephant. Mon Chant Animal Chant 6 Wild Animals black and white, have stripes. Crocodiles o and oe, u and ue, o, ea Words with bl, pl Consonant keys are cute. Elephants are big. Wheres the I will catch a monkey, elephant, tiger, are scary, have big teeth. Chimpanzees octopus, fox, rose, rope Blends lion, snake? snake, bear by the toes, tail, nose. are smart, have long arms. Snakes are cup, bus, duck, cube, huge, uniform Its over there. Its here. Sounds monkey, elephant, tiger, snake, long, have no arms or legs. Hippos are fat, book, foot, cook, food, boot, moon bear have big mouths. head, bread, feather, peach, meat, bread Final s hippos, crocodiles, snakes, elephants, dresses, faces Watch out! Its a an truck, bus, train, Consonant clustersblends Words with short and long o Excuse me. Wheres the train station? Walk Chant When You See a Red Light 7 From Here to There motorbike, car, bicycle, taxi, police car, st, sl, bl, cl, fl, gl, pl Words with gr, gl and cr, cl straight and turn left. How do you go to red, yellow, green, stop, wait, go ambulance. station, step, stop, sleep, slip, black, blue, Words with fl, fr and dr, tr school? I walk. How about you? I go by taxi stand, hospital, school, train station, class, clock, plant, plate, glass, glue, flag, fly school bus. airport, space station, moon Consonant digraphs sh, ch ship, sheep, chip, cheese Term 3 Term 3 The mouse is on, in, under, next to, behind Consonant clustersblends Words with br, pr Hello. Welcome to our house. Would you like Chant Wheres the Boy? 8 My House the chair, cupboard, bed, fridge, table. pr, fr, Words with wh, w, h, and ph to come in? Yes, please. Ill show you around. Wheres Ali, mother, the boy? In the prize, present, fries, frog Words with sm, sn and st, sl Thanks. This is the living room. bathroom, kitchen, dining room, yard, Diphthongs bedroom. oumountain, cloud, mouse, house Short vowels o, u dot, not, hot, ox, fox, box, nut, but, cut, sun, fun, run Whats this? What are these? Its a Theyre Consonant clustersblends Words with bl, br, fl, fr, cl, cr, dr Can I have some candy? Sure. Here you go. Chant Things on My Desk 9 My Things computer games, comic books, music sm, sn, sp, sw Long vowel sounds Great! Thanks. How many are there? Lets pens, pencils, paper, glue, scissors, eras players, cell phones, wallets, watches. smile, small, snail, snack, spider, spring, count them. Numbers 1100. ers, candy sport, sweater, swing, swan Thats a lot. Vowels a, e, i, o, u fat, cat, sat, mat, hen, pen, in, on, fox, box, bug, rug. Does he work in an office? Yes, he does. Long Vowels Tell me about your day! I get up at 6 oclock. Chant Which animal is it? 10 My Day, Animals, Places e, ea ea No, he doesnt. Is he an architect, astro What time do you eat lunch? At 2.00 oclock. Its jaws are huge. Their skin is green sleep, read, head, sheep, meat, bread naut, a businessman, computer techni Then I do my homework. Do you watch TV Can ostriches run? Yes, they can. Irregular plurals cian, cook, doctor, farmer, firefighter, pilot, in the evening? Yes, I do. What do you do on Can they fly? No, they cant. man men, woman women, child children, teacher? Yes, he is. No, he isnt. Saturday? I play with my friends. Ostriches can run but they cant fly! foot feet, mouse mice Heshe has short brown hair, long hair, Sunday, Monday, Wednesday, Thursday, sunny, cloudy, rainy, snowy next to, opposite, between, near, on brown eyes, short blond hair. HeShe is tall Friday, Saturday. short. vi vii", "Phonics 1 Listen, read, and say. C and G Jingles C says c, c, cat. says c, c, cake. says c, c, cap. G says g, g, goat. says g, g, gorilla. says g, g, girl. Sounds and Letters 2 Listen, point, and say. Write gr, cr, gl, or cl. ass ab ass ass 34", "Goal 10 Things We Wear Talk Time I can meet someone and say I like your... I listened to days this week. Name Class 1 Listen, point, and practice. Trace. I like A your hat. Thank you. B I like your A Tshirt. Thank you. B I like your A jacket. Thank you. B 2 Listen and point. Its not mine. Its my hat. 132", "Goal 70 My Things Words in Action Goal 71 My Things Phonics I can ask Whats this? or What are these? I can read the story A Funny Day by myself. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Listen and read. No.1 No.2 Whats this? Its an MP3 player. A B 1. bug hen box mat 10 rug ten fox bat What are these? Theyre MP3 players. A B 2. mug pen ox cat Whats this? Its a pencil. A B 3. 2 Write the missing words in the trains. What are these? Theyre pencils. A B 4. mat cat 1. Whats this? Its a watch. A B 5. hen ten 2. What are these? Theyre watches. A B 6. 2 Read and answer. Say and write. 1. Whats number 5? Its a. rug mug 3. 2. Whats number 6? Theyre. 192 193", "UUnniitt 77 From Here to There Goal 48 Wild Animals Phonics I can say, read, and write the sounds for ea, peach and ea, head Goal 49 From Here to There Talk Time u, duck ue, cube o, book and o, boot by myself. I can act out the talks about directions and going places with I listened to days this week. a partner. Name Class I listened to days this week. Name Class 1 ListenL iastnedn warnidte w thriete thisesi nmgi slseinttge rlse. tters. m 1 Listen, point, and practice. Trace. 1. r s m n 2. Excuse me. Wheres A the train station? 3. 4. f x b s Walk straight B and turn left. 5. 6. b k c b 2 Find the words in your book and copy them. 1. Thanks. A How do you 2. I walk. How A B go to school? about you? 3. I go by 4. A school bus. 5. 170 171", "1 mreT UUnniitt 11 Feelings Fun Time! Talk Time Hi. Its nice Hello! 4 Greeting Line to meet you. Talk to the teacher and leader. 1 Listen and point. Hi. How are you? Hello! Im Hi! first! Im great, thanks. And you? Its nice to How are you? meet you, too. Im great! Im second! Im third! Im fourth! Im fine. Im fifth! 2 Practice the talks in pairs. 1. Use lots of facial 3 Act out the talks in pairs. Im finished! expressions, like Hi. Its nice big smiles. to meet you. Hello! 2. Use your body to make gestures. I Can 3. Talk with a strong voice. GOAL 01 4. Keep eye greet my teacher and ask How are you? contact when you speak to say Im first, second, third someone. GOAL 02 Unit 1 4 5", "Rhythms and Listening 1 Chant and point. Things on My Desk Pens and pencils, Pens and pencils. Paper and glue, Paper and glue. Scissors and erasers, Scissors and erasers. Candy for you, Candy for you. Sounds and Letters Listen, say, and match. Then write the missing 2 letters. smile snail small snack ails are all and quiet. 70", "Phonics 1 Listen and check. Say. s z z s z z 1. 4. s z z s z z 2. 5. s z z s z z 3. 6. What's in your bag? 2 Listen, point, and say. Do you have apples? No, I don't. Do you have Yes, I do. sandwiches? Do you have orange juice? Yes, I do. and She has sandwiches orange juice. but She has orange juice she doesn't have apples. Ask your friend. Check YES or NO. 3 Food YES NO School things YES NO apples books sandwiches notebooks orange juice a poster carrots pens Say and write. Use or but. and 42", "Goal 30 Beautiful Nature Words in Action I can describe and guess what or who. I listened to days this week. Name Class 1 Listen, point, and practice. Its long. Its short. Its big. Its small. 2 Listen, read, and match. Its small Its big and A B and gray. strong. Its small Its small C D and noisy. and quiet. 152", "Rhythms and Listening 1 Chant and clap the rhythm. Who is Wearing Green? Green, green, green, green. Who is wearing green today? Green, green, green, green. Who is wearing green? I am wearing green today. Look at me, And you will see, That I am wearing green today. Sounds and Letters 2 Listen, point, and say. Then write the missing letters. green grass ass is een. Its eat! The 14", "Words in Action Whats the matter? 1 Listen, point, and say. 1. 2. Im hungry. Im thirsty. 3. 4. Im hot. Im cold. 5. 6. Im sleepy. Im scared. 2 Listen and do. 3 Practice and do in pairs. Whats the matter? Im hungry. 8", "Goal 36 Friends, Actions, Things Rhythms and Goal 37 Friends, Actions, Things Words in Action Listening I can talk about food using the words hot, cold, sour, sweet, salty, tasty I listened to I can ask and answer Yes No questions about what people are doing days this week. Name Class I listened to days this week. Name Class 1 Listen and chant. Trace and write. 1 Listen and practice. Trace. Apples are sweet! Lemons are sour, Cherries are ! Where is he? He's at home. They're not. My soup is hot! Is he sitting? Yes, he is. Icecream is cold, Is he playing? No, he isn't. Rice is, It's not. Yes, he is. Now Chips are salty, Is he watching TV? it's my turn! And they're tasty! 2 Ask and answer. Write. Let's eat! reading standing Is he reading? 2 Write about food. Use these words. 1. 3. ? No, he isn't. tasty sweet sour salty hot cold 1. Lemons are. 2. Sandwiches are. running watching TV 3. Cookies. 2. ? 4. ? 4. Kabsa is. 158 159", "Goal 78 My Day, Animals, Places Words in Action I can talk about someones appearance using have, has. I listened to days this week. Name Class 1 Listen, read, and number. He has short, brown hair and brown eyes. Hes wearing a thobe and speaking with his friend. He has short, blond hair and blue eyes. Hes wearing a blue Tshirt. She has long, brown hair and brown eyes. Shes wearing a jacket, a Tshirt and a long skirt. She has short black hair and brown eyes. Shes wearing a jacket, a Tshirt, a long skirt, and pink shoes. 2 Read and answer about a friend. 1. Whats hisher name? 2. Is heshe tall or short? 3. Does heshe have long or short hair? 4. Whats heshe wearing? 5. Whats heshe doing? 200", "glasses p17 glue p70 go p54 gorilla p34 grass p34 green light p54 hippo p48 hospital p57 hot p8 hungry p8 in p64 iron p10 104", "Term 3 Phonics Practice Words with wh, w, h, and ph Words with sm, sn and st, sl Listen, point, and say. Listen, point, and say. 1 1 wh wh ph sn w sm st sl h ? walk whale hose whose phone smile snail stop slot Listen and circle the silent letter. Listen and circle sm, sn, st, or sl. Then write and 2 2 wh wh wh silent silent silent match with the right picture. 1. where w h 3. who w h 5. whales w h snorkel sn sm sn st sl 1. orkel 2. what w h 4. whose w h 6. white w h sm sn st sl 2. ot Listen, circle, and write. 3 1 sm sn st sl 3. fir shop ship whale cherry phone whistle photo white sm sn st sl 4. ep sm sn st sl 5. ile ph wh wh ph 1. 5. sm sn st sl 6. icker whale Listen, point, and say. Then say and mime. ph sh sh wh 3 2. 6. An eel, a shellfish, Swim and snorkel, ch wh ch sh I stop and touch Watch the fish. 3. 7. And try to catch Starfish, shellfish Snap! Snap! Ouch! a small red crab! Any fish you wish! wh ph ch ph 4. 8. 98 9", "Words in Action 1 Listen and practice. Match words and pictures. astronaut architect pilot cook technician doctor teacher computer farmer firefighter businessman 2 Ask and answer. Guess. Does he work in Yes, he does. an office? No, he isnt. Is he an architect? No, he isnt. Is he a technician? Hes a businessman. I give up! What does he do? Grammar Toolbox What does he she do? He Shes a teacher. Does he she work in an office? Yes, he she does. No, he she doesnt. He She works doesnt work at the airport. 80", "We Can! Students Book 2 We Can! Copyright 2009 by McGrawHill Education Adaptation Copyright 2023 by McGrawHill Education UK Limited Published by arrangement with McGraw Hill LC ALL RIGHTS RESERVED. NO PART OF THIS BOOK MAY BE REPRODUCED OR TRANSMITTED IN ANY FORM OR BY ANY MEANS, ELECTRONIC OR MECHANICAL, INCLUDING PHOTOCOPYING, RECORDING OR BY INFORMATION STORAGE AND RETRIEVAL SYSTEMS, WITHOUT PERMISSION IN WRITING FROM MCGRAW HILL. ISBN 9781398928183 Series consultant Mayumi Tabuchi Judy MacDonald, Steve Longworth, Anne Tseng, Project manager Development editor Editor Alfonso Reyes, Kate Vandestadt, Peter Shaw Production manager Designer Design supervision 2023. Exclusive rights by McGrawHill Education UK Limited for manufacture and export. This book cannot be reexported from the country to which it is sold by McGrawHill Education UK Limited. Photo Credits tTatweer Co. for Educational Services tcrEric IsseleeShutterstock, trAleksandr BryliaevAlamy Stock SB ii 18 Photo, clLife on whiteAlamy Stock Photo, crLife on whiteAlamy, bclIan 2010Shutterstock, brJudith Collins Alamy Stock Photo blD. HurstAlamy Stock Photo, brvalzanShutterstock, insetLife on whiteAlamy Stock Photo 20 cSave nature and wildlifeShutterstock tloleksiy123RF, trLife on whiteAlamy Stock Photo, clAllan Swart 24 26 Alamy Stock Photo, crD. HurstAlamy Stock Photo, blYAY Media ASAlamy, brEnjoylifeAlamy Stock Photo 34 tlAleksandrs SamuilovsAlamy Stock Photo, trnathapol HPSShutterstock, clYAY Media ASAlamy, crSvetlana FooteAlamy, blChris ClorBlend Images, brLightField StudiosShutterstock llynx 41 cHolly HildrethMcGraw Hill, rIngram PublishingAlamy Stock Photo lr, tbAndrew Paul DeerShutterstock, 45 2Jan StriaShutterstock, 3DavesayitShutterstock, 4Tatiana GrozetskayaShutterstock, 5Vaclav Sebek Shutterstock, 6paula frenchShutterstock, 7davegkuglerShutterstock, 8Nick FoxShutterstock, 9Donovan van StadenShutterstock, 10fouroaks123RF, 11Glow Images, 12semue85Shutterstock, 13Panther Media GmbHAlamy Stock Photo tbPix OneShutterstock, 2Fotos593Shutterstock, 3Chase SwiftGetty Images, 4Tom Reichner 46 Shutterstock, 5McGrawHill Education, 6SeregamShutterstock, 7Jan StriaShutterstock, 8Martin Strmiska Alamy Stock Photo, 9Elko TsuchiyaShutterstock lr, tbbigjom jomShutterstock, 2David CarilletShutterstock, 50 3Tatweer Co. for Educational Services, 4Alina ZamogilnykhShutterstock, 6 McGrawHill Education Tatweer Co. 56 for Educational Services lr, tbMoatassemShutterstock, 2Alexander ChaikinShutterstock, 3allexxandar123RF, 57 4Volodymyr DvornykShutterstock, 5AHMAD FAIZAL YAHYAShutterstock, 6Tatweer Co. for Educational Services, 7dnavehShutterstock, 8Volodymyr DvornykShutterstock 1Aui MeesriShutterstock, 2MikbizShutterstock, 59 3Hannu LiivaarAlamy, 4Tom SagaShutterstock, 5vkstudioAlamy lr McGrawHill Education, 2pmozz 62 Shutterstock, 3George DoyleSuperStock, 4Irina NartovaShutterstock lrJames GathanyCDC, 2Punit Gupta, 64 3ElenamivShutterstock, 4fam DubaiShutterstock lrGordana SermekShutterstock, 2ZurijetaShutterstock, 70 3zi30Shutterstock, 4MWermuthShutterstock lr, tbLana StemShutterstock, 2Lana StemShutterstock, 72 3FernandodiassShutterstock, 4Istvan CsakShutterstock, 5Istvan CsakShutterstock, 6Photoongraphy Shutterstock, 7Aakash BagchiShutterstock, 8Nor GalShutterstock, 9demidoffShutterstock Es sarawuth 73 Shutterstock lr, tbYuri ArcursDesignPics, 2Ruslan KudrinShutterstock, 3Radius ImagesImage Source, 74 4CosminIftodeShutterstock, 5BohbehShutterstock, 6Image Source clb71Shutterstock, clAmmar Rasheed 82 Shutterstock, clVladislav AshikhminAlamy Stock Vector crTarikdizShutterstock, bltiny windmillShutterstock, brtiny windmillShutterstock clbaibazShutterstock tlOrlaShutterstock Tatweer Co. for Educational Services 90 91 96 98 cmkos83123RF, insetZurijetaShutterstock 1Chris ClorBlend Images insetLife on whiteAlamy Stock 104 106 Photo, 1Save nature and wildlifeShutterstock, 10valzanShutterstock 5Colorfuel StudioShutterstock 108 109 11Colorfuel StudioShutterstock.", "Goal 74 My Day, Animals, Places Talk Time I can tell the time, ask, and talk about everyday activities. I listened to days this week. Name Class 1 Listen, point, and say. Then write. seven 2. I go to school at 1. I get up at oclock. oclock. 2 0 9 0 3. I eat lunch at 4. I go to bed at oclock. oclock. 2 Put the days of the week in the right order. Write. Thursday Monday Sunday Friday Tuesday Wednesday Saturday Sunday 5. 1. 6. 2. 3. 7. 4. 196"]