["Unit17 Plants must have water 1 Listen and read 1 2 We must put the plant in the Man Today, we are going to plant some Kareem ground. trees. The roots carry water to the Kareem Many children are planting trees today. Ali leaves of the tree. First, you must dig a hole. Man We must be gentle. The roots Ali arent strong. 3 4 Now, we must water the plant. Kareem Plants must have water and sun to grow. Do we have to water our tree every day? Ali No, you dont. You dont have to water Man the plant every day in winter. In spring, you Now we must wait for our Kareem must water it every week. It is hot. tree to grow! Our tree makes fruit! 68", "2 Listen and complete market bakers park hospital Hotel Museum Post of ce School Now In the past Now, this is a sports centre. In the past, the 3 Look and say sports centre wasnt here. It was a chemists. 45 Now In the past", "5 Listen and say sports centre street swimming 6 Talk about you On Monday afternoon, I wasnt at the park. I was at the market. At the weekend, I wasnt at the market. I was at the sports centre. 7 Sing This is my town look at it now. It wasnt the same in the past. The bakers and the park werent here. And the hotel wasnt near. This is my town look at it now. It wasnt the same in the past. On the top of the hill, there was a forest. The trees there were the highest! This is my town look at it now, It wasnt the same in the past. Now, lots of people visit my town. They are happy walking around! 47", "Unit6 Were going to visit a farm 1 Listen and read 1 2 Were going to see the goats and Samira Look! Weve got an email from Samira the chickens! Uncle Hassan and Aunt Muna. Were going Were going to plant aubergines Kareem to visit them at their farm in Deir Alla! and tomatoes. Were going to pick fruit. 3 4 Its going to be warm on the farm. Samira Im going to take my sun hat. Are you Lets read about Deir Alla. Samira going to take your camera? Im going to draw lots of pictures Kareem Yes, I am. Im going to take lots Kareem on the farm. of photos. 24", "7 Project My diary 1 Read and answer Write a diary about what you did last week. 1 What did you do on Friday? What did you do on Saturday? 2 How did you help your town? Give ideas. 3 go to the mosque play volleyball visit your grandparents clean the beach go to a restaurant listen to CDs go to a museum go to the library listen to the radio listen to a story do homework plant a tree play table tennis go to the sports centre 2 Write your diary My diary Last Friday, I went to the mosque with my father. I went to the library on Saturday. On Sunday afternoon, I went to the sports centre with my friend, Sameer. We played football. On Monday, I did my homework after school. My brother and I played volleyball on Tuesday. We visited my grandparents on Wednesday. My grandmother cooked lunch. Then, on Thursday, my family and I went to a restaurant. Rakan 3 Ask and answer What did you Friday? do on I went to the mosque with my father. 75", "Contents First semester UNIT 1 We always do our homework 4 UNIT 2 We sometimes play volleyball 8 UNIT 3 Im reading about Jordan 12 UNIT 4 Review 16 UNIT 5 The dolphins are jumping 20 UNIT 6 Were going to visit a farm 24 UNIT 7 Were travelling to Ajloun today! 28 UNIT 8 Squirrels are smaller than deer 32 UNIT 9 Review 36 Second semester UNIT 10 The Earth isnt the biggest planet 40 UNIT 1 Our city wasnt called Amman 4 UNIT 12 We visited a museum 48 UNIT 13 Review 52 UNIT 14 We didnt live in a city 56 UNIT 15 What time did you arrive? 60 UNIT 16 I found an old coin 64 UNIT 17 Plants must have water 68 UNIT 18 Review 72 Picture dictionary 76 Wordlist 80", "5 Listen and say twelfth tree 6 Listen and point cid2cid3 cid5cid3 cid4cid3 cid6cid3 7 Sing We usually wake up at six oclock And we dont usually do anything special. But today were going on a school trip, Were going to visit a castle! We usually travel to school by car And school starts at a quarter to eight. But today were walking across the bridge To get to the castle gate. We usually say goodbye to our friends When school ends at a quarter past one. But today were at the top of the castle Where its nice and warm in the sun. 31", "2 Listen, order and say a b c d They went to Madaba. 3 Ask and answer drove bought What did you do went pray weekend? at the found had sent wrote I went to the mosque with my father. We prayed. 65", "4 Read and choose Dear Laila and Ali, Were going to Aqaba. Dad is driving. We are driving through the mountains. We are visiting Hammamat Main. There is a very big waterfall. The water is very warm. The sky is blue. We are swimming and playing in the water in Hammamat Main. Here is a photo. Samira and Kareem The family is travelling The family is travelling to Aqaba by plane. 1 car to Aqaba by car. a waterfall at Hammamat Main. There is isnt 2 The water is cold. 3 warm Kareem and Samira are 4 swimming in the water reading waterfall. about the Kareem and Samira are a photo. 5 looking at sending Are you playing piano? the No, Im not. Are you writing email? an Yes, I am! 14", "5 Listen and say glass playing sleeping 6 Listen and order a b c d What is your 7 Look and say doing? mother swim sleep work play read cook sail study write She isnt cooking. 23 She is reading.", "5 Listen and say black laugh Listen and point 6 cid2cid3 cid5cid3 cid4cid3 cid6cid3cid3 Look and say 7 Last week Last week, I played table tennis. I didnt visit a museum. 59", "Unit16 I found an old coin 1 Listen and read 2 1 On Friday, we drove to Samira Good morning, children! Today, Miss Nadia Madaba. We saw the mosaics. They were going to listen to Samiras story. are very beautiful! On Thursday, Uncle Issa and Aunt Samira Majeda arrived. 4 3 We walked around the town. Kareem Samira found an old coin near the museum! We took the coin to the museum. We spoke to a man at the museum. The coin is in the museum now. Samira The man at the museum wrote us a letter, and he sent us a photo! 64", "Unit10 The Earth isnt the biggest planet 1 Listen and read 2 1 Why are the stars brighter on Uncle Kareem Hassans farm than they are here in Amman? This is the Childrens Museum. Mum The stars arent brighter there. The sky is Dad Its very light in the museum. Samira darker there. You can see the stars. How are we going to see the stars? Lets go to the planetarium tomorrow. Mum The planetarium is the darkest Dad We can learn about stars and the planets there. room in the museum. 3 4 The Earth isnt the biggest Samira Venus is the hottest planet. You cant make a Man planet. It isnt the hottest planet. snowman here! And Jupiter is the biggest planet. But its my favourite planet! 40", "Picture dictionary 4 Read and answer Places Dear Grandma and Grandpa, Were in Aqaba! Were staying in a hotel by the sea. Were at the Marine Park on the beach. We arent sdweimsemrintg. Were Where are Samira valley They are Kareem? and looking at fish and a turtle. The turtle in Aqaba. isnt swimming. Its sleeping! Mum is looking in the shop. She is buying some forest postcards. From Samira and Kareem farm sea Where are they staying? Where are Samira and Kareem? 2 1 beach What are Samira and Kareem Are they swimming now? 4 3 looking at? Is the turtle swimming? 5 Space Is Mum looking at the sh? 6 the sun stars the moon the Earth 7721", "5 Read and match a 1 Yesterday, my aunt, my uncle and my cousins visited us. I helped Mum in the kitchen. After lunch, I played with my cousins. At ve oclock, we waved goodbye. Nour 2 b Yesterday was a fun day for me. I walked up a hill with my family. We looked at the view from the top of the hill. It was beautiful. Kamal 3 c Yesterday, we visited my grandparents. They live in Amman. They showed us the buildings in the city. We liked the Roman Theatre. Amal 4 d YYeesterday morning, I fi nished my homework. I used the computer for my project. In the afternoon, I walked to the park with my father. We played football in the park. Sami 6 Read and answer What did you do yesterday? 54", "Picture dictionary Places mosque theatre museum Animals wolf jackal squirrel deer 79", "2 Listen and match Sunday Monday Tuesday Wednesday Thursday Friday a b c d e f 3 Ask and answer do my homework What are you going to do on go to the library Im going to play sports. Im Saturday? going to go to a restaurant. play sport go to a restaurant go to the park read a book write an email use the computer go to the beach 2215", "2 Listen and match a b 3 Look and say Mum is talking on the phone. She is talking to my aunt. 13", "3 I always do my homework. Look and say always sometimes never a c b do my homework win a match send emails f e d play table tennis go to the park go to the sports centre 4 Listen and choose the best answer What day is it today? 1 Monday Tuesday Wednesday a. b. c. What time is it? 2 half past eight half past seven half past three a. b. c. What is Salwa doing now? 3 homework sailing playing a. b. c. What is Ziad doing now? 4 sailing with his father playing in the park with his friends a. b. playing tennis c. What does Salwa like doing? 5 today? What day is it using the computer going to the sport centre a. b. playing table tennis c. What does Ziad like doing? 6 sailing and riding his bike swimming a. b. Its Tuesday. playing table tennis c. 1177", "3 Look and say Yesterday, Saleem went to the mosque. He didnt watch television. 4 Look and say I must buy milk. I dont have to buy bananas. 73", "Unit13 Review At the weekend, we were in the old city in Amman. In Amman, there are lots of new buildings. The Childrens Museum is a new building. It wasnt there when Mum and Dad 1 were young. Now, its Listen and read the brightest building in Amman! We also visited an old museum. We learned about how people lived in the past. They lived in tents. They used goats hair for the tents. Kareem and Samiras diary At the weekend, we were in the old city in Amman. In Amman, there are lots of new buildings. The Childrens Museum is a new building. It wasnt there when Mum and Dad were young. Now, its the brightest building in Amman! We also visited an old museum. We learned about how people lived in the past. They lived in tents. They used goats hair for the tents. 2 Look and say on Monday morning on Tuesday afternoon on Wednesday afternoon on Thursday afternoon at the weekend in the summer On Monday morning, I was at school. 52", "Wordlist across U7, U9 east U6, U9, U10 mouse U3 U18 after U1, U3, U4, U6, enjoy U14, U18 neck U12 steps U7, U9, U11 U9, U13, U18 evening U12 night U10, U13, U14, stone U11 afternoon U7, U9, famous U15 U18 story U16, U18 U11, U12, U13 farm U6, U9, U10 north U6 street U11, U13 air U17, U18 fast U2, U4, U5, U10 past n U11, U12, sun U7, U9, U10, Arabic U1, U4 football match U2, U6, U 13, U14, U18 U17 around U1, U4, U10, U7 P.E. U1 sun hat U6, U9, U17 U11, U16, U17 forest U8, U9, U11, people U2, U5, U8, swim U2, U3, U4, U5, arrive U6, U15, U16 U13 U9, U11, U12, U13, U7, U9, U11, U15 beach U5, U9, U14, fountain U11, U13 U14, U15, U18 table tennis U2, U4, U16, U18 frightened U8, U12 pick v U6, U9, U17 U6, U7, U9, U14, beautiful U8, U12, fun U2, U4, U7, U10, picnic U6, U7, U9, U18 U13, U15, U16, U18 U12, U13, U14, U17 U16 take v U5, U6, U7, between U11, U13 gate U7 planet U10, U13 U9, U17, U18 boat U5, U9, U16 gentle U17 planetarium U10, U13 team U4 bottom U5, U9, U15 glass U5, U9 plant v U6, U9, U12, tent U12, U13, U14, break n U1 go up U7 U17, U18 U17, U18 bridge U7, U9, U13, ground U17 play the piano U5, U7, the Earth U10, U13 U16 grow v U17 U9 think U4, U8, U14 bright U10, U13 gold U16 postcard U5, U9, U10, top U7, U9, U11, brush n U6, U9 hall U1, U2 U16 U13 bronze U9, U16 handball U2, U4, U7 pretty U8, U13, U15 tower U16 camel U12, U14, U15 help v U2, U6, U7, printer U3 tunnel U15 camera U6, U9 U12, U13, U14, U17, project n U3, U4, U7, turn around U10, U13, canyon U15 U18 U9, U13, U18 U17 careful U17 hole U17 pool U11, U12, U13 twelfth U7, U9 carry U12, U14, U15, hotel U5, U9, U11, pupil U1, U7, U13 use v U3, U4, U6, U17 U14, U15 radio U14, U18 U7, U12, U13, U14, carve U15, U18 Islamic Education U1, rocks U15, U18 U17 cave U15 U5 room U3, U7, U10, valley U6, U9 castle U5, U9 jackal U8, U13 U15, U18 village U14, U16 CD U14, U18 keyboard U3 roots U17 volleyball U2, U4, U9, century U7, U9, U15, lab U1 rug U16 U14, U15, U17 U16 last week U14, U16, sail U2, U4, U5, U17 wait U5, U7, U9, U12, chicken U1, U3, U6, U18 same U11 U17, U18 U7, U9 last year U14, U18 sea U5, U9, U16, wake up U7 clean U2, U17, U18 laugh v U14 U17 warm U3, U6, U7, clothes U12 leafleaves U9, U17, send U3, U4, U7, U16, U13 coin U16, U18 U18 U18 water v U17, U18 colourful U16 learn v U3, U4, U10, sew U12 waterfall U3, U18 diary U3, U4, U9, U12, U15 shade U17 wave v U12 U12, U13, U14, U18 library U1, U3, U4, shark U5 weekend U4, U9, U11, dolphin U5, U9, U17 U6, U7, U10, U15, sheep U16 U13 dangerous U8, U9 U17, U18 ship U12 west U6, U9, U10 dark U10, U13, U14 light adj U10 show v U1, U13, wet U10, U13 day U1, U4, U10, U12, look down U7, U9 U15 win U2, U4 U13, U17 lunchtime U16 silver U16, U18 wolf U8, U9, U13 decide v U12, U15 make a video U5, U7, sixth U16 wood U17 deer U8, U9, U13, U9 Social Studies U1 wool U16 U18 map U16, U18 south U6 yesterday U12, U13, desert U12, U14, U18 monitor U3, U4 spade U17, U18 U14, U15, U16, U18 different U11, U13 moon U10, U13 squirrel U8, U9, U13, dig v U17, U18 mobile phone U14 U18 drink n U10, U12 morning U4, U9, U10, stadium U2, U4, U11 dry U10 U12, U13, U15, U16 stage U11, U13 DVD U14 mosaic U16, U18 star U10, U13, U14,", "Unit5 The dolphins are jumping 1 Listen and read 1 2 Hello Grandma! Today were at Samira the Marine Park in Aqaba. The bottom of the boat is glass. It Samira isnt sailing fast. Were looking at the sh. I Thats lovely! Are you looking Grandma can see sh! at the sh? No, we arent. Were waiting for Samira a boat! 3 4 Look! Theres a shark under the Kareem boat! It isnt a shark. Its a dolphin. Dad Is the dolphin eating the sh? Kareem No, it isnt. Its playing with the Mum Grandma, the dolphins are jumping Samira sh! in the sea! Kareem is making a video for 20 you!", "2 Look and say big small hot cold wet dry Zarqa Petra Amman Aqaba Irbid Wadi Rum Amman is bigger than Irbid. Amman is the biggest city in Jordan. 41", "4 Read the story, choose and match Nader walked in the desert. Why is the camel Why does Nader Why do camels called the ship of walk in the live in the the desert? desert? desert? Nader walked in the desert. He saw many camels there. The camels were very big, with long legs and long necks. Nader liked watching the camels. He learned a lot about them. A camel is the ship of the desert, he said. It can carry things for people. The camels helped Nader. he saw many camels. a Nader walked 1 in the desert. b In the desert 2 him. c He liked 3 a lot about camels. d Nader learned 4 watching the camels. e The camels helped 5 50", "3 Listen, choose and say On Saturday, Hisham 1 a b was in the old city. 3 a On Saturday, Hisham was 2 a b b It was Hisham was at the 4 Ask and answer young old small tall Who is the tallest class? pupil in the Ali is taller than Hassan. Ali is the tallest pupil. 53", "2 Ask and answer Pupil A usually now Sunday afternoon play the piano work on my school project Monday afternoon help my grandfather send an email to my cousin Tuesday afternoon play computer games go to the sports centre Wednesday afternoon clean the park visit my friend, Ali Thursday afternoon read have a picnic Pupil B usually now Sunday afternoon go swimming play volleyball Monday afternoon go to the library play in a football match Tuesday afternoon use the computer make a video Wednesday afternoon send emails to my friends phone my friend, Amer Thursday afternoon tidy my room play handball What do you usually do I usually play the piano. afternoon? on Sunday What are you now? doing Im working on my school project now. 3 Talk about you What do you usually do afternoon? on Friday I usually visit my grandparents. 2219", "2 Listen and say right or wrong deer jackal wolf squirrel jackal A is smaller than a deer. 3 Look and say elephant lion bear giraffe cat owl eagle frog big small tall dangerous An elephant is 3 bigger than a cat.", "5 Read, match and answer a 1Amal cant play volleyball. Amal can draw. She likes drawing owers. 2Tareq is very good at sports. He can run very fast. Tareqs favourite sport is table tennis. 3Fatima is good at volleyball. She sometimes wins her volleyball matches! 4Issa doesnt like sports. He likes reading. He always has a book. b c d sports? Who doesnt like playing Who doesnt like playing sports? 1 Who can run very fast? 2 Who sometimes wins matches? 3 Who always has a book? 4 Who cant play volleyball? 5 Issa doesnt like playing sports. 6 Ask and answer What is your What is your favourite sport? 1 sport? favourite What are your mother and your 2 father doing now? What school subject are you 3 good at? What do you always do on 4 Friday? What do you do after school? 5 My favourite sport is football. 18", "Unit18 Review We nished our project last week. Many children sent us emails about our project. Where did you go last week? We went to Madaba last week. We saw the mosaic map and Kareem found an old coin! 1 Listen and read Where did you plant the tree, Kareem? We planted a tree in the school garden. We must water the tree tomorrow. It is hot now. did you enjoy about the project? rned a lot about our ul . We enjoyed the Kareem and Samiras diary We nished our project last week. Many children sent us emails about our project. Where did you go last week? We went to Madaba last week. We saw the mosaic map and Kareem found an old coin! Where did you plant the tree, Kareem? We planted a tree in the school garden. We must water the tree tomorrow. It is hot now. What did you enjoy about the project? We learned a lot about our beautiful country. We enjoyed the project a lot. 2 Ask and answer What did you do weekend? last last weekend yesterday last week last month last year I played football. I visited the museum. 72", "3 Read and answer Dear Ali, My favourite museum is the Childrens Museum. Its in AlHussein National Park in Amman. Its the biggest childrens museum in the Middle East. It is the brightest museum in Amman! There is a library, a theatre, a restaurant and a shop. My favourite room is the planetarium. Come and have fun! Its a great place to learn about life on Earth. Kareem Where is the Where is the Childrens Museum? 1 Museum? Childrens What can you do in the library? 2 Where can you learn about the 3 planets and the stars? What can you buy from a shop? 4 Where can you buy food? 5 The Childrens Museum is in AlHussein National Park in Amman. 42", "Unit12 We visited a museum 1 Listen and read 1 2 I was happy at school today. Samira We visited a museum. We Kareem learned about how people in Jordan lived In the desert, people lived in Kareem in the ppast. tents. They used goats hair for the tents. 3 4 The women baked bread. Kareem People prepared their coffee. They Kareem They sewed. Their clothes were beautiful. liked coffee. 48 Yes, I like coffee too! Mum", "Picture dictionary Sports table tennis volleyball swimming sailing Computers monitor keyboard printer mouse 76", "4 Read and say right or wrong Kareem and Samiras diary Last year, we didnt travel to the beach for our holiday. We didnt stay in a hotel. We stayed in a tent in Wadi Rum for a week! We liked the desert. It was dark at night. We looked at the stars in the black night sky. I think that there were a hundred stars! We travelled on camels. It was fun. We laughed when we looked at the photos! We enjoyed our holiday very much. Kareem and Samira 1 travelled to the beach for their holiday. They stayed in a 2 tent. They stayed in a 3 tent for two weeks. Kareem and Samira 4 looked at the stars at night. They travelled by 5 car in the desert. Kareem and Samira didnt travel to the beach for their holiday. They travelled to the desert. 58", "4 Read and match From Kareem and Samira To Ali and Laila Dear Ali and Laila, 1Were going to go to Deir Alla! Deir Alla is west of Amman. At my uncles farm, were going to see the animals! Then, were going to have a picnic at the Yarmouk River. 2After this, were going to visit the old Roman Theatre at Umm Qais. Kareem and Samira a b 5 Look and say Its north of Amman. 1 Its south of Amman. 2 Its west of Amman. 3 Its east of Amman. 4 Irbid is north of Amman. 206", "Unit9 Review Now, were staying with Uncle Hassan and Aunt Muna on their farm. Were visiting Ajloun castle. Were having a picnic at the top of a hill 1 near the castle. Mum and Listen and read Dad are writing postcards. We like Ajloun Forest. There are lots of animals in the forest. Jackals and wolves are dangerous animals but they dont usually come near people. Kareem and Samiras diary Now, were staying with Uncle Hassan and Aunt Muna on their farm. Were visiting Ajloun castle. Were having a picnic at the top of a hill near the castle. Mum and Dad are writing postcards. We like Ajloun Forest. There are lots of animals in the forest. Jackals and wolves are dangerous animals but they dont usually come near people. 2 Ask and answer Sunday afternoon What are you Tuesday afternoon going to do on Thursday afternoon afternoon? Sunday Friday Saturday Im going to do my homework. 36", "2 Listen and choose a b c 1 a b c 2 3 Ask and answer stay? Where learn about? What did you travel? How arrive? When 61", "Unit8 Squirrels are smaller than deer 1 Listen and read 1 2 What animals live in the Kareem forest, Uncle Hassan? There are squirrels, Uncle Hassan wolves, jackals and deer. Squirrels Today, we are in Ajloun Forest. Kareem are smaller than the other animals. Look at all the pretty spring owers Samira Squirrels live in the trees. and green trees! Yes, the owers are prettier in Aunt Muna 4 spring than they are in autumn. 3 Whats that animal? Its big. Is it a Kareem Im frightened! Samira fox? Is it a jackal? Dont be frightened, Uncle Hassan I think that its a jackal. Aunt Muna Samira! Its a deer! A deer isnt No, this animal is bigger than a Uncle Hassan dangerous. jackal. The deer is more frightened Mum 32 than you are, Samira!", "4 Read and answer T Kg Ah Sm n An. My e o h l . My d o m. I g l . Tyo y l n a h. I g l. I y l n Sy. Or l m . Sa t y l. S ble . Km What sport do people play at King Abdullah Stadium? 1 Who does Kareem go to the stadium with? 2 Does Kareem like watching football matches? 3 How many people play in a football match? 4 When does Kareem play football? 5 What sport do people play at Can Samira play football? 6 Stadium? King Abdullah People play football at King Abdullah Stadium. 10", "5 Listen and say tunnel summer bottom 6 Ask and answer What did you yesterday? do I was at school. I visited the library. 7 Sing What did you do yesterday? Where did you go? What did you do? I was at school with my friends. I learned about Jordan. I looked at books in the library. What did you do on Saturday? Where did you go? What did you do? I visited my grandparents. I played volleyball. I talked to my uncle and aunt. 63", "Unit11 Our city wasnt called Amman 1 Listen and read 2 1 This is the Roman Theatre. In the past, Dad the Roman Theatre was bigger. Was the stage here? Kareem Yes, it was. Dad Were there people here? Samira In the past, our city wasnt called Kareem Yes, there were. Dad Amman. It was called Philadelphia. Lets visit the old city today. Dad 4 Thats a good idea! KareemSamira 3 Were these trees here when you Samira were young, Dad? In the past, this street was a river. Mum Yes, they were! These trees were Dad There was a fountain and a big pool. Dad smaller than me when I was young. Now, 4 they are taller than the houses!", "Unit3 Im reading about Jordan 1 Listen and read 1 2 What are you doing, Dad? Kareem Im writing an email. Dad Hello, Mum. What are you Kareem Its time for lunch now, Dad! Kareem doing? Thats good! Im sending the email now. Dad Im cooking lunch. Can you set the Mum table please, Kareem? 4 Yes, of course. Kareem 3 What are you reading, Samira? Kareem Im reading a book about Samira Im travelling to Aqaba tomorrow. Dad Jordan for our school project. Do you want to come with me? Lets work on our project after Kareem Yes, please! Kareem and Samira lunch. We can use the computer. We can learn about Aqaba for our Kareem school project! 12", "4 Listen and choose There are eight planets. planets. are There seven eight 1 star. The sun is a planet 2 twice. In a day, the Earth turns around once 3 to move around the sun. The Earth takes a month year 4 to go around the Earth. The moon takes a day month 5 5 Listen and say sky small snow 6 Ask and answer cold hot old young small tall fast slow wet dry Who is the oldest My grandmother is the family? person in your oldest person in my family. Which is the animal? fastest The tiger is the fastest animal. 43", "2 Listen, choose and say a b c d e He sometimes plays table tennis. 3 Ask and answer play table tennis play handball Do you like play volleyball playing table swim tennis? sail Yes, I do. Im good at playing 9 table tennis.", "KINGDOM HEMITE O HAS F JO RD E A H N T EDUCATION MINISTRY OF Action Pack 4 Fourth Grade New Edition Pupils Book Cheryl Pelteret", "2 Look and say live in a city live in a village watch DVDs listen to the radio use a computer watch television When Grandpa and Grandma were young, they didnt live in a city. They lived in a village. 3 Talk about you travel play listen I didnt play table use watch help tennis yesterday. tidy carry visit I played volleyball. talk walk wash cook brush 57", "4 Read and complete From Kareem and Samira To Grandma and Grandpa Dear Grandma and Grandpa, Last week, we went to Madaba. We saw the mosaic map. It is very old. It is from the sixth century. It is very big. We found many villages, towns and cities on the map. We saw the sea, boats and bridges over the Jordan River. We saw sh, animals, birds, owers and trees. Love, Kareem and Samira bridges Madaba birds animals big old villages Last week, Kareem and Samira went to. 1 The map is very and very. 2 Kareem and Samira found, towns and 3 cities on the map. They saw over the Jordan River. 4 Kareem and Samira saw and 5 on the mosaic. Last week, Kareem and Samira went to Madaba. 6", "Unit4 Review This is our diary! We write our diary every week. Today, we are writing our diary in Aqaba. Dad is working here in Aqaba. We always drive from Amman to Aqaba on the 1 Listen and read Kings Highway. We are learning about Aqaba for our school projects. Our school project is about Jordan. We like Aqaba. We like swimming nd sailing. Kareem is od at swimming! Kareem and Samiras diary This is our diary! We write our diary every week. Today, we are writing our diary in Aqaba. Dad is working here in Aqaba. We always drive from Amman to Aqaba on the Kings Highway. We are learning about Aqaba for our school projects. Our school project is about Jordan. We like Aqaba. We like swimming and sailing. Kareem is good at swimming! 2 Look and say play table tennis Im good at playing swim table tennis. sail play volleyball play handball Im not very good at swimming. 16", "6 Listen and say go shopping children 7 Listen and tick Timetable Sunday Monday Tuesday Wednesday Thursday Islamic Education Arabic English Maths Science Social Studies P.E. 8 Ask and answer Whats your favourite My favourite day at school? day at school is Wednesday. What is your subject? favourite subject My favourite is Maths. 7", "AcknowledgementsThe publishers and the writers would like to acknowledge the contribution made by the Review and Adaptation Committee appointed by the Ministry of Education of the Hashemite Kingdom of Jordan, through their guidance and valued assessment of the materials, to the development of the course. New Action Pack 4 Evaluation and Adaptation Committee cid129 Dr Hamza Ali AlOmary Malak Mohammad AlMassad cid129 Dr Hussein Mohammad Yagi Manal Fahed Abu Rumman cid129 Dr Fadia Fayez AlSuyoue Nuha Suleiman Tarawneh cid129 Dr Saleh Hassan AlOmary Oba Talal Abu Hamdeh cid129 Isam Radwan Al Kasasbeh Ahmad Hussein AlQisi Haifa Hafez Takrouri . The Ministry of Education has decided to adopt this book for Jordanian schools in accordance with the approval of the Board of Education decision No. 542013 in its meeting No. 42013 on 1762013 for the 20132014 academic year. OqG e bdG eQHCG ga e LGG The authors and publishers are grateful to all those who have given York Press 322 Old Brompton Road permission to reproduce copyright material. London SW5 9JH, England Educational Research Center SAL Pearson Education Limited 2013 Pearson Education Ltd Edinburgh Gate, Harlow All rights reserved no part of this publication may be reproduced, stored in Essex CM20 2JE, England a retrieval system or transmitted in any form or by any means, electronic, and associated companies throughout the world mechanical, photocopying, recording or otherwise, without the prior written permission of the copyright holders. Educational Research Center Sayegh bldg., Zouk Mosbeh P.O Box 119232Beirut, Lebanon Kesrouwan, Lebanon ISBN 9786144065662 Printed 2013 Reprinted 20142019", "4 Read and answer Dear Grandma and Grandpa, Were in Aqaba! Were staying in a hotel by the sea. Were at the Marine Park on Kareem? Where are Samira and the beach. We arent swimming. Were looking at fish and a turtle. The turtle isnt swimming. Its sleeping! Mum is buying some books. Samira and Kareem They are in Aqaba. Where are they staying? Where are Samira and Kareem? 2 1 What are Samira and Kareem Are they swimming now? 4 3 looking at? Is the turtle swimming? 5 Is Mum looking at the sh? 6 2020", "7 Project An animal in Jordan 1 Read and answer Choose an animal that lives in Jordan. 1 Where does the animal live? Does it live in the forest or by the sea? 2 Is it big or small? What colour is it? 3 What animals are bigger or smaller? 4 Is it a dangerous animal? 5 What does it eat? 6 2 Make a leaflet about the animal An animal in Jordan Deer live in Ajloun Forest in Jordan. Deer are big animals. They are brown. They have got big ears and long legs. Jackals are bigger than deer. Squirrels are smaller than deer. Deer arent dangerous animals. Deer eat leaves and grass in the forest. Alia 3 Ask and answer Where do deer live? cid2 They live in A loun Forest in Jordan. 39", "5 Listen and say spring square go straight on 6 Look and say at home at school in a museum in a library before I go to bed before a meal on a hot day on a cold day At home, I must help my mother. I mustnt shout. 7 Sing 15th The of January is Tree Day! So lets plant trees In the park today. When we plant trees, They are very small. But as they grow, They get very tall. Trees must have water. Trees must have sun. Lets watch them grow. This is fun! 71", "4 Read and match 1 2 3 AAjloun Castle is There are lots of at the top of a Now Im at the top of steps. There are mountain. Its a the castle. Im looking lots of rooms. Now very old castle down at all the trees. Im going up more from the twelfth There are more than than thirty steps. century. forty trees! I like Ajloun Now Im walking Castle! across the bridge to go into the castle gate! a b c 230", "5 Listen and say that Thursday this 6 Look and say cid2cid5 cid2cid8 cid2cid2 cid2cid4 cid2cid6 cid2cid9 cid2cid3 cid2cid7 7 Sing a Are you good at running? b What sports do you like? Do you like table tennis? Can you ride a bike? Are you good at handball? What sports do you play? c Do you like volleyball? d Tell me what you say! Are you good at swimming? What sports do you do? Do you like football? I like these sports, too! 1", "Picture dictionary dibrI nammA abaqA paM niaM arteP eltsaC tamammaH nuoljA 78", "7 Project My free time 1 Read and answer What do you do after school? 1 What do you do at the weekend? 2 What is your favourite sport? 3 What sports are you good at? 4 Do you think sports are good for you? 5 2 Make a poster about your free time My free time After school, I always do my homework. I sometimes go to the library. At the weekend, I like to go to the park. Im good at riding my bike. I always read a book. I like reading. My favourite sport is volleyball. I sometimes play volleyball in the sports centre. I like playing volleyball and I like playing table tennis. Im good at playing volleyball! Ziad 3 Ask and answer What do you school? do after I always do my homework. I sometimes go to the library. 19", "6 Listen and say crayon brush draw 7 Look and say Mondayy Sunday 2 1 visit his grandparents do his homework y a d s e n d e W Tuesday 4 3 tidy his go to the bedroom library Thursddaayy 5 play table y a d ri F tennis 6 go to Friday prayer On SSunday, hes going to do his homework. 27", "Unit15 What time did you arrive? 1 Listen and read 1 2 Uncle Issa and Aunt Majeda! What Kareem time did you arrive? Hello, Mum! Kareem We arrived at eleven oclock this Uncle Issa morning. We liked school today. Samira How did you travel here from Petra? Samira Hello children! Good, come into Mum the living room. We have visitors! We travelled by car. Aunt Majeda 3 4 We learned about Petra at Kareem school today. What did you learn about? Uncle Issa Where did people live? Samira Miss Nadia showed us photos Kareem of Petra. Its at the bottom of a canyon They lived in caves in the Aunt Majeda the Siq. rocks. They carved tunnels in the rocks. 60 Petra is very beautiful!", "4 Read and answer We must plant more trees. Trees are very important. Trees are homes for many animals and birds. They give us shade in the summer. They clean the air. 15th Trees give us wood and paper. Every year on January, children plant trees. It is an important day. We sing songs. We take photos and make videos. We watch the trees grow. important? Are trees Are trees important? 1 Where do many animals and birds live? 2 How do trees help us when it is hot? 3 What do trees give us? 4 Yes, they are 15th What happens on January? 5 important. 70", "2 Look and answer Are they ying 1 a kite? Is she making a 3 video? Are they waiting 2 for a boat? 6 Is he writing 4 Is the dolphin Are they 5 a postcard? sleeping? drinking juice? Are they ying a kite? No, they arent. They are sailing on a boat. 3 Ask and answer piano? Are you playing the play the piano write an email draw a picture write a postcard phone a friend listen to music take a photo No, Im not. make a video Are you writing email? an 2211 Yes, I am!", "5 Listen and say frog green pretty flowers 6 Look and say old young small tall Dad Grandpa Grandpa is older Mum than Dad. Grandma Abla Yousuf 7 Talk about you I am taller than my brother. I am younger than my sister. 35", "2 Listen, order and say She played with her cousin in the garden. a b c d 3 Talk about you Yesterday, I played play visit cook help tennis in the morning. In the afternoon, I wave learn listen helped my mum. tidy use wait plant 49", "Unit14 We didnt live in a city 1 Listen and read 1 2 Whats this, Grandpa? Samira Look, its like a CD. You can Grandpa listen to music on it! When we were young, we didnt Grandma live in a city. We lived in a village. I like this music, Grandpa. Kareem We listened to music when we Grandpa We didnt travel to school by car. Grandpa were young. But we didnt have CDs! We walked to school. 3 4 We didnt use computers when Grandma We didnt use mobile phones. Grandma we were young. We watched television. We didnt Grandpa But we like using computers Grandpa watch DVDs. We listened to the radio. now! 56", "Unit2 We sometimes play volleyball 1 Listen and read 2 1 This is fun. I like playing Samira volleyball. Kareem can run very fast! Laila Youre good at playing Laila Yes, Kareem is good at running. Samira volleyball, too! Whats your favourite sport? My favourite sport is volleyball. Laila 4 We sometimes play volleyball. Lets go Samira to the sports centre on Saturday! 3 Can you play handball? Kareem No, I cant! But I can play table tennis. Ali Im not very good at playing table Kareem tennis. I sometimes play table tennis with Samira. We are all good at Kareem She always wins! playing table tennis today! 8", "5 Listen and sayy blue climb flying 6 Look and find 1 computer 2 monitor 3 printer 4 keyboard a 5 mouse b c d e 15", "4 Read and match 1 We live in Amman. Its a big city. Our house is near the mosque. We go to the mosque to pray. 2 We always visit the Roman Theatre with our parents at the weekend. 3 We go shopping at the market. 4 We visit the museum. We never touch anything in the museum. We like our city! Kareem and Samira b a c d Amman isnt a 5 Amman is a Right or wrong? small city. It is a small city. big city. Amman is a small city. 1 Kareem and Samira dont live near the mosque. 2 They go to the mosque to pray. 3 They never go to the museum. 4 They like Amman. 5 6", "2 Look and say 2 1 3 get up have breakfast go to school 4 5 6 start school do homework go to bed Ali always gets up at six oclock. He never gets up at a quarter past six. I always brush my 3 Talk about you teeth twice a day. brush my teeth twice a day talk in the library get up late run in the classroom eat in class do my homework brush my hair wash my hands before I eat forget my schoolbooks I never talk in go to the mosque by bike the library. 5", "4 Read and complete Dear Ali and Laila, There are many animals in Ajloun Forest. There are deer, jackals and wolves. They are all big animals, but jackals and wolves are more dangerous than deer. The squirrel is a small animal. It lives in the trees. Many people walk in the forest in the spring. The flowers are more beautiful in spring than in summer. From Kareem and Samira deer animals flowers people squirrels Jackals and other big live in Ajloun Forest. 1 A wolf is more dangerous than a. 2 live in the trees. Small animals called 3 There are more in the forest in the spring. 4 come to the forest to walk. 5 Jackals and other big Ajloun animals live in Forest. 34", "Unit Were travelling to Ajloun 7 today! 1 Listen and read 1 2 We usually go to the library on Samira What are we going to do Kareem Saturday. tomorrow? But today were travelling to Kareem We usually go to the Aunt Muna Ajloun! market on Saturday. But tomorrow were Uncle Hassan 4 going to take you to Ajloun! 3 I cant see Uncle Hassan. Where is Samira he? Wait for me here. Im Uncle Hassan walking up the steps. I can see him! Hes at the top of the Kareem 28 castle. Hes taking a photo of us!", "5 Listen and sayy knee photo write 6 Look and say a b c They drove to the beach. drove had went d e f saw found bought 67", "7 Project My town in the past 1 Read and answer Find out about your town in the past. Is it different now? 1 What was the name of your town in the past? 2 What was there in your town in the past? Was there a river? Was 3 there a Roman Theatre? Was your street different in the past? How was it different? What 4 shops were there? How did people live in your town in the past? 5 2 Work in pairs. Talk to the class about your town. Use photos if you can. 3 Ask and answer Amman was different in the There is a Roman past. It was called Theatre in Amman. Philadelphia. It In the past, the is a very old city. Roman Theatre was bigger. 5", "Unit1 We always do our homework 1 Listen and read 1 2 This is the library. We always Samira My name is Kareem. This is my Kareem read books here. We never talk in friend, Ali. He is a new pupil. the library. My name is Samira. This is our Samira classroom. Miss Nadia is our teacher. This is Laila. She is a new pupil. Miss Nadia 4 Hello! Come with us. Samira I can show you around the school! 3 What do you do after school? Laila We always do our homework. Samira This is the lab. We always have Kareem At the weekend, we go to the park. Science here. We ride our bikes in the park. Where do we have P.E. lessons? Ali Do you want to come to the Kareem park with us? We have P.E. lessons in the hall. Kareem We always run and exercise in P.E.! Yes, I do! Thank you! Ali 4", "4 Read and answer The Nabateans lived in Petra a long time ago. They travelled into the canyon. They liked the canyon and they decided to make a city. Some Nabateans lived in caves. They carved tunnels to carry water. They carved buildings and a theatre into the rocks. Now, many people visit Petra. It is very famous! Kareem and Samira Petra? When did the Nabateans live in When did the Nabateans live in Petra? 1 How do you think they travelled into the 2 canyon? Where did they live? 3 How did they carry water? 4 What did Nabateans carve into the rocks? 5 The Nabateans lived in Petra Why is Petra very famous? 6 a long time ago. 62", "3 Listen and choose What is Nada going to do? 1 What is Omar doing? 2 What do Hussein and Ghada do on Wednesday afternoon after lunch? 3 a c b 1 2 a c b a c 3 b 4 Ask and answer What does your mother My mother usually usually do on Sunday works in a hospital. morning? What is your mother My mother is now? doing helping my 23117 grandma.", "5 Read and match 1 Were going to visit the Marine Park. Were going to see the dolphins. 2 Were going to visit the shop. Im going to buy a toy dolphin. My mother is going to buy some postcards. 3 After lunch, were going to go to the beach. Im going to wear my sun hat. 4 At half past ve, were going to go home. Were going to watch a video. Its about a dolphin in the sea. Dolphins are bigger than sh. a b c d 6 Ask and answer What is your father doing now? 1 What is your father doing What are you going to do at 2 now? the weekend? What do you usually do in the 3 summer holidays? Is your mother working now? 4 My father is working. What can you see at the sea? 5 He is a pilot. He is What can you see on a farm? 6 ying a plane. 2308", "5 Listen and say ball drink comb 6 Look and say 2 1 3 4 5 6 Yesterday, Omar brushed his teeth at half past six. 51", "5 Read and match a 1 We went to Wadi Rum. It is beautiful. We saw the desert. We stayed in tents. We saw the stars at night. 2 I went to Petra last summer with my family. I learned about how people lived in the past. People b c carved many buildings in the pink rocks. 3 We visited Wadi Mujib. We saw many animals and birds. They are safe there. We saw the waterfall. We had a lovely walk. 6 Listen, read and match b Jackals, deer and wolves live here. There are beautiful owers in spring. Birds and squirrels are in the trees. And the leaves and the grass are green. a 74", "2 Listen, match and say a d c b You must dig a hole. 3 Look and say must dont have to We are going on holiday! We must take a sun hat. 69", "4 Read and match Quraysh Street in Amman wasnt a street in the past. It was a river. You can see a stone fountain in the street. The fountain is old. In the past, the fountain was bigger. There were mosaics and a pool. The pool wasnt for swimming! The water in the pool was from the river. The houses werent here in the past. Now you can see the fountain between the houses. wasnt for swimming. a Quraysh Street 1 werent here in the past. b The fountain 2 was bigger in the past. c The pool 3 Quraysh Street was a river in the past. d The water in the pool 4 was a river in was from the river. e The houses in the street 5 the past. 46", "Picture Dictionary apple p26 bear p26 bed p22 black p8 blue p8 brother p24 brown p8 clap p12 cow p26 Dad p24 duck p26 ears p14 36", "UUnniitt 33 My Family Fun Time! Talk Time 4 Lets Shake Hands Make threes. Introduce each other. 1 Listen and say. This is my Nice to meet you. This is my friend, Ted. brother, Jack. Nice to meet you. Nice to meet you, too. 2 Practice the talk in threes. Nice to meet you, too. This is my sister, 3 Act out the talk in threes. I Can act out one of the talks about introducing GOAL 17 my brother or sister. introduce one friend to another friend. Nice to meet you, too. Nice to meet you. GOAL 18 Unit 3 Now go to page 32 20 21", "Rhythms and Sounds 1 Chant and do. Five Little Monkeys Five little monkeys jumping on the bed. One fell off and bumped his head. Ouch! Mom called the doctor and the doctor said, No more monkeys jumping on the bed! 2 Chant and change the names. Mom Dad Grandma Grandpa 2", "Rhythms and Sounds Grammar Toolbox Fun Time! Im I am 1 Listen and chant. 4 Hello Chant Greeting Relay Pass the greeting down the line. Hello, hello, hello. How are you? Im fine, thank you. How are you? Im fine. Im fine. Im fine, thank you. And you? 2 Listen and pronounce. 1. Im 2. fine 3. thank you 3 Listen and chant. Goodbye, goodbye. Goodbye Chant Oh, you again. see I Can chant the Hello Chant or the Goodbye GOAL 03 Chant. Goodbye, goodbye. ask How are you? when I come to class. GOAL 04 Goodbye to you. Unit 1 6 7", "Goal 20 My Family Rhythms and Sounds I can do the hand actions for the Five Little Monkeys chant. I listened to days this week. Name Class 1 Listen, chant, and do. Trace. little Five monkeys on the jum ping bed. fell One off And his head. Ouch! bumped called the Mom doctor And the said, doctor more on the bed! No monkeys jumping 2 Trace and write. 64", "nose p14 orange p8 pencil p2 pink p8 purple p8 rainbow p8 red p8 shoulder p14 sister p20 toe p14 white p8 yellow p8 38", "Goal 10 My Body Talk Time I can say Close your eyes. or Open your eyes. to a partner. I listened to days this week. Name Class 1 Listen and practice. Do the actions. Trace. Close your eyes. Okay. Okay. Open your eyes. Raise your hands. Okay. Clap your hands. Okay. 2 Trace and write. 54", "UUnniitt 33 My Family Talk Time 1 Listen and say. Nice to meet you. This is my brother, Jack. Nice to meet you, too. 2 Practice the talk in threes. This is my sister, 3 Act out the talk in threes. Nice to meet you, too. Nice to meet you. 20", "Picture Dictionary apple p26 bear p26 bed p22 egg p26 eyes p14 finger p25 black p8 blue p8 brother p24 Grandma p24 Grandpa p24 green p8 brown p8 clap p12 cow p26 hand p12 head p14 knee p14 Dad p24 duck p26 ears p14 Mom p24 monkey p22 mouth p14 36 37", "2 Open your book. 3 Match. We Can! 4", "UUnniitt 22 My Body Goal 08 My Friends Phonics I can make my name card. Goal 09 My Body Talk Time I listened to days this week. I can listen to the teacher and do the body actions. Name Class I listened to days this week. Name Class 1 Listen and practice. Say your name. Trace. 1 Listen, practice, and do. Trace. My names Mona. Close your eyes. This is my Open your eyes. name card. Write your name. Raise your hands. My names Clap your hands. This is my name card. Raise your hands. 2 2 Trace and write. Trace and write. 52 53", "Goal 18 My Family Talk Time I can introduce one friend to another friend. I listened to days this week. Name Class 1 Listen and practice. Trace. This is my friend, Saeed. This is my friend, Tom. Nice o meet you. This is my dad. Nice to meet you, too. 2 Trace and write. 62", "Goal 20 My Family Rhythms and Sounds Goal 21 My Family Words I can do the hand actions for the Five Little Monkeys chant. I can play the Five Finger Game. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, chant, and do. Trace. Listen and play. little Five monkeys Grandpa Grandma on the jum ping bed. fell One off Mom Dad And his head. Ouch! bumped called the Mom doctor brother sister brother And the said, doctor more on the bed! No monkeys jumping 2 2 Trace and write. Trace and write. 64 65", "Goal 18 My Family Talk Time Goal 19 My Family Rhythms and Sounds I can introduce one friend to another friend. I can shout No more monkeys jumping on the bed! I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Trace. Listen and practice. Trace. This is my friend, Saeed. No more monkeys jumping on the bed! This is my friend, Tom. Nice o No more monkeys jumping on the bed! meet you. No more elephants jumping on the bed! This is my dad. Nice to meet you, too. 2 2 Trace and write. Trace and write. 62 63", "Goal 08 My Friends Phonics I can make my name card. I listened to days this week. Name Class 1 Listen and practice. Say your name. Trace. My names Mona. This is my name card. Write your name. My names This is my name card. 2 Trace and write. 52", "CD 2 Audio Track List CD 1 Audio Track List Track Unit Workbook Section Track Unit Student Book Section 2 1 Exercise 1. Listen and practice 2 Intro Exercise 1. Listen and point 3 1 Exercise 1. Listen and practice 3 1 Exercise 1. Listen and do 4 1 Exercise 1. Listen and chant 5 1 Exercise 1. Listen and practice 4 1 Exercise 4. Greeting Game 6 1 Exercise 1. Listen, point, and 5 1 Exercise 1. Listen and chant practice 6 1 Exercise 2. Listen and pronounce 7 1 Exercise 1. Listen, point, and practice 7 1 Exercise 3. Listen and chant 8 1 Exercise 1. Listen and chant 8 1 Exercise 4. Greeting Relay 9 1 Exercise 1. Listen and practice 9 1 Exercise 1. Chant and point 10 2 Exercise 1. Listen, practice, and do 1 2 Exercise 1. Listen and practice 10 1 Exercise 2. Listen and chant 12 2 Exercise 1. Listen and chant 1 1 Exercise 3. Color Race 13 2 Exercise 1. Listen and practice 12 1 Exercise 1. Chant and point 14 2 Exercise 1. Listen and practice 13 1 Exercise 3. Make a name card 15 2 Exercise 1. Listen and practice 14 2 Exercise 1. Listen, shout, and do 16 2 Exercise 1. Listen, point, and practice 15 2 Exercise 3. Do It Quickly! 17 2 Exercise 1. Listen, point, and practice 16 2 Exercise 1. Chant and point 18 3 Exercise 1. Listen and practice 17 2 Exercise 2. Listen, point, and 19 3 Exercise 1. Listen and practice pronounce 20 3 Exercise 1. Listen and practice 18 2 Exercise 3. The Teacher Says 21 3 Exercise 1. Listen, chant, and do 19 2 Exercise 1. Listen and point 2 3 Exercise 1. Listen and play 20 2 Exercise 3. Be the Teacher 23 3 Exercise 1. Listen and practice 24 3 Exercise 1. Listen, point, and 21 2 Exercise 1. Chant and point at the practice big letters 25 3 Exercise 1. Listen and write 2 2 Exercise 3. Short, Tall, and Tail Letters 23 3 Exercise 1. Listen and say CD 3 Audio Track List Track Unit Phonics Practice Section 24 3 Exercise 4. Lets Shake Hands 02 1 Exercise 1 Listen and say 25 3 Exercise 1. Chant and do 03 1 Exercise 2 Point and say 26 3 Exercise 2. Chant and change the 04 1 Exercise 3 Say the key words names Exercise 1 Listen and touch the 05 1 27 3 Exercise 3. Five Little Monkeys words Game 06 1 Exercise 2 Cover five words 28 3 Exercise 1. Listen, point, and say 29 3 Exercise 3. Five Finger Game 30 3 Exercise 1. Listen and say 31 3 Exercise 3. Listen and write 32 3 Exercise 4. Guess the Letter 39", "IInnttrroodduuccttiioonn This way 1 2 3 4 5 6 7 8 Contents Workbook 43 Introduction 45 My Friends Unit 1 53 My Body Unit 2 61 My Family Unit 3 1 Circle. 43", "Phonics Fun Time! 1 Chant and point at the big letters. 3 Alphabet Chant Short, Tall, and Tail Letters Listen and do. A B C D E Short letters a b c d e a c e i m n o F G H I J r s u v w x z f g h i j K L M N O k l m n o Tall letters b d f h k l P Q R p q r Tail letters S T U V s u v g j p q y W X Y Z w x y z I Can GOAL 15 point to and say all the small letters from a to z. 2 Chant again and point at the small letters. point to and say the alphabet from z to a. GOAL 16 Unit 2 Now go to page 31 18 19", "Rhythms and Sounds 1 Chant and point. Head, Shoulders, Knees, and Toes Head, shoulders, knees, and toes. Knees and toes. Head, shoulders, knees, and toes. Knees and toes. Eyes and ears and mouth and nose. Knees and toes. Head, shoulders, knees, and toes. Knees and toes. 2 Listen, point, and pronounce. 1. 2. 3. 4. 5. 6. 7. 8. 14", "Letters Tracing and Writing Trace and write. 1 pple PPLE ear EAR ow OW uck UCK g G 30", "Introduction 1 Listen and point. 1. Welcome! 2. Put your bags aw ay. 3. Take out your pencils. Please take 5. a seat. 4. Take out your books. 2", "Words Whats this color? 1 Chant and point. 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 2 Listen and chant. Rainbow Ch a nt Red and yellow and pink and blue, Purple and orange and green. I can see a rainbow, See a rainbow, See a rainbow now. 8", "Introduction 1 Listen and point. 1. Welcome! 2. Put your bags aw ay. 3. Take out your pencils. Please take 5. a seat. Please open the 6. window. 4. Take out your books. Okay. 7. 8. Thank you. Youre welcome. 9. 2 3", "Goal 12 My Body Rhythms and Sounds Goal 13 My Body Words I can tell a friend to touch two body parts. I can do three classroom actions. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Do the actions. Trace. Listen and practice. Do the actions. Trace. Please stand up. Touch your head. Touch your nose. Please make a line. Please sit down. Touch your mouth. Touch your shoulders. Please make a circle. Please stand up. Touch your head. Touch your knees. Please make a circle. Touch your toes. Please sit down. 2 2 Trace and write. Trace and write. 56 57", "Rhythms and Sounds Fun Time! 1 Chant and do. 3 Five Little Monkeys Game Five Little Monkeys Act out the chant. Five little monkeys jumping on the bed. One fell off and bumped his head. Ouch! Mom called the doctor and the doctor said, No more monkeys jumping on the bed! I Can shout No more monkeys jumping on 2 Chant and change the names. the bed! GOAL 19 do the hand actions for the Five Little chant. Monkeys GOAL 20 Advice Time Obey your parents. Mom Dad Grandma Grandpa Unit 3 Now go to page 3 2 23", "We Can! Students Book 1 We Can! Copyright 2009 by McGrawHill Education Adaptation Copyright 2023 by McGrawHill Education UK Limited Published by arrangement with McGraw Hill LC ALL RIGHTS RESERVED. NO PART OF THIS BOOK MAY BE REPRODUCED OR TRANSMITTED IN ANY Contents FORM OR BY ANY MEANS, ELECTRONIC OR MECHANICAL, INCLUDING PHOTOCOPYING, RECORDING OR BY INFORMATION STORAGE AND RETRIEVAL SYSTEMS, WITHOUT PERMISSION IN WRITING FROM MCGRAW HILL. Students Book ISBN 9781398928060 2 Introduction Series consultant Mayumi Tabuchi My Friends 4 Unit 1 Project manager Development editor Editor Judy MacDonald, Steve Longworth, Anne Tseng, Production manager Designer Design supervision Alfonso Reyes, Kate Vandestadt, Vandestadt Design, Peter Shaw My Body 12 Unit 2 2023. Exclusive rights by McGrawHill Education UK Limited for manufacture and export. This book cannot be reexported from the country to which it is sold by McGrawHill Education UK Limited. My Family 20 Unit 3 Photo Credits tTatweer Co. for Educational Services trElena KharichkinaShutterstock, crYAY Media ASAlamy SB ii 19 28 Phonics Practice Stock Photo, brEclipse Studios tlAlex StaroseltsevShutterstock, tcDaria RybakovaShutterstock, 26 trisselee123RF, blG.K. Vikki HartPhotoDiscGetty Images, brsamritk123RF. 35 Word List 36 Picture Dictionary 39 Audio Track Lists 40 Objectives 41 Workbook", "Phonics Practice Alphabet Jingle apple bear cow duck egg fish Listen and say. 1 Point and say. 2 Say the key words. 3 A B C D E F a b c d e f goat hat ink jjet kiwi lion monkey nest G H g h K L M N k l m n octopus pen quilt rabbit sun tiger umbrella vase O P Q R S T U V o p q r s t u v wolf fox yard zebra Activity 1 Listen and touch the words. Use all ten fingers! W X Y Z w x y z Activity 2 Cover five words. Listen and play Wordfinder. 28 29", "Trace and write. 5 mbrella MBRELLA ase ASE olf OLF fo FO ard ARD ebra EBRA 34", "Goal 10 My Body Talk Time Goal 1 My Body Rhythms and Sounds I can say Close your eyes. or Open your eyes. to a partner. I can chant the Head, Shoulders, Knees, and Toes chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Do the actions. Trace. Listen and chant. Trace. Head shoulders,, Close your eyes. Okay. knees toes, and. and toes.. Knees Head, shoulders, knees, and toes. Okay. Open your eyes. and toes. Knees and and and nose. Eyes ears mouth Head, shoulders, knees, and toes. and toes. Knees Raise your hands. Okay. Clap your hands. Okay. 2 2 Trace and write. Trace and write. 54 5", "Words 1 Listen and point. 2. 1. Please stand up. Please come to the front. 3. 4. Please make a line. Please make a circle. 5. 6. Please go back to your seat. Please sit down. 2 Listen again, say, and do. 16", "UUnniitt 22 My Body Fun Time! Talk Time 3 Do It Quickly! 1 Listen, shout, and do. Listen and try to keep up. Close your eyes! Open your eyes! Raise your hands! Okay! Okay! 1. 2. Raise your hands! Clap your hands! Okay! Okay! 3. 4. Close your eyes! Open your eyes! Clap your hands! 2 Practice and do in pairs. Okay! Close your eyes! I Can listen to the teacher and do the body actions. GOAL 09 say Close your eyes. or Open your eyes. to a partner. Open your eyes! Okay! GOAL 10 Unit 2 12 13", "UNIT44 Phonics Fun Time! 1 Chant and point. Alphabet Chant 3 Make a name card. Write your name, draw some pictures, and show A B C D E F G your card. My H I J K L M N names......................................... O P Q R S T I Can chant the Alphabet Chant. GOAL 07 make my name card. GOAL 08 U V W X Y Z Advice Time Help your friends. 2 Color the letters. Unit 1 Now go to pages 2829 10 1", "Alphabet Jingle apple bear Listen and say. 1 Point and say. 2 Say the key words. 3 A B a b goat hat ink jjet G H g h octopus pen quilt rabbit O P Q R o p q r wolf fox yard zebra W X Y Z w x y z 28", "Words Fun Time! 1 Listen, point, and say. 3 Five Finger Game Put down your fingers one by one. Dont move them! 1. Grandpa 2. Grandma Grandpa Grandma 3. Dad 4. Mom Mom Dad 5. brother 6. brother 7. sister 2 brother sister brother Draw a family. I Can play the Five Finger Game. GOAL 21 show a family drawing and say who they are. GOAL 2 Unit 3 Now go to page 34 24 25", "UUnniitt 11 My Friends 2 Open your book. Goal 01 My Friends Talk Time I can say Hello, Whats your name?, and My names.... I listened to days this week. Name Class 1 Listen and practice. Trace. Hello. Hi. Whats your name? 3 Match. My names Tom. We Can! 2 Trace and write. 4 45", "UUnniitt 33 My Family Goal 16 My Body Phonics I can point to and say the alphabet from z to a. Goal 17 My Family Talk Time I listened to days this week. I can act out one of the talks about introducing my brother or sister. Name Class I listened to days this week. Name Class 1 Listen, point, and practice. Trace. 1 Listen and practice. Trace. z y x w v This is my brother, Badr. u t s r q p Nice to meet you. o n m l k Nice to meet you, too. j i h g f e Nice to meet you. This is my sister, Asma. d c b a Nice to meet you, too. 2 2 Trace and write. Trace and write. 60 61", "Goal 04 My Friends Rhythms and Sounds I can ask How are you? when I come to class. I listened to days this week. Name Class 1 Listen and practice. Trace. Hello! How are you? Hi! Hi! How are you? Hello! How are you? Im fine. 2 Trace and write. 48", "Syllabus Unit and Topic Talk Time Rhythms and Sounds Welcome. Put your bags Introduction away. Take out your pencils. Take out your books. Please take a seat. Please open the window. Okay. Thank you. Youre welcome. Hello. Hi. Whats your name? Chant Hello 1 My Friends My names Labeeb. Hello. How are you? Im fine, thank you. And you?Chant Goodbye Goodbye. See you again. Close your eyes. Open your Chant Head, 2 My Body eyes. Raise your hands. Shoulders, Knees, Clap your hands. Okay. and Toes Eyes, ears, mouth, nose This is my brother, Jack. Chant Five Little 3 My Family Nice to meet you. Nice to Monkeys meet you, too. This is my Mom, Dad, Grandma, sisterfriend Grandpa iv", "Goal 2 My Family Words I can show a family drawing and say who they are. I listened to days this week. Name Class 1 Listen and practice. Draw your family and say who they are. This is my Mom. This is my sister. This is my Dad. This is my Grandpa. This is my brother. This is my Grandma. This is This is the Dad. the Mom. 2 Trace and write. 6", "Phonics Practice Letters Tracing and Writing Trace and write. Trace and write. 1 2 pple ish ISH PPLE ear oat EAR OAT ow at OW AT uck nk UCK NK g et G ET 30 31", "Goal 02 My Friends Talk Time I can say Hello when I come to class. I listened to days this week. Name Class 1 Listen and practice. Trace. Hello! Hello! Hello! Hello! Hello! 2 Trace and write. 46", "Goal 14 My Body Words Goal 15 My Body Phonics I can give two classroom instructions to a friend. I can point to and say all the small letters from a to z. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Do the actions. Trace. Listen, point, and practice. Trace. a b c d e Please stand up. f g h i j k Please come to the front. l m n o p Please make a line. Please make a circle. q r s t u v w x y z 2 2 Trace and write. Trace and write. 58 59", "UUnniitt 11 My Friends Grammar Toolbox Fun Time! My names My name is Talk Time 4 Greeting Game Hello. 1 Quickly greet five people. Listen and do. Whats your name? Whats your name? Hello. Hi. My names Labeeba. 2 Practice the talks in pairs. My names Labeeb. 3 Practice with actions. I Can say Hello, Whats your name?, and GOAL 01 My names . say Hello when I come to class. Whats your name? GOAL 02 Unit 1 4 5", "Words Fun Time! 1 Listen and point. 2. 1. 3 Be the Teacher Please stand up. Give instructions to your partner. Please stand up! Please come Okay! to the front. 3. 4. Please make a line. Please make a circle. Please sit down! 5. 6. Please go back to your seat. Okay! I Can do three classroom actions. GOAL 13 Please sit down. 2 give two classroom instructions to a friend. Listen again, say, and do. GOAL 14 Unit 2 Now go to page 30 16 17", "Phonics 1 Chant and point at the big letters. Alphabet Chant A B C D E a b c d e F G H I J f g h i j K L M N O k l m n o P Q R p q r S T U V s u v W X Y Z w x y z 2 Chant again and point at the small letters. 18", "Goal 06 My Friends Words I can find three colors in the classroom. I listened to days this week. Name Class 1 Listen, point, and practice. Trace and color. This is pink. This is black. This is purple! This is purple. 2 Trace and write. 50", "Rhythms and Sounds 1 Listen and chant. Hello Chant Hello, hello, hello. How are you? Im fine. Im fine. Im fine, thank you. And you? 2 Listen and pronounce. 1. Im 2. fine 3. thank you 3 Listen and chant. Goodbye, goodbye. Goodbye Chant Oh, you again. see Goodbye, goodbye. Goodbye to you. 6", "Goal 12 My Body Rhythms and Sounds Goal 13 My Body Words I can tell a friend to touch two body parts. I can do three classroom actions. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Do the actions. Trace. Listen and practice. Do the actions. Trace. Please stand up. Touch your head. Touch your nose. Please make a line. Please sit down. Touch your mouth. Touch your shoulders. Please make a circle. Please stand up. Touch your head. Touch your knees. Please make a circle. Touch your toes. Please sit down. 2 2 Trace and write. Trace and write. 56 57", "Contents Workbook 43 Introduction 45 My Friends Unit 1 53 My Body Unit 2 61 My Family Unit 3", "Goal 06 My Friends Words Goal 07 My Friends Phonics I can find three colors in the classroom. I can chant the Alphabet Chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen, point, and practice. Listen and chant. Trace. Trace and color. Aa Bb Cc Dd This is pink. This is black. Ee Ff Gg Hh Ii Jj Kk Ll Mm Nn Oo Pp Qq Rr Ss Tt Uu Vv Ww Xx Yy Zz This is purple! This is purple. 2 2 Trace and write. Trace and write. 50 51", "Syllabus Unit and Topic Talk Time Rhythms and Sounds Words Phonics Phonics Practice Welcome. Put your bags Introduction away. Take out your pencils. Take out your books. Please take a seat. Please open the window. Okay. Thank you. Youre welcome. Hello. Hi. Whats your name? Chant Hello 1 My Friends Whats this color? Alphabet A to Z Big letters Alphabet Jingle My names Labeeb. Hello. How are you? Red, orange, yellow, green, Aa to Zz Im fine, thank you. And blue, purple, pink, white, you? black, brown Chant Goodbye Goodbye. See you again. Close your eyes. Open your Chant Head, 2 My Body Please Stand up. Come Alphabet a to z Small Letters Tracing and Writing eyes. Raise your hands. Shoulders, Knees, to the front. letters. Short, tall, and tail 1, 2 Clap your hands. Okay. and Toes Make a line. Make a circle. letters Eyes, ears, mouth, Go back to your seat. Sit nose down. This is my brother, Jack. Chant Five Little 3 My Family Grandpa, Grandma, Dad, Sounds A, B, C, D, E Letters Tracing and Writing Nice to meet you. Nice to Monkeys Mom, brother, sister apple, bear, cow, duck, egg 3, 4, 5 meet you, too. This is my Mom, Dad, Grandma, Write A to E sisterfriend Grandpa iv v", "1 mreT KB R O O W O K 1", "Word List Trace and write. 5 Again Little White p 6 p 2, 23 p 8 Apple Make a circle. Window p 26, 27 p 16 p 3 mbrella Bags Make a line. Yellow p 2 p 16 p 8, 9 Bear Mom p 26, 27 p 2, 24, 25 Bed Monkeys p 2, 23 p 2, 23 MBRELLA Blue Mouth p 8 p 14, 15 Books My name p 2 p 4, 5, 1 Brother Nice to meet you. p 20, 21, 24, 25 p 20, 21 ase Brown Nose p 8 p 14, 15 Circle Okay! p 16 p 12, 17 Clap One p 12, 13 p 15, 21, 2, 25 ASE Close Orange p 12, 13 p 8 Color Open p 8, 9 p 3, 12, 13 Come to the front. Pencils p 16 p 2 olf Cow Pink p 26 p 8 Dad Please go back to your seat. p 2, 24, 25 Doctor p 2 p 16 OLF Duck Please open the window. p 26 p 3 Ears Please take a seat. p 14, 15 p 2 Egg Purple p 26 p 8 fo Eyes Put your bags away. p 12, 13, 14, 15 p 2 Family Rainbow p 20, 24, 25 p 8 Fine Raise your hands! p 6, 7 p 12, 13 FO Finger Red p 25 p 8 Five See you again. p 2, 23, 25 p 6 Friend Shoulders p 15, 17, 21 p 14, 15 ard Goodbye Sister p 6, 7 p 20, 21, 24, 25 Grandma Sit down. p 2, 24, 25 p 16, 17 Grandpa Stand up. p 2, 24, 25 p 16, 17 ARD Green Take out your books. p 8 p 2 Hands Take out your pencils. p 12, 13, 15, 21 p 2 Head Thank you. p 14, 15, 2 p 3, 6, 7 Hello. This is my brother. p 4, 5, 6, 7 p 20 ebra Hi Three p 4 p 9, 17 Jumping Toes p 2, 23 p 14, 15 Knees Two p 14, 15 p 15, 17 EBRA Letter Welcome! p 27 p 2 34 35", "Goal 24 My Family Phonics I can write the letters A to E in the air. I listened to days this week. Name Class 1 Listen and practice. Trace. X G Y K M B P Q L C A R H F U D J V E T W O I S 2 Trace and write. 68", "Phonics 1 Listen and say. A P P L E B E A R C O W D U C K E G G 2 Trace and copy. 26", "Goal 14 My Body Words Goal 15 My Body Phonics I can give two classroom instructions to a friend. I can point to and say all the small letters from a to z. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Do the actions. Trace. Listen, point, and practice. Trace. a b c d e Please stand up. f g h i j k Please come to the front. l m n o p Please make a line. Please make a circle. q r s t u v w x y z 2 2 Trace and write. Trace and write. 58 59", "Trace and write. 3 iwi IWI ion ION onkey ONKEY est EST ctopus CTOPUS 32", "We Can! Students Book 1 We Can! Copyright 2009 by McGrawHill Education Adaptation Copyright 2023 by McGrawHill Education UK Limited Published by arrangement with McGraw Hill LC ALL RIGHTS RESERVED. NO PART OF THIS BOOK MAY BE REPRODUCED OR TRANSMITTED IN ANY FORM OR BY ANY MEANS, ELECTRONIC OR MECHANICAL, INCLUDING PHOTOCOPYING, RECORDING OR BY INFORMATION STORAGE AND RETRIEVAL SYSTEMS, WITHOUT PERMISSION IN WRITING FROM MCGRAW HILL. ISBN 9781398928060 Series consultant Mayumi Tabuchi Project manager Development editor Editor Judy MacDonald, Steve Longworth, Anne Tseng, Production manager Designer Design supervision Alfonso Reyes, Kate Vandestadt, Vandestadt Design, Peter Shaw 2023. Exclusive rights by McGrawHill Education UK Limited for manufacture and export. This book cannot be reexported from the country to which it is sold by McGrawHill Education UK Limited. Photo Credits tTatweer Co. for Educational Services trElena KharichkinaShutterstock, crYAY Media ASAlamy SB ii 19 Stock Photo, brEclipse Studios tlAlex StaroseltsevShutterstock, tcDaria RybakovaShutterstock, 26 trisselee123RF, blG.K. Vikki HartPhotoDiscGetty Images, brsamritk123RF.", "Rhythms and Sounds Grammar Toolbox Fun Time! One More than One 1 Chant and point. head shoulders mouth eyes 3 The Teacher Says Head, Shoulders, Knees, and Toes nose ears Touch what your Head, shoulders, knees, and toes. teacher says. Knees and toes. Head, shoulders, knees, and toes. The teacher says, Knees and toes. Touch your nose! Eyes and ears and mouth and nose. Knees and toes. Head, shoulders, knees, and toes. Knees and toes. 2 Listen, point, and pronounce. I Can 1. 2. 3. chant the Head, Shoulders, Knees, and Toes GOAL 1 chant. tell a friend to touch two body parts. 4. 5. 6. GOAL 12 Advice Time 7. 8. Wash your hands. Unit 2 14 15", "UUnniitt 11 My Friends Talk Time 1 Listen and do. Whats your name? Hello. Hi. My names Labeeba. 2 Practice the talks in pairs. My names Labeeb. 3 Practice with actions. Whats your name? 4", "Goal 16 My Body Phonics I can point to and say the alphabet from z to a. I listened to days this week. Name Class 1 Listen, point, and practice. Trace. z y x w v u t s r q p o n m l k j i h g f e d c b a 2 Trace and write. 60", "Phonics 1 Chant and point. Alphabet Chant A B C D E F G H I J K L M N O P Q R S T U V W X Y Z 2 Color the letters. 10", "UUnniitt 22 My Body Talk Time 1 Listen, shout, and do. Close your eyes! Open your eyes! Okay! Okay! 1. 2. Raise your hands! Clap your hands! Okay! Okay! 3. 4. 2 Practice and do in pairs. Okay! Close your eyes! Open your eyes! Okay! 12", "Phonics C 3 B D Listen and write. E A 1 Listen and say. P P L E E A R 1. 2. O W U C K 3. 4. A P P L E B E A R C O W G G 5. Fun Time! 4 Guess the Letter D U C K E G G Write in the air and ask your partner. 2 Trace and copy. Its an E! Whats this letter? Its a C! I Can make the sound of the letters A, B, C, D, GOAL 23 and E. write the letters A to E in the air. GOAL 24 Unit 3 26 27", "Goal 02 My Friends Talk Time Goal 03 My Friends Rhythms and Sounds I can say Hello when I come to class. I can chant the Hello Chant or the Goodbye Chant. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Trace. Listen and chant. Trace. Hello! Hello, hello, hello. Hello! How are you?Hi. Im fine, Im fine, Im fine, thank you. And you? Goodbye, goodbye, goodbye to you. Hello! Hello! Hello! Goodbye, goodbye. Oh, you again. see 2 2 Trace and write. Trace and write. 46 47", "Grammar Toolbox Words Whats this color? whats what is Fun Time! 1 Chant and point. 3 Color Race 1. 2. 3. 4. Listen and touch as fast as you can! Touch something yellow. 5. 6. 7. 8. 9. 10. 2 Listen and chant. Ra inbow C h a nt Red and yellow and pink and blue, Purple and orange and green. I can see a rainbow, I Can See a rainbow, GOAL 05 say the names of five colors. find three colors in the classroom. See a rainbow now. GOAL 06 Unit 1 9 8", "Goal 2 My Family Words Goal 23 My Family Phonics I can show a family drawing and say who they are. I can make the sound of the letters A, B, C, D, and E. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Draw your family and say Listen, point, and practice. Trace. who they are. A says a, a, apple. This is my Mom. This is my sister. B says b, b, bear. This is my Dad. This is my Grandpa. This is my brother. This is my Grandma. C says c, c, cow. D says d, d, duck. E says e, e, egg. A says a, a, apple. This is This is the Dad. the Mom. A B C D E 2 2 Trace and write. Trace and write. 6 67", "Phonics Practice Trace and write. Trace and write. 3 4 iwi en EN IWI ion uilt UILT ION onkey abbit ONKEY ABBIT est un UN EST ctopus iger CTOPUS IGER 32 3", "Words 1 Listen, point, and say. 1. Grandpa 2. Grandma 3. Dad 4. Mom 5. brother 6. brother 7. sister 2 Draw a family. 24", "Goal 04 My Friends Rhythms and Sounds Goal 05 My Friends Words I can ask How are you? when I come to class. I can say the names of five colors. I listened to I listened to days this week. days this week. Name Class Name Class 1 1 Listen and practice. Trace. Listen, point, and practice. Trace and color. Hello! How are you? orange, green, purple, whit e, brown Hi! Hi! How are you? Hello! How are you? Im fine. 2 2 Trace and write. Trace and write. 48 49"]